; AORB - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 5952
; длина при загрузке: 27 слов (54 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=KONSTA
; локальные метки: AORB=0, L0007=7, L0024=24
; AORB: код модуля
         Type: Binary
         Code: 162 (033) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0:00 043 0015 	AORB	ноп
				ноп
			START	счим	М15
      15 31 74001 		пв	'74001'(М15)
    1 12 001 0011 		зпм	9(М12)
      00 041 0016 		уим	М16
    2 00 041 0013 		уим	М13
      00 041 0011 		уим	М11
    3 00 040 0014 	L0007	уи	М14
      00 010 0000 		сч	AORB
    4 13 003 0000 		счм	(М13)
      00 037 0003 		ржа	'3'
    5 10 006 0003 		вчоб	3(М10)
      00 041 0013 		уим	М13
    6 13 25 00001 		слиа	1(М13)
      00 22 00000 		мода	AORB
    7 14 003 0000 		счм	(М14)
      11 015 0000 		или	(М11)
   10 14 25 00001 		слиа	1(М14)
      17 022 0000 		чед	(М17)
   11 11 25 00001 		слиа	1(М11)
      13 37 40007 		цикл	L0007
   12 10 015 0003 	L0024	или	3(М10)
      16 001 0000 		зпм	(М16)
   13 00 037 0006 		ржа	'6'
      12 23 00011 		мод	9(М12)
   14 00 30 00000 		пб	AORB
   15 00 043 0015 		счим	М15
      15 31 74001 		пв	KONSTA
   16 12 001 0011 		зпм	9(М12)
      00 041 0016 		уим	М16
   17 00 040 0013 		уи	М13
      13 010 0000 		сч	(М13)
   20 00 037 0003 		ржа	'3'
      10 006 0003 		вчоб	3(М10)
   21 00 041 0013 		уим	М13
      00 041 0015 		уим	М15
   22 13 25 00001 		слиа	1(М13)
      00 041 0011 		уим	М11
   23 00 040 0014 		уи	М14
      00 010 0000 		сч	AORB
   24 14 003 0000 		счм	(М14)
      11 015 0000 		или	(М11)
   25 14 25 00001 		слиа	1(М14)
      15 000 0000 		зп	(М15)
   26 11 25 00001 		слиа	1(М11)
      17 022 0000 		чед	(М17)
   27 15 25 00001 		слиа	1(М15)
      13 37 40024 		цикл	L0024
   30 10 015 0003 		или	3(М10)
      16 001 0000 		зпм	(М16)
   31 00 037 0006 		ржа	'6'
      12 23 00011 		мод	9(М12)
   32 00 30 00000 		пб	AORB
				ФИНИШ
