; APNOTF - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 8448
; длина при загрузке: 109 слов (188 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=PAGE, 2=INS, 3=INS24, 4=INS25, 5=INS26, 6=SCANER, 
; 7=SCANER1, 8=SCANER2, 9=TYPE, 10=TYPE1, 11=TYPE11, 12=TYPE13, 13=WHO, 
; 14=WHO1, 15=GOT, 16=NAMENF, 17=ENDKOR, 18=HOWSMB, 19=RASPS, 20=WRIKOR, 
; 21=WHATYP, 22=PAGE1
; локальные метки: APNOTF=0, L0001=1, L0003=3, L0007=7, L0010=10, L0023=23, 
; L0024=24, L0030=30, L0031=31, L0043=43, L0062=62, L0124=124, L0127=127, 
; L0134=134, L0136=136, L0137=137, L0140=140, L0141=141, L0142=142, 
; L0143=143, L0144=144, L0145=145, L0147=147, L0151=151, L0152=152
; APNOTF: код модуля
         Type: Binary
         Code: 564 (0136) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+APNOTF	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40127 		пб	L0127
    1 07 010 0000 	L0003	сч	(М7)
      07 000 0010 		зп	8(М7)
    2 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
    3 00 22 74006 	L0007	мода	SCANER
      00 010 0000 		сч	L0001+APNOTF
    4 00 037 0003 	L0010	ржа	'3'
      00 22 74005 		мода	INS26
    5 00 005 0000 		вч	L0001+APNOTF
      00 037 0022 		ржа	'22'
    6 00 26 40007 		по	L0007
      00 30 40010 		пб	L0010
    7 00 30 40124 		пб	L0124
   10 15 31 74025 		пв	WHATYP
   11 07 010 0010 	L0023	сч	8(М7)
      00 037 0003 		ржа	'3'
   12 07 004 0001 	L0024	сл	1(М7)
      07 000 0010 		зп	8(М7)
   13 16 24 40136 		уиа	L0136
      00 043 0016 		счим	М16
   14 16 24 40145 	L0030+L0031	уиа	L0145
      00 043 0016 		счим	М16
   15 16 24 40141 		уиа	L0141
      00 043 0016 		счим	М16
   16 00 037 0022 		ржа	'22'
      15 31 74024 		пв	WRIKOR
   17 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   20 07 010 0002 		сч	2(М7)
      00 043 0000 		счим	
   21 07 010 0010 	L0043	сч	8(М7)
      17 012 0000 		нтж	(М17)
   22 00 26 40023 		по	L0023
      00 30 40024 		пб	L0024
   23 00 30 40062 		пб	L0062
   24 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   25 00 22 74017 		мода	GOT
      00 010 0000 		сч	L0001+APNOTF
   26 17 012 0000 		нтж	(М17)
      00 26 40030 		по	L0030
   27 00 30 40031 		пб	L0031
   30 00 30 40043 		пб	L0043
   31 16 24 40136 	L0062	уиа	L0136
      00 043 0016 		счим	М16
   32 16 24 40143 		уиа	L0143
      00 043 0016 		счим	М16
   33 16 24 40141 		уиа	L0141
      00 043 0016 		счим	М16
   34 15 31 74024 		пв	WRIKOR
   35 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   36 16 24 40136 		уиа	L0136
      00 043 0016 		счим	М16
   37 16 24 40145 		уиа	L0145
      00 043 0016 		счим	М16
   40 16 24 40141 		уиа	L0141
      00 043 0016 		счим	М16
   41 15 31 74024 		пв	WRIKOR
   42 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   43 16 24 40137 		уиа	L0137
      00 043 0016 		счим	М16
   44 16 24 40144 		уиа	L0144
      00 043 0016 		счим	М16
   45 16 24 40142 		уиа	L0142
      00 043 0016 		счим	М16
   46 15 31 74024 		пв	WRIKOR
   47 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   50 16 24 40136 		уиа	L0136
      00 043 0016 		счим	М16
   51 16 24 40141 		уиа	L0141
      00 043 0016 		счим	М16
   52 16 24 40144 	L0124	уиа	L0144
      00 043 0016 		счим	М16
   53 15 31 74024 	L0127	пв	WRIKOR
   54 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   55 16 24 74012 		уиа	TYPE1
      00 043 0016 		счим	М16
   56 16 24 40141 	L0134	уиа	L0141
      00 043 0016 		счим	М16
   57 16 24 74014 	L0136+L0137	уиа	TYPE13
      00 043 0016 		счим	М16
   60 15 31 74024 	L0140+L0141	пв	WRIKOR
   61 00 30 40003 	L0142+L0143	пб	L0003
   62 00 22 74026 	L0144+L0145	мода	PAGE1
      00 010 0000 		сч	L0001+APNOTF
   63 00 037 0003 	L0147	ржа	'3'
      00 22 74014 		мода	TYPE13
   64 00 005 0000 	L0151	вч	L0001+APNOTF
      07 005 0006 		вч	6(М7)
   65 07 000 0011 	L0152	зп	9(М7)
      16 24 40151 		уиа	L0151
   66 00 043 0016 		счим	М16
      16 24 40147 		уиа	L0147
   67 00 043 0016 		счим	М16
      16 24 40147 		уиа	L0147
   70 00 043 0016 		счим	М16
      16 24 40152 		уиа	L0152
   71 00 043 0016 		счим	М16
      16 24 40144 		уиа	L0144
   72 00 043 0016 		счим	М16
      16 24 40142 		уиа	L0142
   73 00 043 0016 		счим	М16
      00 037 0022 		ржа	'22'
   74 15 31 74023 		пв	RASPS
   75 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   76 16 24 40152 		уиа	L0152
      00 043 0016 		счим	М16
   77 15 31 74022 		пв	HOWSMB
  100 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  101 16 24 40152 		уиа	L0152
      00 043 0016 		счим	М16
  102 16 24 74015 		уиа	WHO
      00 043 0016 		счим	М16
  103 16 24 74016 		уиа	WHO1
      00 043 0016 		счим	М16
  104 15 31 74024 		пв	WRIKOR
  105 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  106 16 24 40137 		уиа	L0137
      00 043 0016 		счим	М16
  107 16 24 40145 		уиа	L0145
      00 043 0016 		счим	М16
  110 16 24 40141 		уиа	L0141
      00 043 0016 		счим	М16
  111 15 31 74024 		пв	WRIKOR
  112 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  113 16 24 40136 		уиа	L0136
      00 043 0016 		счим	М16
  114 16 24 40143 		уиа	L0143
      00 043 0016 		счим	М16
  115 16 24 40141 		уиа	L0141
      00 043 0016 		счим	М16
  116 15 31 74024 		пв	WRIKOR
  117 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  120 16 24 74012 		уиа	TYPE1
      00 043 0016 		счим	М16
  121 16 24 40141 		уиа	L0141
      00 043 0016 		счим	М16
  122 16 24 74014 		уиа	TYPE13
      00 043 0016 		счим	М16
  123 15 31 74024 		пв	WRIKOR
  124 15 31 74021 		пв	ENDKOR
  125 15 31 74020 		пв	NAMENF
  126 00 30 40134 		пб	L0134
  127 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
  130 07 24 40140 		уиа	L0140
      00 043 0015 		счим	М15
  131 00 043 0010 		счим	М10
      00 043 0000 		счим	
  132 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
  133 12 30 00000 		пб	(М12)
  134 00 041 0000 		уим	
      00 041 0007 		уим	М7
  135 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
