; COMANN - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 11584
; длина при загрузке: 46 слов (82 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=INS, 2=INS24, 3=INS25, 4=INS26, 5=SCANER, 6=SCANER1, 
; 7=SCANER2, 8=LRE, 9=LRE5, 10=LRE3, 11=LRE4, 12=LRE2
; локальные метки: COMANN=0, L0001=1, L0005=5, L0006=6, L0010=10, L0014=14, 
; L0015=15, L0017=17, L0023=23, L0024=24, L0026=26, L0032=32, L0033=33, 
; L0035=35, L0041=41, L0042=42, L0047=47, L0051=51
; COMANN: код модуля
         Type: Binary
         Code: 246 (051) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+COMANN	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40042 		пб	L0042
    1 07 010 0002 		сч	2(М7)
      00 043 0000 		счим	
    2 00 22 74006 	L0005	мода	SCANER1
      00 010 0000 		сч	L0001+COMANN
    3 17 012 0000 	L0006	нтж	(М17)
      00 27 40005 		пе	L0005
    4 00 30 40006 	L0010	пб	L0006
    5 00 30 40010 		пб	L0010
    6 07 010 0000 	L0014+L0015	сч	(М7)
      00 22 74011 		мода	LRE5
    7 00 000 0000 	L0017	зп	L0001+COMANN
      00 30 40041 		пб	L0041
   10 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   11 00 22 74006 	L0023	мода	SCANER1
      00 010 0000 		сч	L0001+COMANN
   12 17 012 0000 	L0024	нтж	(М17)
      00 27 40014 		пе	L0014
   13 00 30 40015 	L0026	пб	L0015
   14 00 30 40017 		пб	L0017
   15 07 010 0000 	L0032+L0033	сч	(М7)
      00 22 74012 		мода	LRE3
   16 00 000 0000 	L0035	зп	L0001+COMANN
      00 30 40041 		пб	L0041
   17 07 010 0003 		сч	3(М7)
      00 043 0000 		счим	
   20 00 22 74006 	L0041	мода	SCANER1
      00 010 0000 		сч	L0001+COMANN
   21 17 012 0000 	L0042	нтж	(М17)
      00 27 40023 		пе	L0023
   22 00 30 40024 		пб	L0024
   23 00 30 40026 	L0047	пб	L0026
   24 07 010 0000 	L0051	сч	(М7)
      00 22 74013 		мода	LRE4
   25 00 000 0000 		зп	L0001+COMANN
      00 30 40041 		пб	L0041
   26 07 010 0004 		сч	4(М7)
      00 043 0000 		счим	
   27 00 22 74006 		мода	SCANER1
      00 010 0000 		сч	L0001+COMANN
   30 17 012 0000 		нтж	(М17)
      00 27 40032 		пе	L0032
   31 00 30 40033 		пб	L0033
   32 00 30 40035 		пб	L0035
   33 07 010 0000 		сч	(М7)
      00 22 74014 		мода	LRE2
   34 00 000 0000 		зп	L0001+COMANN
      00 30 40041 		пб	L0041
   35 00 22 74005 		мода	SCANER
      00 010 0000 		сч	L0001+COMANN
   36 00 037 0003 		ржа	'3'
      07 005 0000 		вч	(М7)
   37 00 22 74005 		мода	SCANER
      00 000 0000 		зп	L0001+COMANN
   40 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0001+COMANN
   41 00 30 40047 		пб	L0047
   42 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   43 07 24 40051 		уиа	L0051
      00 043 0015 		счим	М15
   44 00 043 0010 		счим	М10
      00 043 0000 		счим	
   45 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   46 12 30 00000 		пб	(М12)
   47 00 041 0000 		уим	
      00 041 0007 		уим	М7
   50 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
