; FILLS - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 15072
; длина при загрузке: 20 слов (34 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=STR, 2=STR24, 3=STR25, 4=STR26, 5=Ы2Б0
; локальные метки: FILLS=0, L0001=1, L0012=12, L0017=17, L0021=21, 
; L0022=22, L0023=23
; FILLS: код модуля
         Type: Binary
         Code: 102 (021) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+FILLS	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40012 		пб	L0012
    1 00 22 74004 		мода	STR26
      00 010 0000 		сч	L0001+FILLS
    2 00 037 0003 		ржа	'3'
      00 22 74002 		мода	STR24
    3 00 005 0000 		вч	L0001+FILLS
      07 004 0000 		сл	(М7)
    4 07 000 0001 		зп	1(М7)
      16 24 40022 		уиа	L0022
    5 00 043 0016 	L0012	счим	М16
      00 23 40023 		мод	L0023
    6 16 24 00000 		уиа	0(М16)
      00 043 0016 		счим	М16
    7 00 037 0022 	L0017	ржа	'22'
      15 31 74005 		пв	Ы2Б0
   10 00 037 0003 	L0021	ржа	'3'
      00 037 0022 		ржа	'22'
   11 00 30 40017 	L0022+L0023	пб	L0017
   12 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   13 07 24 40021 		уиа	L0021
      07 001 0002 		зпм	2(М7)
   14 00 043 0015 		счим	М15
      00 043 0010 		счим	М10
   15 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   16 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   17 00 041 0000 		уим	
      00 041 0007 		уим	М7
   20 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
