; GOSTAS - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 21024
; длина при загрузке: 32 слов (42 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=LOL, 2=LOL32767, 3=LOL7
; локальные метки: GOSTAS=0, L0001=1, L0003=3, L0015=15, L0022=22, 
; L0025=25, L0027=27, L0030=30
; GOSTAS: код модуля
         Type: Binary
         Code: 126 (025) words
      Address: 0

				СТАРТ	'0'
    0 16 24 40001 	L0001+GOSTAS	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40015 		пб	L0015
    1 07 010 0000 	L0003	сч	(М7)
      07 000 0002 		зп	2(М7)
    2 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
    3 00 23 40027 		мод	L0027
      01 24 00000 		уиа	0(М1)
    4 01 22 40027 		мода	L0027
      00 010 0000 		сч	L0001+GOSTAS
    5 01 22 74002 		мода	LOL32767
      00 000 0000 		зп	L0001+GOSTAS
    6 00 23 40027 	L0015	мод	L0027
      01 24 00000 		уиа	0(М1)
    7 01 22 40027 		мода	L0027
      00 010 0000 		сч	L0001+GOSTAS
   10 01 22 74003 		мода	LOL7
      00 000 0000 		зп	L0001+GOSTAS
   11 07 010 0002 	L0022	сч	2(М7)
      00 037 0003 		ржа	'3'
   12 07 004 0000 	L0025	сл	(М7)
      07 000 0002 		зп	2(М7)
   13 07 006 0001 	L0027	вчоб	1(М7)
      00 037 0022 		ржа	'22'
   14 00 26 40003 	L0030	по	L0003
      00 30 40022 		пб	L0022
   15 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   16 07 24 40025 		уиа	L0025
      00 043 0015 		счим	М15
   17 00 043 0001 		счим	М1
      00 043 0010 		счим	М10
   20 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   21 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   22 00 041 0000 		уим	
      00 041 0007 		уим	М7
   23 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   24 10 30 00000 		пб	(М10)
				ФИНИШ
