; GOTOPO - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 9344
; длина при загрузке: 42 слов (70 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=WHO, 2=WHO1, 3=HOWSMB, 4=RASPS, 5=WRIKOR
; локальные метки: GOTOPO=0, L0001=1, L0034=34, L0041=41, L0043=43, 
; L0044=44, L0045=45, L0046=46, L0047=47, L0050=50, L0051=51
; GOTOPO: код модуля
         Type: Binary
         Code: 210 (043) words
      Address: 0

				СТАРТ	'0'
    0 16 24 40001 	L0001+GOTOPO	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40034 		пб	L0034
    1 16 24 40043 		уиа	L0043
      00 043 0016 		счим	М16
    2 16 24 40044 		уиа	L0044
      00 043 0016 		счим	М16
    3 16 24 40044 		уиа	L0044
      00 043 0016 		счим	М16
    4 15 31 74005 		пв	WRIKOR
    5 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
    6 00 23 40051 		мод	L0051
      16 24 00000 		уиа	0(М16)
    7 00 043 0016 		счим	М16
      16 24 40047 		уиа	L0047
   10 00 043 0016 		счим	М16
      16 24 40047 		уиа	L0047
   11 00 043 0016 		счим	М16
      16 24 40050 		уиа	L0050
   12 00 043 0016 		счим	М16
      16 24 40046 		уиа	L0046
   13 00 043 0016 		счим	М16
      16 24 40045 		уиа	L0045
   14 00 043 0016 		счим	М16
      15 31 74004 		пв	RASPS
   15 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   16 16 24 40050 	L0034	уиа	L0050
      00 043 0016 		счим	М16
   17 15 31 74003 		пв	HOWSMB
   20 00 037 0003 	L0041	ржа	'3'
      00 037 0022 		ржа	'22'
   21 16 24 40050 	L0043	уиа	L0050
      00 043 0016 		счим	М16
   22 16 24 74001 	L0044+L0045	уиа	WHO
      00 043 0016 		счим	М16
   23 16 24 74002 	L0046+L0047	уиа	WHO1
      00 043 0016 		счим	М16
   24 15 31 74005 	L0050+L0051	пв	WRIKOR
   25 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   26 16 24 40043 		уиа	L0043
      00 043 0016 		счим	М16
   27 16 24 40045 		уиа	L0045
      00 043 0016 		счим	М16
   30 16 24 40044 		уиа	L0044
      00 043 0016 		счим	М16
   31 15 31 74005 		пв	WRIKOR
   32 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   33 00 30 40041 		пб	L0041
   34 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   35 07 24 40044 		уиа	L0044
      07 001 0005 		зпм	5(М7)
   36 00 043 0015 		счим	М15
      00 043 0010 		счим	М10
   37 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   40 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   41 00 041 0000 		уим	
      00 041 0007 		уим	М7
   42 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
