; HOWSMB - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 6880
; длина при загрузке: 37 слов (58 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=WHO, 2=WHO1, 3=RSYMB
; локальные метки: HOWSMB=0, L0001=1, L0017=17, L0022=22, L0026=26, 
; L0033=33, L0036=36, L0040=40, L0041=41, L0043=43, L0044=44
; HOWSMB: код модуля
         Type: Binary
         Code: 174 (035) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+HOWSMB	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40026 		пб	L0026
    1 07 010 4004 		сч	'4004'(М7)
      07 000 0005 		зп	5(М7)
    2 00 037 0003 		ржа	'3'
      00 23 40044 		мод	L0044
    3 16 24 00000 		уиа	0(М16)
      00 043 0016 		счим	М16
    4 16 24 40040 		уиа	L0040
      00 043 0016 		счим	М16
    5 16 24 40043 		уиа	L0043
      00 043 0016 		счим	М16
    6 16 24 40041 		уиа	L0041
      00 043 0016 		счим	М16
    7 00 037 0022 	L0017	ржа	'22'
      15 31 74003 		пв	RSYMB
   10 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   11 07 010 0001 	L0022	сч	1(М7)
      00 22 74002 		мода	WHO1
   12 00 000 0000 		зп	L0001+HOWSMB
      00 037 0003 		ржа	'3'
   13 07 010 4004 	L0026	сч	'4004'(М7)
      00 043 0000 		счим	
   14 07 010 0005 		сч	5(М7)
      00 037 0022 		ржа	'22'
   15 17 012 0000 	L0033	нтж	(М17)
      00 26 40017 		по	L0017
   16 00 30 40022 		пб	L0022
   17 07 010 0000 	L0036	сч	(М7)
      00 22 74002 		мода	WHO1
   20 00 000 0000 	L0040+L0041	зп	L0001+HOWSMB
      00 037 0003 		ржа	'3'
   21 00 037 0022 	L0043	ржа	'22'
      00 22 00000 		мода	L0001+HOWSMB
   22 07 010 0004 	L0044	сч	4(М7)
      00 037 0003 		ржа	'3'
   23 00 22 74002 		мода	WHO1
      00 005 0000 		вч	L0001+HOWSMB
   24 00 22 74001 		мода	WHO
      00 000 0000 		зп	L0001+HOWSMB
   25 00 037 0022 		ржа	'22'
      00 30 40033 		пб	L0033
   26 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   27 07 24 40036 		уиа	L0036
      07 001 0006 		зпм	6(М7)
   30 00 043 0015 		счим	М15
      00 043 0010 		счим	М10
   31 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   32 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   33 00 041 0000 		уим	
      00 041 0007 		уим	М7
   34 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
