; IBIT - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 5792
; длина при загрузке: 8 слов (12 команд)
; адреса в командах (в слове две команды)
; внешние символы:
; локальные метки:
; IBIT: код модуля
         Type: Binary
         Code: 36 (06) words
      Address: 0

				СТАРТ	'0'
    0 00 041 0014 		ноп
			START	уим	М14
      00 040 0013 		уи	М13
    1 13 010 0000 		сч	(М13)
      14 003 0000 		счм	(М14)
    2 00 041 0014 		уим	М14
      14 036 0077 		сда	64-1(М14)
    3 00 22 40006 		мода	'40006'
      00 011 0000 		и	
    4 00 22 40007 		мода	'40007'
      00 015 0000 		или	
    5 15 30 00000 		пб	(М15)
				ФИНИШ
