; KCOUNT - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 6144
; длина при загрузке: 10 слов (18 команд)
; адреса в командах (в слове две команды)
; внешние символы:
; локальные метки:
; KCOUNT: код модуля
         Type: Binary
         Code: 54 (011) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 00 040 0011 		ноп
			START	уи	М11
      00 037 0003 		ржа	'3'
    1 11 010 0000 		сч	(М11)
      00 22 40011 		мода	'40011'
    2 00 006 0000 		вчоб	
      00 041 0011 		уим	М11
    3 00 040 0013 		уи	М13
      11 25 00001 		слиа	1(М11)
    4 00 010 0000 		сч	
      00 22 00000 		мода	
    5 13 003 0000 		счм	(М13)
      17 022 0000 		чед	(М17)
    6 13 25 00001 		слиа	1(М13)
      11 37 40005 		цикл	'40005'(М11)
    7 00 22 40011 		мода	'40011'
      00 015 0000 		или	
   10 15 30 00000 		пб	(М15)
				ФИНИШ
