; KLAIDA - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 15104
; длина при загрузке: 48 слов (60 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=INS, 2=INS24, 3=INS25, 4=INS26, 5=FT571, 6=FT002, 
; 7=FT003, 8=STOP, 9=INS32767
; локальные метки: KLAIDA=0, L0001=1, L0014=14, L0025=25, L0033=33, 
; L0036=36, L0043=43, L0054=54, L0056=56, L0057=57
; KLAIDA: код модуля
         Type: Binary
         Code: 180 (036) words
      Address: 0

				СТАРТ	'0'
    0 16 24 40001 	L0001+KLAIDA	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40025 		пб	L0025
    1 16 24 40036 		уиа	L0036
      00 043 0016 		счим	М16
    2 15 31 74005 		пв	FT571
    3 00 23 40057 		мод	L0057
      16 24 00000 		уиа	0(М16)
    4 00 043 0016 		счим	М16
      15 31 74006 		пв	FT002
    5 00 23 40057 		мод	L0057
      00 010 0000 		сч	L0001+KLAIDA
    6 00 037 0003 	L0014	ржа	'3'
      00 037 0022 		ржа	'22'
    7 15 31 74007 		пв	FT003
   10 16 24 40043 		уиа	L0043
      00 043 0016 		счим	М16
   11 15 31 74005 		пв	FT571
   12 07 010 0000 	L0025	сч	(М7)
      07 000 0002 		зп	2(М7)
   13 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   14 00 23 40056 		мод	L0056
      01 24 00000 		уиа	0(М1)
   15 01 22 74011 	L0033	мода	INS32767
      16 24 00000 		уиа	0(М16)
   16 00 043 0016 		счим	М16
      15 31 74006 		пв	FT002
   17 07 010 0002 	L0036	сч	2(М7)
      00 037 0003 		ржа	'3'
   20 07 004 0000 		сл	(М7)
      07 000 0002 		зп	2(М7)
   21 07 006 0001 	L0043	вчоб	1(М7)
      00 037 0022 		ржа	'22'
   22 00 26 40014 		по	L0014
      15 31 74007 		пв	FT003
   23 15 31 74010 		пв	STOP
   24 00 30 40033 		пб	L0033
   25 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   26 07 24 40054 	L0054	уиа	L0054
      07 001 0003 		зпм	3(М7)
   27 00 043 0015 	L0056+L0057	счим	М15
      00 043 0001 		счим	М1
   30 00 043 0010 		счим	М10
      00 043 0000 		счим	
   31 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   32 12 30 00000 		пб	(М12)
   33 00 041 0000 		уим	
      00 041 0007 		уим	М7
   34 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   35 10 30 00000 		пб	(М10)
				ФИНИШ
