; KLAIDA - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 15104
; длина при загрузке: 48 слов (60 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*INS*, 2=*INS*+30, 3=*INS*+31, 4=*INS*+32, 5=FT*571, 
; 6=FT*002, 7=FT*003, 8=STOP*, 9=*INS*+77777
; локальные метки: L0000=0, L0001=1, L0010=10, L0012=12, L0036=36, 
; L0043=43, L0054=54
; KLAIDA: код модуля
         Type: Binary
         Code: 180 (036) words
      Address: 0

				СТАРТ	'0'
    0 16 24 40001 	L0000+L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40025 		пб	'40025'
    1 16 24 40036 		уиа	L0036
      00 043 0016 		счим	М16
    2 15 31 74005 		пв	'74005'(М15)
    3 00 23 40057 		мод	'40057'
      16 24 00000 		уиа	0(М16)
    4 00 043 0016 	L0010	счим	М16
      15 31 74006 		пв	'74006'(М15)
    5 00 23 40057 	L0012	мод	'40057'
      00 010 0000 		сч	L0000+L0001
    6 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
    7 15 31 74007 		пв	'74007'(М15)
   10 16 24 40043 		уиа	L0043
      00 043 0016 		счим	М16
   11 15 31 74005 		пв	'74005'(М15)
   12 07 010 0000 		сч	(М7)
      07 000 0002 		зп	2(М7)
   13 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   14 00 23 40056 		мод	'40056'
      01 24 00000 		уиа	0(М1)
   15 01 22 74011 		мода	'74011'(М1)
      16 24 00000 		уиа	0(М16)
   16 00 043 0016 		счим	М16
      15 31 74006 		пв	'74006'(М15)
   17 07 010 0002 	L0036	сч	2(М7)
      00 037 0003 		ржа	'3'
   20 07 004 0000 		сл	(М7)
      07 000 0002 		зп	2(М7)
   21 07 006 0001 	L0043	вчоб	1(М7)
      00 037 0022 		ржа	'22'
   22 00 26 40014 		по	'40014'
      15 31 74007 		пв	'74007'(М15)
   23 15 31 74010 		пв	'74010'(М15)
   24 00 30 40033 		пб	'40033'
   25 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   26 07 24 40054 	L0054	уиа	L0054
      07 001 0003 		зпм	3(М7)
   27 00 043 0015 		счим	М15
      00 043 0001 		счим	М1
   30 00 043 0010 		счим	М10
      00 043 0000 		счим	
   31 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   32 12 30 00000 		пб	(М12)
   33 00 041 0000 		уим	
      00 041 0007 		уим	М7
   34 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   35 10 30 00000 		пб	(М10)
				ФИНИШ
