; KODKOD - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 19776
; длина при загрузке: 44 слов (76 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=NEW, 2=NEWST, 3=SCAKOD, 4=RSYMB, 5=NEWST32767
; локальные метки: KODKOD=0, L0001=1, L0005=5, L0007=7, L0036=36, L0043=43, 
; L0046=46, L0050=50, L0052=52, L0053=53
; KODKOD: код модуля
         Type: Binary
         Code: 228 (046) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+KODKOD	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40036 		пб	L0036
    1 07 010 0000 		сч	(М7)
      00 22 74001 		мода	NEW
    2 00 000 0000 	L0005	зп	L0001+KODKOD
      00 037 0003 		ржа	'3'
    3 07 010 0001 	L0007	сч	1(М7)
      07 000 0004 		зп	4(М7)
    4 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0001+KODKOD
    5 07 010 0001 		сч	1(М7)
      07 000 0005 		зп	5(М7)
    6 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
    7 00 23 40052 		мод	L0052
      01 24 00000 		уиа	0(М1)
   10 01 22 74005 		мода	NEWST32767
      16 24 00000 		уиа	0(М16)
   11 00 043 0016 		счим	М16
      16 24 40053 		уиа	L0053
   12 00 043 0016 		счим	М16
      16 24 74001 		уиа	NEW
   13 00 043 0016 		счим	М16
      16 24 40050 		уиа	L0050
   14 00 043 0016 		счим	М16
      15 31 74004 		пв	RSYMB
   15 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   16 15 31 74003 		пв	SCAKOD
   17 16 24 74001 	L0036	уиа	NEW
      00 043 0016 		счим	М16
   20 16 24 40050 		уиа	L0050
      00 043 0016 		счим	М16
   21 00 23 40052 	L0043	мод	L0052
      01 24 00000 		уиа	0(М1)
   22 01 22 74005 		мода	NEWST32767
      16 24 00000 		уиа	0(М16)
   23 00 043 0016 	L0046	счим	М16
      16 24 40053 		уиа	L0053
   24 00 043 0016 	L0050	счим	М16
      15 31 74004 		пв	RSYMB
   25 00 037 0003 	L0052+L0053	ржа	'3'
      00 037 0022 		ржа	'22'
   26 07 010 0005 		сч	5(М7)
      00 037 0003 		ржа	'3'
   27 07 004 0001 		сл	1(М7)
      07 000 0005 		зп	5(М7)
   30 07 006 0002 		вчоб	2(М7)
      00 037 0022 		ржа	'22'
   31 00 26 40007 		по	L0007
      00 22 00000 		мода	L0001+KODKOD
   32 07 010 0004 		сч	4(М7)
      00 037 0003 		ржа	'3'
   33 07 004 0001 		сл	1(М7)
      07 000 0004 		зп	4(М7)
   34 07 006 0003 		вчоб	3(М7)
      00 037 0022 		ржа	'22'
   35 00 26 40005 		по	L0005
      00 30 40043 		пб	L0043
   36 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   37 07 24 40046 		уиа	L0046
      00 043 0015 		счим	М15
   40 00 043 0001 		счим	М1
      00 043 0010 		счим	М10
   41 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   42 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   43 00 041 0000 		уим	
      00 041 0007 		уим	М7
   44 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   45 10 30 00000 		пб	(М10)
				ФИНИШ
