; KOKSEK - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 18592
; длина при загрузке: 35 слов (62 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*SEK*, 2=*SLY*, 3=*SLY*+1, 4=*LYG*, 5=*LYG*+1, 
; 6=*LYG*+2, 7=*TAB*, 8=*TAB*+1, 9=*TAB*+3, 10=*TAB*+4, 11=*NUST*, 
; 12=*NDAB*, 13=*NDAB*+1, 14=*NDABL*, 15=*NDABL*+1, 16=*SEK*+77777, 
; 17=*SEK*+1
; локальные метки: L0001=1, L0010=10, L0012=12, L0037=37
; KOKSEK: код модуля
         Type: Binary
         Code: 186 (037) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40027 		пб	'40027'
    1 07 010 0001 		сч	1(М7)
      07 000 0003 		зп	3(М7)
    2 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
    3 07 010 0000 		сч	(М7)
      00 23 40042 		мод	'40042'
    4 01 24 00000 	L0010	уиа	0(М1)
      01 22 74020 		мода	'74020'(М1)
    5 00 000 0000 	L0012	зп	L0001
      00 22 00000 		мода	L0001
    6 07 010 0003 		сч	3(М7)
      00 037 0003 		ржа	'3'
    7 07 004 0001 		сл	1(М7)
      07 000 0003 		зп	3(М7)
   10 07 006 0002 		вчоб	2(М7)
      00 037 0022 		ржа	'22'
   11 00 26 40003 		по	'40003'
      07 010 0001 		сч	1(М7)
   12 00 043 0000 		счим	
      00 22 74003 		мода	'74003'
   13 00 010 0000 		сч	L0001
      17 012 0000 		нтж	(М17)
   14 00 26 40015 		по	'40015'
      00 30 40020 		пб	'40020'
   15 07 010 0001 		сч	1(М7)
      00 22 74001 		мода	'74001'
   16 00 000 0000 		зп	L0001
      00 037 0003 		ржа	'3'
   17 00 037 0022 	L0037	ржа	'22'
      00 22 00000 		мода	L0001
   20 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   21 00 22 74007 		мода	'74007'
      00 010 0000 		сч	L0001
   22 17 012 0000 		нтж	(М17)
      00 26 40024 		по	'40024'
   23 00 30 40026 		пб	'40026'
   24 07 010 0001 		сч	1(М7)
      00 22 74021 		мода	'74021'
   25 00 000 0000 		зп	L0001
      00 22 00000 		мода	L0001
   26 00 30 40034 		пб	'40034'
   27 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   30 07 24 40037 		уиа	L0037
      00 043 0015 		счим	М15
   31 00 043 0001 		счим	М1
      00 043 0010 		счим	М10
   32 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   33 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   34 00 041 0000 		уим	
      00 041 0007 		уим	М7
   35 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   36 10 30 00000 		пб	(М10)
				ФИНИШ
