; KOKSEK - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 18592
; длина при загрузке: 35 слов (62 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=SEK, 2=SLY, 3=SLY1, 4=LYG, 5=LYG1, 6=LYG2, 7=TAB, 
; 8=TAB1, 9=TAB3, 10=TAB4, 11=NUST, 12=NDAB, 13=NDAB1, 14=NDABL, 15=NDABL1, 
; 16=SEK32767, 17=SEK1
; локальные метки: KOKSEK=0, L0001=1, L0003=3, L0015=15, L0020=20, 
; L0024=24, L0026=26, L0027=27, L0034=34, L0037=37, L0042=42
; KOKSEK: код модуля
         Type: Binary
         Code: 186 (037) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+KOKSEK	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40027 		пб	L0027
    1 07 010 0001 	L0003	сч	1(М7)
      07 000 0003 		зп	3(М7)
    2 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
    3 07 010 0000 		сч	(М7)
      00 23 40042 		мод	L0042
    4 01 24 00000 		уиа	0(М1)
      01 22 74020 		мода	SEK32767
    5 00 000 0000 		зп	L0001+KOKSEK
      00 22 00000 		мода	L0001+KOKSEK
    6 07 010 0003 	L0015	сч	3(М7)
      00 037 0003 		ржа	'3'
    7 07 004 0001 		сл	1(М7)
      07 000 0003 		зп	3(М7)
   10 07 006 0002 	L0020	вчоб	2(М7)
      00 037 0022 		ржа	'22'
   11 00 26 40003 		по	L0003
      07 010 0001 		сч	1(М7)
   12 00 043 0000 	L0024	счим	
      00 22 74003 		мода	SLY1
   13 00 010 0000 	L0026+L0027	сч	L0001+KOKSEK
      17 012 0000 		нтж	(М17)
   14 00 26 40015 		по	L0015
      00 30 40020 		пб	L0020
   15 07 010 0001 		сч	1(М7)
      00 22 74001 		мода	SEK
   16 00 000 0000 	L0034	зп	L0001+KOKSEK
      00 037 0003 		ржа	'3'
   17 00 037 0022 	L0037	ржа	'22'
      00 22 00000 		мода	L0001+KOKSEK
   20 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   21 00 22 74007 	L0042	мода	TAB
      00 010 0000 		сч	L0001+KOKSEK
   22 17 012 0000 		нтж	(М17)
      00 26 40024 		по	L0024
   23 00 30 40026 		пб	L0026
   24 07 010 0001 		сч	1(М7)
      00 22 74021 		мода	SEK1
   25 00 000 0000 		зп	L0001+KOKSEK
      00 22 00000 		мода	L0001+KOKSEK
   26 00 30 40034 		пб	L0034
   27 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   30 07 24 40037 		уиа	L0037
      00 043 0015 		счим	М15
   31 00 043 0001 		счим	М1
      00 043 0010 		счим	М10
   32 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   33 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   34 00 041 0000 		уим	
      00 041 0007 		уим	М7
   35 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   36 10 30 00000 		пб	(М10)
				ФИНИШ
