; KORNET - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 10592
; длина при загрузке: 41 слов (70 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*INS*, 2=*INS*+30, 3=*INS*+31, 4=*INS*+32, 5=*SCANER*, 
; 6=*SCANER*+1, 7=*SCANER*+2, 8=GETSTR, 9=ZD.Ю C Ж
; локальные метки: L0000=0, L0001=1, L0010=10, L0012=12, L0043=43, 
; L0046=46
; KORNET: код модуля
         Type: Binary
         Code: 210 (043) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0000+L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40033 		пб	'40033'
    1 00 23 40047 		мод	'40047'
      00 010 0000 		сч	L0000+L0001
    2 00 22 74005 		мода	'74005'
      00 000 0000 		зп	L0000+L0001
    3 00 037 0003 		ржа	'3'
      00 23 40047 		мод	'40047'
    4 00 010 0000 	L0010	сч	L0000+L0001
      07 000 0002 		зп	2(М7)
    5 00 037 0022 	L0012	ржа	'22'
      00 30 40017 		пб	'40017'
    6 15 31 74011 		пв	'74011'(М15)
    7 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   10 00 22 74006 		мода	'74006'
      00 010 0000 		сч	L0000+L0001
   11 17 012 0000 		нтж	(М17)
      00 27 40013 		пе	'40013'
   12 00 30 40014 		пб	'40014'
   13 00 30 40027 		пб	'40027'
   14 07 010 0002 		сч	2(М7)
      00 037 0003 		ржа	'3'
   15 07 004 0000 		сл	(М7)
      07 000 0002 		зп	2(М7)
   16 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0000+L0001
   17 00 22 74004 		мода	'74004'
      00 006 0000 		вчоб	L0000+L0001
   20 00 26 40006 		по	'40006'
      16 24 40046 		уиа	L0046
   21 00 043 0016 	L0043	счим	М16
      15 31 74010 		пв	'74010'(М15)
   22 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   23 00 22 74003 	L0046	мода	'74003'
      00 010 0000 		сч	L0000+L0001
   24 00 23 40050 		мод	'40050'
      00 000 0000 		зп	L0000+L0001
   25 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   26 00 30 40041 		пб	'40041'
   27 00 22 74005 		мода	'74005'
      00 010 0000 		сч	L0000+L0001
   30 00 037 0003 		ржа	'3'
      07 005 0000 		вч	(М7)
   31 00 23 40050 		мод	'40050'
      00 000 0000 		зп	L0000+L0001
   32 00 037 0022 		ржа	'22'
      00 30 40041 		пб	'40041'
   33 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   34 07 24 40043 		уиа	L0043
      07 001 0005 		зпм	5(М7)
   35 07 001 0004 		зпм	4(М7)
      00 043 0015 		счим	М15
   36 00 043 0010 		счим	М10
      00 043 0000 		счим	
   37 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   40 12 30 00000 		пб	(М12)
   41 00 041 0000 		уим	
      00 041 0007 		уим	М7
   42 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
