; KORNET - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 10592
; длина при загрузке: 41 слов (70 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=INS, 2=INS24, 3=INS25, 4=INS26, 5=SCANER, 6=SCANER1, 
; 7=SCANER2, 8=GETSTR, 9=ZDЮCЖ
; локальные метки: KORNET=0, L0001=1, L0006=6, L0013=13, L0014=14, 
; L0017=17, L0027=27, L0033=33, L0041=41, L0043=43, L0046=46, L0047=47, 
; L0050=50
; KORNET: код модуля
         Type: Binary
         Code: 210 (043) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+KORNET	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40033 		пб	L0033
    1 00 23 40047 		мод	L0047
      00 010 0000 		сч	L0001+KORNET
    2 00 22 74005 		мода	SCANER
      00 000 0000 		зп	L0001+KORNET
    3 00 037 0003 	L0006	ржа	'3'
      00 23 40047 		мод	L0047
    4 00 010 0000 		сч	L0001+KORNET
      07 000 0002 		зп	2(М7)
    5 00 037 0022 	L0013	ржа	'22'
      00 30 40017 		пб	L0017
    6 15 31 74011 	L0014	пв	ZDЮCЖ
    7 07 010 0001 	L0017	сч	1(М7)
      00 043 0000 		счим	
   10 00 22 74006 		мода	SCANER1
      00 010 0000 		сч	L0001+KORNET
   11 17 012 0000 		нтж	(М17)
      00 27 40013 		пе	L0013
   12 00 30 40014 		пб	L0014
   13 00 30 40027 	L0027	пб	L0027
   14 07 010 0002 		сч	2(М7)
      00 037 0003 		ржа	'3'
   15 07 004 0000 	L0033	сл	(М7)
      07 000 0002 		зп	2(М7)
   16 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0001+KORNET
   17 00 22 74004 		мода	INS26
      00 006 0000 		вчоб	L0001+KORNET
   20 00 26 40006 	L0041	по	L0006
      16 24 40046 		уиа	L0046
   21 00 043 0016 	L0043	счим	М16
      15 31 74010 		пв	GETSTR
   22 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   23 00 22 74003 	L0047+L0046	мода	INS25
      00 010 0000 		сч	L0001+KORNET
   24 00 23 40050 	L0050	мод	L0050
      00 000 0000 		зп	L0001+KORNET
   25 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   26 00 30 40041 		пб	L0041
   27 00 22 74005 		мода	SCANER
      00 010 0000 		сч	L0001+KORNET
   30 00 037 0003 		ржа	'3'
      07 005 0000 		вч	(М7)
   31 00 23 40050 		мод	L0050
      00 000 0000 		зп	L0001+KORNET
   32 00 037 0022 		ржа	'22'
      00 30 40041 		пб	L0041
   33 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   34 07 24 40043 		уиа	L0043
      07 001 0005 		зпм	5(М7)
   35 07 001 0004 		зпм	4(М7)
      00 043 0015 		счим	М15
   36 00 043 0010 		счим	М10
      00 043 0000 		счим	
   37 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   40 12 30 00000 		пб	(М12)
   41 00 041 0000 		уим	
      00 041 0007 		уим	М7
   42 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
