; LYGPAR - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 20960
; длина при загрузке: 39 слов (76 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=LYG, 2=LYG1, 3=LYG2, 4=NDAB, 5=NDAB1, 6=NDAB2, 7=SEK, 
; 8=REGIM, 9=SEK3, 10=LYG3, 11=SEK2, 12=LYG5, 13=LYG4
; локальные метки: LYGPAR=0, L0001=1, L0005=5, L0006=6, L0012=12, L0013=13, 
; L0017=17, L0020=20, L0025=25, L0026=26, L0032=32, L0037=37, L0044=44, 
; L0046=46
; LYGPAR: код модуля
         Type: Binary
         Code: 228 (046) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+LYGPAR	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40037 		пб	L0037
    1 00 22 74011 		мода	SEK3
      00 010 0000 		сч	L0001+LYGPAR
    2 00 037 0003 	L0005	ржа	'3'
      00 22 74012 		мода	LYG3
    3 00 005 0000 	L0006	вч	L0001+LYGPAR
      00 037 0022 		ржа	'22'
    4 00 27 40005 		пе	L0005
      00 30 40006 		пб	L0006
    5 00 30 40032 	L0012+L0013	пб	L0032
    6 00 22 74012 		мода	LYG3
      00 010 0000 		сч	L0001+LYGPAR
    7 00 043 0000 	L0017	счим	
      00 22 74011 		мода	SEK3
   10 00 010 0000 	L0020	сч	L0001+LYGPAR
      17 012 0000 		нтж	(М17)
   11 00 27 40012 		пе	L0012
      00 30 40013 		пб	L0013
   12 00 30 40026 	L0025	пб	L0026
   13 07 010 0000 	L0026	сч	(М7)
      00 043 0000 		счим	
   14 00 22 74010 		мода	REGIM
      00 010 0000 		сч	L0001+LYGPAR
   15 17 012 0000 	L0032	нтж	(М17)
      00 27 40017 		пе	L0017
   16 00 30 40020 		пб	L0020
   17 00 30 40032 	L0037	пб	L0032
   20 00 22 74013 		мода	SEK2
      00 010 0000 		сч	L0001+LYGPAR
   21 00 037 0003 		ржа	'3'
      00 006 0000 		вчоб	L0001+LYGPAR
   22 00 22 74014 	L0044	мода	LYG5
      00 004 0000 		сл	L0001+LYGPAR
   23 00 037 0022 	L0046	ржа	'22'
      00 26 40025 		по	L0025
   24 00 30 40026 		пб	L0026
   25 00 30 40032 		пб	L0032
   26 00 22 74011 		мода	SEK3
      00 010 0000 		сч	L0001+LYGPAR
   27 00 22 74012 		мода	LYG3
      00 000 0000 		зп	L0001+LYGPAR
   30 00 22 74013 		мода	SEK2
      00 010 0000 		сч	L0001+LYGPAR
   31 00 22 74014 		мода	LYG5
      00 000 0000 		зп	L0001+LYGPAR
   32 00 22 74015 		мода	LYG4
      00 010 0000 		сч	L0001+LYGPAR
   33 00 22 74013 		мода	SEK2
      00 000 0000 		зп	L0001+LYGPAR
   34 00 22 74003 		мода	LYG2
      00 010 0000 		сч	L0001+LYGPAR
   35 00 22 74011 		мода	SEK3
      00 000 0000 		зп	L0001+LYGPAR
   36 00 30 40044 		пб	L0044
   37 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   40 07 24 40046 		уиа	L0046
      00 043 0015 		счим	М15
   41 00 043 0010 		счим	М10
      00 043 0000 		счим	
   42 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   43 12 30 00000 		пб	(М12)
   44 00 041 0000 		уим	
      00 041 0007 		уим	М7
   45 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
