; MASVAL - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 10656
; длина при загрузке: 27 слов (44 команд)
; адреса в командах (в слове две команды)
; внешние символы:
; локальные метки: MASVAL=0, L0001=1, L0004=4, L0012=12, L0014=14, 
; L0023=23, L0026=26, L0027=27, L0030=30, L0031=31, L0032=32
; MASVAL: код модуля
         Type: Binary
         Code: 132 (026) words
      Address: 0

				СТАРТ	'0'
    0 16 24 40001 	L0001+MASVAL	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40014 		пб	L0014
    1 07 010 0000 		сч	(М7)
      07 000 0001 		зп	1(М7)
    2 00 037 0003 	L0004	ржа	'3'
      00 037 0022 		ржа	'22'
    3 00 30 40012 		пб	L0012
    4 00 23 40032 		мод	L0032
      00 010 0000 		сч	L0001+MASVAL
    5 00 23 40027 	L0012	мод	L0027
      01 24 00000 		уиа	0(М1)
    6 00 23 40030 	L0014	мод	L0030
      01 000 4001 		зп	'4001'(М1)
    7 07 010 0001 		сч	1(М7)
      00 037 0003 		ржа	'3'
   10 07 004 0000 		сл	(М7)
      07 000 0001 		зп	1(М7)
   11 00 037 0022 	L0023	ржа	'22'
      00 22 00000 		мода	L0001+MASVAL
   12 00 23 40031 		мод	L0031
      00 006 0000 		вчоб	L0001+MASVAL
   13 00 26 40004 	L0026+L0027	по	L0004
      00 30 40023 		пб	L0023
   14 07 044 0010 	L0030+L0031	уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   15 07 24 40026 	L0032	уиа	L0026
      07 001 0004 		зпм	4(М7)
   16 07 001 0003 		зпм	3(М7)
      07 001 0002 		зпм	2(М7)
   17 00 043 0015 		счим	М15
      00 043 0001 		счим	М1
   20 00 043 0010 		счим	М10
      00 043 0000 		счим	
   21 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   22 12 30 00000 		пб	(М12)
   23 00 041 0000 		уим	
      00 041 0007 		уим	М7
   24 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   25 10 30 00000 		пб	(М10)
				ФИНИШ
