; NEWSTR - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 14784
; длина при загрузке: 27 слов (50 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=STR, 2=STR24, 3=STR25, 4=STR26, 5=NDAB, 6=NDAB1, 
; 7=NDAB2, 8=BEGSTR, 9=ENDSTR
; локальные метки: NEWSTR=0, L0001=1, L0005=5, L0006=6, L0015=15, L0016=16, 
; L0022=22, L0027=27, L0031=31
; NEWSTR: код модуля
         Type: Binary
         Code: 150 (031) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	NEWSTR	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40022 		пб	L0022
    1 00 22 74003 	L0001	мода	STR25
      00 010 0000 		сч	NEWSTR
    2 00 043 0000 		счим	
      00 22 74002 		мода	STR24
    3 00 010 0000 		сч	NEWSTR
      17 012 0000 		нтж	(М17)
    4 00 26 40005 		по	L0005
      00 30 40006 		пб	L0006
    5 00 30 40016 	L0005	пб	L0016
    6 00 22 74006 	L0006	мода	NDAB1
      00 010 0000 		сч	NEWSTR
    7 07 000 0001 		зп	1(М7)
      00 037 0003 		ржа	'3'
   10 00 037 0022 		ржа	'22'
      15 31 74011 		пв	ENDSTR
   11 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   12 00 22 74006 		мода	NDAB1
      00 010 0000 		сч	NEWSTR
   13 17 012 0000 		нтж	(М17)
      00 26 40015 		по	L0015
   14 00 30 40016 		пб	L0016
   15 15 31 74010 	L0015	пв	BEGSTR
   16 00 22 74003 	L0016	мода	STR25
      00 010 0000 		сч	NEWSTR
   17 00 037 0003 		ржа	'3'
      07 004 0000 		сл	(М7)
   20 00 22 74002 		мода	STR24
      00 000 0000 		зп	NEWSTR
   21 00 037 0022 		ржа	'22'
      00 30 40027 		пб	L0027
   22 07 044 0010 	L0022	уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   23 07 24 40031 		уиа	L0031
      00 043 0015 		счим	М15
   24 00 043 0010 		счим	М10
      00 043 0000 		счим	
   25 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   26 12 30 00000 		пб	(М12)
   27 00 041 0000 	L0027	уим	
      00 041 0007 		уим	М7
   30 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
