; NEWSTR - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 14784
; длина при загрузке: 27 слов (50 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*STR*, 2=*STR*+30, 3=*STR*+31, 4=*STR*+32, 5=*NDAB*, 
; 6=*NDAB*+1, 7=*NDAB*+2, 8=BEGSTR, 9=ENDSTR
; локальные метки: L0000=0, L0001=1, L0010=10, L0012=12, L0031=31
; NEWSTR: код модуля
         Type: Binary
         Code: 150 (031) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0000+L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40022 		пб	'40022'
    1 00 22 74003 		мода	'74003'
      00 010 0000 		сч	L0000+L0001
    2 00 043 0000 		счим	
      00 22 74002 		мода	'74002'
    3 00 010 0000 		сч	L0000+L0001
      17 012 0000 		нтж	(М17)
    4 00 26 40005 	L0010	по	'40005'
      00 30 40006 		пб	'40006'
    5 00 30 40016 	L0012	пб	'40016'
    6 00 22 74006 		мода	'74006'
      00 010 0000 		сч	L0000+L0001
    7 07 000 0001 		зп	1(М7)
      00 037 0003 		ржа	'3'
   10 00 037 0022 		ржа	'22'
      15 31 74011 		пв	'74011'(М15)
   11 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   12 00 22 74006 		мода	'74006'
      00 010 0000 		сч	L0000+L0001
   13 17 012 0000 		нтж	(М17)
      00 26 40015 		по	'40015'
   14 00 30 40016 	L0031	пб	'40016'
   15 15 31 74010 		пв	'74010'(М15)
   16 00 22 74003 		мода	'74003'
      00 010 0000 		сч	L0000+L0001
   17 00 037 0003 		ржа	'3'
      07 004 0000 		сл	(М7)
   20 00 22 74002 		мода	'74002'
      00 000 0000 		зп	L0000+L0001
   21 00 037 0022 		ржа	'22'
      00 30 40027 		пб	'40027'
   22 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   23 07 24 40031 		уиа	L0031
      00 043 0015 		счим	М15
   24 00 043 0010 		счим	М10
      00 043 0000 		счим	
   25 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   26 12 30 00000 		пб	(М12)
   27 00 041 0000 		уим	
      00 041 0007 		уим	М7
   30 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
