; NOTA - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 5920
; длина при загрузке: 12 слов (20 команд)
; адреса в командах (в слове две команды)
; внешние символы:
; локальные метки: NOTA=0, L0005=5, L0012=12, L0013=13
; NOTA: код модуля
         Type: Binary
         Code: 60 (012) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 00 040 0011 	NOTA	ноп
				ноп
			START	уи	М11
      00 037 0003 		ржа	'3'
    1 11 010 0000 		сч	(М11)
      00 22 40012 		мода	L0012
    2 00 006 0000 		вчоб	NOTA
      00 041 0011 		уим	М11
    3 00 041 0012 		уим	М12
      00 040 0013 		уи	М13
    4 11 25 00001 		слиа	1(М11)
      00 22 00000 		мода	NOTA
    5 13 010 0000 	L0005	сч	(М13)
      00 22 40013 		мода	L0013
    6 00 012 0000 		нтж	NOTA
      13 25 00001 		слиа	1(М13)
    7 12 000 0000 		зп	(М12)
      12 25 00001 		слиа	1(М12)
   10 11 37 40005 		цикл	L0005
      00 001 0000 		зпм	NOTA
   11 00 037 0006 		ржа	'6'
      15 30 00000 		пб	(М15)
				ФИНИШ
