; PAPAPR - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 9504
; длина при загрузке: 34 слов (54 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*COMCON*, 2=*COMCON*+24, 3=*EGO*, 4=*EGO*+16040, 
; 5=*EGO*+20630, 6=*EGO*+20631, 7=*INS*, 8=*INS*+30, 9=*INS*+31, 
; 10=*INS*+32, 11=*NUST*, 12=*RUSIS*, 13=PAPRAP, 14=RMAKR, 15=I*MU*I, 
; 20=*COMCON*+23
; локальные метки: L0000=0, L0001=1, L0010=10, L0012=12, L0034=34, 
; L0035=35, L0036=36, L0040=40, L0054=54, L0055=55
; PAPAPR: код модуля
         Type: Binary
         Code: 162 (033) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0000+L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40023 		пб	'40023'
    1 00 22 74005 		мода	'74005'
      00 010 0000 		сч	L0000+L0001
    2 16 24 74002 		уиа	*COMCON*+24
      15 31 74017 		пв	'74017'(М15)
    3 00 037 0003 		ржа	'3'
      07 004 0000 		сл	(М7)
    4 07 000 0004 	L0010	зп	4(М7)
      07 000 0005 		зп	5(М7)
    5 00 037 0022 	L0012	ржа	'22'
      00 30 40014 		пб	'40014'
    6 07 010 4020 		сч	'4020'(М7)
      00 23 40041 		мод	'40041'
    7 01 24 00000 		уиа	0(М1)
      01 22 74021 		мода	'74021'(М1)
   10 00 000 0000 		зп	L0000+L0001
      00 22 00000 		мода	L0000+L0001
   11 07 010 0005 		сч	5(М7)
      00 037 0003 		ржа	'3'
   12 07 004 0000 		сл	(М7)
      07 000 0005 		зп	5(М7)
   13 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0000+L0001
   14 07 006 0003 		вчоб	3(М7)
      00 26 40006 		по	'40006'
   15 16 24 40035 		уиа	L0035
      00 043 0016 		счим	М16
   16 15 31 74016 	L0034+L0035	пв	'74016'(М15)
   17 16 24 40036 	L0036	уиа	L0036
      00 043 0016 		счим	М16
   20 15 31 74016 	L0040	пв	'74016'(М15)
   21 15 31 74015 		пв	'74015'(М15)
   22 00 30 40030 		пб	'40030'
   23 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   24 07 24 40034 		уиа	L0034
      00 043 0015 		счим	М15
   25 00 043 0001 		счим	М1
      00 043 0010 		счим	М10
   26 00 043 0000 	L0054+L0055	счим	
      00 037 0003 		ржа	'3'
   27 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   30 00 041 0000 		уим	
      00 041 0007 		уим	М7
   31 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   32 10 30 00000 		пб	(М10)
				ФИНИШ
