; PAPAPR - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 9504
; длина при загрузке: 34 слов (54 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=COMCON, 2=COMCON20, 3=EGO, 4=EGO7200, 5=EGO8600, 
; 6=EGO8601, 7=INS, 8=INS24, 9=INS25, 10=INS26, 11=NUST, 12=RUSIS, 
; 13=PAPRAP, 14=RMAKR, 15=IMUI, 17=EGO39967, 20=COMCON19
; локальные метки: PAPAPR=0, L0001=1, L0006=6, L0014=14, L0023=23, 
; L0030=30, L0034=34, L0035=35, L0036=36, L0040=40, L0041=41, L0054=54, 
; L0055=55
; PAPAPR: код модуля
         Type: Binary
         Code: 162 (033) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+PAPAPR	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40023 		пб	L0023
    1 00 22 74005 		мода	EGO8600
      00 010 0000 		сч	L0001+PAPAPR
    2 16 24 74002 		уиа	COMCON20
      15 31 74017 		пв	IMUI
    3 00 037 0003 	L0006	ржа	'3'
      07 004 0000 		сл	(М7)
    4 07 000 0004 		зп	4(М7)
      07 000 0005 		зп	5(М7)
    5 00 037 0022 		ржа	'22'
      00 30 40014 		пб	L0014
    6 07 010 4020 	L0014	сч	'4020'(М7)
      00 23 40041 		мод	L0041
    7 01 24 00000 		уиа	0(М1)
      01 22 74021 		мода	EGO39967
   10 00 000 0000 		зп	L0001+PAPAPR
      00 22 00000 		мода	L0001+PAPAPR
   11 07 010 0005 	L0023	сч	5(М7)
      00 037 0003 		ржа	'3'
   12 07 004 0000 		сл	(М7)
      07 000 0005 		зп	5(М7)
   13 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0001+PAPAPR
   14 07 006 0003 	L0030	вчоб	3(М7)
      00 26 40006 		по	L0006
   15 16 24 40035 		уиа	L0035
      00 043 0016 		счим	М16
   16 15 31 74016 	L0034+L0035	пв	RMAKR
   17 16 24 40036 	L0036	уиа	L0036
      00 043 0016 		счим	М16
   20 15 31 74016 	L0040+L0041	пв	RMAKR
   21 15 31 74015 		пв	PAPRAP
   22 00 30 40030 		пб	L0030
   23 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   24 07 24 40034 		уиа	L0034
      00 043 0015 		счим	М15
   25 00 043 0001 		счим	М1
      00 043 0010 		счим	М10
   26 00 043 0000 	L0054+L0055	счим	
      00 037 0003 		ржа	'3'
   27 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   30 00 041 0000 		уим	
      00 041 0007 		уим	М7
   31 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   32 10 30 00000 		пб	(М10)
				ФИНИШ
