; PILDYK - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 18784
; длина при загрузке: 32 слов (50 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=RSYMB
; локальные метки: PILDYK=0, L0001=1, L0004=4, L0016=16, L0020=20, 
; L0027=27, L0031=31, L0032=32, L0033=33, L0034=34, L0035=35, L0036=36, 
; L0037=37
; PILDYK: код модуля
         Type: Binary
         Code: 150 (031) words
      Address: 0

				СТАРТ	'0'
    0 16 24 40001 	L0001+PILDYK	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40020 		пб	L0020
    1 00 23 40034 		мод	L0034
      00 010 0000 		сч	L0001+PILDYK
    2 07 000 0001 	L0004	зп	1(М7)
      00 037 0003 		ржа	'3'
    3 00 037 0022 		ржа	'22'
      00 30 40016 		пб	L0016
    4 00 23 40037 		мод	L0037
      16 24 00000 		уиа	0(М16)
    5 00 043 0016 		счим	М16
      16 24 40031 		уиа	L0031
    6 00 043 0016 		счим	М16
      00 23 40033 		мод	L0033
    7 16 24 00000 	L0016	уиа	0(М16)
      00 043 0016 		счим	М16
   10 16 24 40032 	L0020	уиа	L0032
      00 043 0016 		счим	М16
   11 15 31 74001 		пв	RSYMB
   12 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   13 07 010 0001 	L0027	сч	1(М7)
      00 037 0003 		ржа	'3'
   14 00 23 40036 	L0031	мод	L0036
      00 004 0000 		сл	L0001+PILDYK
   15 07 000 0001 	L0032+L0033	зп	1(М7)
      00 037 0022 		ржа	'22'
   16 00 23 40035 	L0034+L0035	мод	L0035
      00 006 0000 		вчоб	L0001+PILDYK
   17 00 26 40004 	L0036+L0037	по	L0004
      00 30 40027 		пб	L0027
   20 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   21 07 24 40031 		уиа	L0031
      07 001 0006 		зпм	6(М7)
   22 07 001 0005 		зпм	5(М7)
      07 001 0004 		зпм	4(М7)
   23 07 001 0003 		зпм	3(М7)
      07 001 0002 		зпм	2(М7)
   24 00 043 0015 		счим	М15
      00 043 0010 		счим	М10
   25 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   26 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   27 00 041 0000 		уим	
      00 041 0007 		уим	М7
   30 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
