; REDTXT - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 16096
; длина при загрузке: 32 слов (52 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*FIN*, 2=*REGIM*, 3=*NUST*, 4=*RUSIS*, 5=SPAUD
; локальные метки: L0001=1, L0010=10, L0012=12, L0032=32, L0036=36, 
; L0037=37
; REDTXT: код модуля
         Type: Binary
         Code: 156 (032) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40023 		пб	'40023'
    1 07 010 0000 		сч	(М7)
      00 22 74004 		мода	'74004'
    2 00 000 0000 		зп	L0001
      00 037 0003 		ржа	'3'
    3 07 010 0001 		сч	1(М7)
      07 000 0003 		зп	3(М7)
    4 00 037 0022 	L0010	ржа	'22'
      00 22 00000 		мода	L0001
    5 16 24 40036 	L0012	уиа	L0036
      00 043 0016 		счим	М16
    6 16 24 40037 		уиа	L0037
      00 043 0016 		счим	М16
    7 15 31 74005 		пв	'74005'(М15)
   10 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   11 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   12 00 22 74001 		мода	'74001'
      00 010 0000 		сч	L0001
   13 17 012 0000 		нтж	(М17)
      00 26 40015 		по	'40015'
   14 00 30 40016 		пб	'40016'
   15 00 30 40022 	L0032	пб	'40022'
   16 07 010 0003 		сч	3(М7)
      00 037 0003 		ржа	'3'
   17 07 004 0001 	L0036+L0037	сл	1(М7)
      07 000 0003 		зп	3(М7)
   20 07 006 0002 		вчоб	2(М7)
      00 037 0022 		ржа	'22'
   21 00 26 40005 		по	'40005'
      00 22 00000 		мода	L0001
   22 00 30 40030 		пб	'40030'
   23 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   24 07 24 40032 		уиа	L0032
      00 043 0015 		счим	М15
   25 00 043 0010 		счим	М10
      00 043 0000 		счим	
   26 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   27 12 30 00000 		пб	(М12)
   30 00 041 0000 		уим	
      00 041 0007 		уим	М7
   31 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
