; RSYMB - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 5280
; длина при загрузке: 38 слов (76 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=KONSTA, 2=SYTOBIN, 3=SYTOBIN+1, 4=SYTOBIN+2, 
; 5=SYTOBIN+3, 6=SYTOBIN+4, 7=SYTOBIN+5
; локальные метки: L0043=43
; RSYMB: код модуля
         Type: Binary
         Code: 228 (046) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0:00 043 0007 		ноп
			START	счим	М7
      00 043 0015 		счим	М15
    1 15 31 74001 		пв	'74001'(М15)
    2 12 001 0011 		зпм	9(М12)
      12 001 0014 		зпм	12(М12)
    3 00 041 0013 		уим	М13
      00 040 0016 		уи	М16
    4 13 010 0000 		сч	(М13)
      15 31 74007 		пв	'74007'(М15)
    5 07 045 0016 		сли	М16(М7)
      00 042 0007 		счи	М7
    6 11 25 74010 		слиа	'74010'(М11)
      10 011 0004 		и	4(М10)
    7 00 26 40011 		по	'40011'
      17 25 74011 		слиа	СИМ11
   10 00 30 40021 		пб	'40021'
   11 11 044 0013 		уии	М13(М11)
      17 010 0000 		сч	(М17)
   12 00 041 0011 		уим	М11
      00 040 0014 		уи	М14
   13 11 010 0000 		сч	(М11)
      15 31 74007 		пв	'74007'(М15)
   14 00 042 0011 		счи	М11
      07 045 0014 		сли	М14(М7)
   15 00 006 0000 		вчоб	
      00 040 0011 		уи	М11
   16 00 042 0007 		счи	М7
      10 011 0004 		и	4(М10)
   17 00 27 40021 		пе	'40021'
      15 31 74003 		пв	'74003'(М15)
   20 15 31 74004 		пв	'74004'(М15)
   21 12 010 0014 	L0043	сч	12(М12)
      00 041 0007 		уим	М7
   22 00 037 0006 		ржа	'6'
      12 23 00011 		мод	9(М12)
   23 00 30 00000 		пб	
   24 00 043 0015 		счим	М15
      15 31 74001 		пв	'74001'(М15)
   25 00 041 0015 		уим	М15
      00 037 0003 		ржа	'3'
   26 00 040 0011 		уи	М11
      11 010 0000 		сч	(М11)
   27 10 006 0003 		вчоб	3(М10)
      00 26 40041 		по	'40041'
   30 00 043 0006 		счим	М6
      00 043 0015 		счим	М15
   31 12 001 0012 		зпм	10(М12)
      12 001 0015 		зпм	13(М12)
   32 00 041 0006 		уим	М6
      06 25 00001 		слиа	1(М6)
   33 15 31 40000 		пв	'40000'(М15)
   34 17 25 00001 		слиа	1(М17)
      00 22 00000 		мода	
   35 06 34 40043 		пио	L0043
      15 31 74003 		пв	'74003'(М15)
   36 06 25 00001 		слиа	1(М6)
      15 31 74004 		пв	'74004'(М15)
   37 00 30 40035 		пб	'40035'
   40 15 30 00000 		пб	(М15)
   41 17 25 74012 		слиа	СИМ12
      17 010 0000 		сч	(М17)
   42 15 30 00000 		пб	(М15)
   43 12 003 0015 		счм	13(М12)
      12 003 0012 		счм	10(М12)
   44 00 041 0015 		уим	М15
      00 041 0006 		уим	М6
   45 17 010 0000 		сч	(М17)
      15 30 00000 		пб	(М15)
				ФИНИШ
