; RWBIT - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 6016
; длина при загрузке: 15 слов (24 команд)
; адреса в командах (в слове две команды)
; внешние символы:
; локальные метки:
; RWBIT: код модуля
         Type: Binary
         Code: 72 (014) words
      Address: 0

				СТАРТ	'0'
    0 00 041 0013 		ноп
			START	уим	М13
      10 24 40014 		уиа	'40014'(М10)
    1 00 041 0014 		уим	М14
      00 041 0012 		уим	М12
    2 00 040 0011 		уи	М11
      11 010 0000 		сч	(М11)
    3 12 003 0000 		счм	(М12)
      00 041 0012 		уим	М12
    4 00 037 0003 		ржа	'3'
      12 036 0077 		сда	64-1(М12)
    5 10 011 0001 		и	1(М10)
      13 003 0000 		счм	(М13)
    6 10 006 0000 		вчоб	(М10)
      00 041 0013 		уим	М13
    7 13 036 0100 		сда	64(М13)
      10 003 0001 		счм	1(М10)
   10 13 036 0100 		сда	64(М13)
      10 012 0002 		нтж	2(М10)
   11 14 003 0000 		счм	(М14)
      17 011 0000 		и	(М17)
   12 17 015 0000 		или	(М17)
      14 001 0000 		зпм	(М14)
   13 00 037 0006 		ржа	'6'
      15 30 00000 		пб	(М15)
				ФИНИШ
