; RWINF - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 17440
; длина при загрузке: 42 слов (74 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=INF, 2=INF1, 3=INF2, 4=RWBIT, 5=REGIM
; локальные метки: RWINF=0, L0001=1, L0005=5, L0006=6, L0016=16, L0017=17, 
; L0032=32, L0035=35, L0036=36, L0043=43, L0045=45, L0051=51
; RWINF: код модуля
         Type: Binary
         Code: 222 (045) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	RWINF	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40036 		пб	L0036
    1 00 22 74002 	L0001	мода	INF1
      00 010 0000 		сч	RWINF
    2 00 037 0003 		ржа	'3'
      00 006 0000 		вчоб	RWINF
    3 07 004 0000 		сл	(М7)
      00 037 0022 		ржа	'22'
    4 00 26 40005 		по	L0005
      00 30 40006 		пб	L0006
    5 00 30 40035 	L0005	пб	L0035
    6 16 24 74001 	L0006	уиа	INF
      00 042 0016 		счи	М16
    7 16 24 74002 		уиа	INF1
      00 043 0016 		счим	М16
   10 15 31 74005 		пв	REGIM
   11 07 000 0003 		зп	3(М7)
      00 037 0003 		ржа	'3'
   12 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   13 07 010 0003 		сч	3(М7)
      00 037 0022 		ржа	'22'
   14 17 012 0000 		нтж	(М17)
      00 26 40016 		по	L0016
   15 00 30 40017 		пб	L0017
   16 00 30 40032 	L0016	пб	L0032
   17 07 010 0001 	L0017	сч	1(М7)
      07 000 0004 		зп	4(М7)
   20 00 037 0003 		ржа	'3'
      16 24 40051 		уиа	L0051
   21 00 043 0016 		счим	М16
      16 24 40051 		уиа	L0051
   22 00 043 0016 		счим	М16
      16 24 74001 		уиа	INF
   23 00 043 0016 		счим	М16
      16 24 74002 		уиа	INF1
   24 00 043 0016 		счим	М16
      00 037 0022 		ржа	'22'
   25 15 31 74004 		пв	RWBIT
   26 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   27 07 010 0000 		сч	(М7)
      00 22 74003 		мода	INF2
   30 00 000 0000 		зп	RWINF
      00 037 0003 		ржа	'3'
   31 00 037 0022 		ржа	'22'
      00 30 40035 		пб	L0035
   32 07 010 0001 	L0032	сч	1(М7)
      00 22 74003 		мода	INF2
   33 00 000 0000 		зп	RWINF
      00 037 0003 		ржа	'3'
   34 00 037 0022 		ржа	'22'
      00 22 00000 		мода	RWINF
   35 00 30 40043 	L0035	пб	L0043
   36 07 044 0010 	L0036	уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   37 07 24 40045 		уиа	L0045
      00 043 0015 		счим	М15
   40 00 043 0010 		счим	М10
      00 043 0000 		счим	
   41 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   42 12 30 00000 		пб	(М12)
   43 00 041 0000 	L0043	уим	
      00 041 0007 		уим	М7
   44 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
