; RWINF - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 17440
; длина при загрузке: 42 слов (74 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*INF*, 2=*INF*+1, 3=*INF*+2, 4=RWBIT, 5=*REGIM*
; локальные метки: L0000=0, L0001=1, L0010=10, L0012=12, L0045=45, 
; L0051=51
; RWINF: код модуля
         Type: Binary
         Code: 222 (045) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0000+L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40036 		пб	'40036'
    1 00 22 74002 		мода	'74002'
      00 010 0000 		сч	L0000+L0001
    2 00 037 0003 		ржа	'3'
      00 006 0000 		вчоб	L0000+L0001
    3 07 004 0000 		сл	(М7)
      00 037 0022 		ржа	'22'
    4 00 26 40005 	L0010	по	'40005'
      00 30 40006 		пб	'40006'
    5 00 30 40035 	L0012	пб	'40035'
    6 16 24 74001 		уиа	*INF*
      00 042 0016 		счи	М16
    7 16 24 74002 		уиа	*INF*+1
      00 043 0016 		счим	М16
   10 15 31 74005 		пв	'74005'(М15)
   11 07 000 0003 		зп	3(М7)
      00 037 0003 		ржа	'3'
   12 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   13 07 010 0003 		сч	3(М7)
      00 037 0022 		ржа	'22'
   14 17 012 0000 		нтж	(М17)
      00 26 40016 		по	'40016'
   15 00 30 40017 		пб	'40017'
   16 00 30 40032 		пб	'40032'
   17 07 010 0001 		сч	1(М7)
      07 000 0004 		зп	4(М7)
   20 00 037 0003 		ржа	'3'
      16 24 40051 		уиа	L0051
   21 00 043 0016 		счим	М16
      16 24 40051 		уиа	L0051
   22 00 043 0016 	L0045	счим	М16
      16 24 74001 		уиа	*INF*
   23 00 043 0016 		счим	М16
      16 24 74002 		уиа	*INF*+1
   24 00 043 0016 	L0051	счим	М16
      00 037 0022 		ржа	'22'
   25 15 31 74004 		пв	'74004'(М15)
   26 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   27 07 010 0000 		сч	(М7)
      00 22 74003 		мода	'74003'
   30 00 000 0000 		зп	L0000+L0001
      00 037 0003 		ржа	'3'
   31 00 037 0022 		ржа	'22'
      00 30 40035 		пб	'40035'
   32 07 010 0001 		сч	1(М7)
      00 22 74003 		мода	'74003'
   33 00 000 0000 		зп	L0000+L0001
      00 037 0003 		ржа	'3'
   34 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0000+L0001
   35 00 30 40043 		пб	'40043'
   36 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   37 07 24 40045 		уиа	L0045
      00 043 0015 		счим	М15
   40 00 043 0010 		счим	М10
      00 043 0000 		счим	
   41 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   42 12 30 00000 		пб	(М12)
   43 00 041 0000 		уим	
      00 041 0007 		уим	М7
   44 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
