; SKZONA - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 5120
; длина при загрузке: 27 слов (52 команд)
; адреса в командах (в слове две команды)
; внешние символы:
; локальные метки: L0014=14, L0017=17, L0023=23, L0030=30
; SKZONA: код модуля
         Type: Binary
         Code: 156 (032) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 00 041 0011 		ноп
			START	уим	М11
      00 041 0013 		уим	М13
    1 00 22 40032 		мода	'40032'
      00 001 0000 		зпм	
    2 12 24 00000 		уиа	0(М12)
      00 22 00000 		мода	
    3 13 010 0000 		сч	(М13)
      00 040 0013 		уи	М13
    4 00 042 0013 		счи	М13
      12 22 40030 		мода	L0030
    5 00 012 0000 		нтж	
      00 22 40027 		мода	'40027'
    6 00 000 0000 	L0014	зп	
      11 010 0000 		сч	(М11)
    7 00 036 0064 	L0017	сда	64-12
      00 22 40027 		мода	'40027'
   10 00 012 0000 		нтж	
      00 22 40027 		мода	'40027'
   11 00 075 0000 	L0023	Э75	
   12 00 22 40027 		мода	'40027'
      00 070 0000 		Э70	
   13 12 35 40017 		пино	L0017
      13 24 74003 		уиа	СИМ3
   14 00 22 74001 	L0030	мода	'74001'
      13 010 1777 		сч	'1777'(М13)
   15 00 23 40032 		мод	'40032'
      13 000 1777 		зп	'1777'(М13)
   16 13 37 40014 		цикл	L0014
      00 22 00000 		мода	
   17 15 30 00000 		пб	(М15)
   20 00 041 0011 		уим	М11
      00 041 0013 		уим	М13
   21 00 22 40032 		мода	'40032'
      00 001 0000 		зпм	
   22 12 24 74003 		уиа	СИМ3
      00 22 00000 		мода	
   23 00 23 40032 		мод	'40032'
      12 010 1777 		сч	'1777'(М12)
   24 00 22 74001 		мода	'74001'
      12 000 1777 		зп	'1777'(М12)
   25 12 37 40023 		цикл	L0023
      12 24 00001 		уиа	1(М12)
   26 00 30 40003 		пб	'40003'
   27 00 010 4004 		сч	'4004'
      00 041 0000 		уим	
   30 00 010 4004 		сч	'4004'
      00 000 0000 		зп	
   31 00 000 4004 		зп	'4004'
      00 000 0000 		зп	
				ФИНИШ
