; SKZONA - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 5120
; длина при загрузке: 27 слов (52 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=SKZONA1024, 2=SKZONA1040, 3=A31745, 4=SKZONA2, 
; 5=A4096
; локальные метки: SKZONA=0, L0003=3, L0014=14, L0017=17, L0023=23, 
; L0027=27, L0030=30, L0032=32
; SKZONA: код модуля
         Type: Binary
         Code: 156 (032) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 00 041 0011 	SKZONA	ноп
				ноп
			START	уим	М11
      00 041 0013 		уим	М13
    1 00 22 40032 		мода	L0032
      00 001 0000 		зпм	SKZONA
    2 12 24 00000 		уиа	0(М12)
      00 22 00000 		мода	SKZONA
    3 13 010 0000 	L0003	сч	(М13)
      00 040 0013 		уи	М13
    4 00 042 0013 		счи	М13
      12 22 40030 		мода	L0030
    5 00 012 0000 		нтж	SKZONA
      00 22 40027 		мода	L0027
    6 00 000 0000 		зп	SKZONA
      11 010 0000 		сч	(М11)
    7 00 036 0064 		сда	64-12
      00 22 40027 		мода	L0027
   10 00 012 0000 		нтж	SKZONA
      00 22 40027 		мода	L0027
   11 00 075 0000 		Э75	SKZONA
   12 00 22 40027 		мода	L0027
      00 070 0000 		Э70	SKZONA
   13 12 35 40017 		пино	L0017
      13 24 74003 		уиа	A31745
   14 00 22 74001 	L0014	мода	SKZONA1024
      13 010 1777 		сч	'1777'(М13)
   15 00 23 40032 		мод	L0032
      13 000 1777 		зп	'1777'(М13)
   16 13 37 40014 		цикл	L0014
      00 22 00000 		мода	SKZONA
   17 15 30 00000 	L0017	пб	(М15)
   20 00 041 0011 		уим	М11
      00 041 0013 		уим	М13
   21 00 22 40032 		мода	L0032
      00 001 0000 		зпм	SKZONA
   22 12 24 74003 		уиа	A31745
      00 22 00000 		мода	SKZONA
   23 00 23 40032 	L0023	мод	L0032
      12 010 1777 		сч	'1777'(М12)
   24 00 22 74001 		мода	SKZONA1024
      12 000 1777 		зп	'1777'(М12)
   25 12 37 40023 		цикл	L0023
      12 24 00001 		уиа	1(М12)
   26 00 30 40003 		пб	L0003
   27 00 010 4004 	L0027	сч	'4004'
      00 041 0000 		уим	
   30 00 010 4004 	L0030	сч	'4004'
      00 000 0000 		зп	SKZONA
   31 00 000 4004 		зп	'4004'
      00 000 0000 		зп	SKZONA
				ФИНИШ
