; START - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 6496
; длина при загрузке: 31 слов (52 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*KORT*, 2=*KORT*+16, 3=*EGO*, 4=*EGO*+16040, 
; 5=*EGO*+20630, 6=*EGO*+20631, 7=*FOP*, 8=*KOMA*, 9=*KOMA*+2, 10=*KOMA*+7, 
; 11=*NUNU*, 13=*KORT*+77777
; локальные метки: L0001=1, L0010=10, L0012=12, L0033=33, L0036=36, 
; L0040=40, L0041=41
; START: код модуля
         Type: Binary
         Code: 156 (032) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40022 		пб	'40022'
    1 07 010 0000 		сч	(М7)
      00 22 74007 		мода	'74007'
    2 00 000 0000 		зп	L0001
      00 037 0003 		ржа	'3'
    3 07 010 0001 		сч	1(М7)
      07 000 0003 		зп	3(М7)
    4 00 037 0022 	L0010	ржа	'22'
      00 22 00000 		мода	L0001
    5 07 010 4014 	L0012	сч	'4014'(М7)
      00 23 40036 		мод	'40036'
    6 01 24 00000 		уиа	0(М1)
      01 22 74015 		мода	'74015'(М1)
    7 00 000 0000 		зп	L0001
      00 22 00000 		мода	L0001
   10 07 010 0003 		сч	3(М7)
      00 037 0003 		ржа	'3'
   11 07 004 0001 		сл	1(М7)
      07 000 0003 		зп	3(М7)
   12 07 006 0002 		вчоб	2(М7)
      00 037 0022 		ржа	'22'
   13 00 26 40005 		по	'40005'
      07 010 0001 		сч	1(М7)
   14 00 22 74002 		мода	'74002'
      00 000 0000 		зп	L0001
   15 00 037 0003 	L0033	ржа	'3'
      07 010 0000 		сч	(М7)
   16 00 22 74005 		мода	'74005'
      00 000 0000 		зп	L0001
   17 07 010 0001 	L0036	сч	1(М7)
      00 22 74013 		мода	'74013'
   20 00 000 0000 	L0040+L0041	зп	L0001
      00 037 0022 		ржа	'22'
   21 00 30 40027 		пб	'40027'
   22 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   23 07 24 40033 		уиа	L0033
      00 043 0015 		счим	М15
   24 00 043 0001 		счим	М1
      00 043 0010 		счим	М10
   25 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   26 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   27 00 041 0000 		уим	
      00 041 0007 		уим	М7
   30 00 041 0001 		уим	М1
      00 041 0010 		уим	М10
   31 10 30 00000 		пб	(М10)
				ФИНИШ
