; TARNYB - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 8960
; длина при загрузке: 248 слов (470 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=PAGE, 2=TYPE, 3=TYPE1, 4=TYPE11, 5=TYPE12, 6=TYPE13, 
; 7=KORT, 8=KORT14, 9=NOTF, 10=NOTF1, 11=NOTF2, 12=WHO, 13=WHO1, 14=SAL, 
; 15=HOWSMB, 16=RASPS, 17=WHATYP, 18=GOTOPO, 19=WRIKOR, 20=CSTRIN, 
; 21=ENDKOR, 22=PAGE1
; локальные метки: TARNYB=0, L0001=1, L0010=10, L0014=14, L0051=51, 
; L0052=52, L0063=63, L0064=64, L0075=75, L0113=113, L0114=114, L0124=124, 
; L0134=134, L0143=143, L0147=147, L0152=152, L0225=225, L0231=231, 
; L0234=234, L0333=333, L0334=334, L0342=342, L0343=343, L0344=344, 
; L0351=351, L0353=353, L0354=354, L0355=355, L0356=356, L0357=357, 
; L0360=360, L0361=361, L0363=363, L0364=364, L0365=365, L0366=366, 
; L0367=367
; TARNYB: код модуля
         Type: Binary
         Code: 1410 (0353) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	TARNYB	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40344 		пб	L0344
    1 00 22 74026 	L0001	мода	PAGE1
      00 010 0000 		сч	TARNYB
    2 07 000 0010 		зп	8(М7)
      00 037 0003 		ржа	'3'
    3 00 037 0022 		ржа	'22'
      15 31 74025 		пв	ENDKOR
    4 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
    5 16 24 40364 		уиа	L0364
      00 043 0016 		счим	М16
    6 15 31 74024 		пв	CSTRIN
    7 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   10 00 23 74002 	L0010	мод	TYPE
      00 30 40010 		пб	L0010
   11 00 30 40014 		пб	L0014
   12 00 30 40143 		пб	L0143
   13 00 30 40225 		пб	L0225
   14 00 22 74011 	L0014	мода	NOTF
      00 010 0000 		сч	TARNYB
   15 00 037 0003 		ржа	'3'
      07 004 0003 		сл	3(М7)
   16 00 22 74011 		мода	NOTF
      00 000 0000 		зп	TARNYB
   17 00 22 74006 		мода	TYPE13
      00 004 0000 		сл	TARNYB
   20 07 004 0002 		сл	2(М7)
      00 22 74012 		мода	NOTF1
   21 00 000 0000 		зп	TARNYB
      00 22 74026 		мода	PAGE1
   22 00 010 0000 		сч	TARNYB
      00 22 74012 		мода	NOTF1
   23 00 005 0000 		вч	TARNYB
      07 004 0001 		сл	1(М7)
   24 00 22 74013 		мода	NOTF2
      00 000 0000 		зп	TARNYB
   25 00 037 0022 		ржа	'22'
      15 31 74025 		пв	ENDKOR
   26 16 24 40353 		уиа	L0353
      00 043 0016 		счим	М16
   27 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
   30 16 24 40356 		уиа	L0356
      00 043 0016 		счим	М16
   31 15 31 74023 		пв	WRIKOR
   32 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   33 00 22 74010 		мода	KORT14
      00 010 0000 		сч	TARNYB
   34 00 037 0003 		ржа	'3'
      07 004 0001 		сл	1(М7)
   35 00 22 74010 		мода	KORT14
      00 000 0000 		зп	TARNYB
   36 16 24 40353 		уиа	L0353
      00 043 0016 		счим	М16
   37 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
   40 16 24 40356 		уиа	L0356
      00 043 0016 		счим	М16
   41 00 037 0022 		ржа	'22'
      15 31 74023 		пв	WRIKOR
   42 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   43 16 24 74011 		уиа	NOTF
      00 043 0016 		счим	М16
   44 15 31 74022 		пв	GOTOPO
   45 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   46 00 22 74004 		мода	TYPE11
      00 010 0000 		сч	TARNYB
   47 17 012 0000 		нтж	(М17)
      00 27 40051 		пе	L0051
   50 00 30 40052 		пб	L0052
   51 00 30 40124 	L0051	пб	L0124
   52 00 22 74003 	L0052	мода	TYPE1
      00 010 0000 		сч	TARNYB
   53 07 000 0011 		зп	9(М7)
      00 037 0003 		ржа	'3'
   54 00 22 74006 		мода	TYPE13
      00 010 0000 		сч	TARNYB
   55 07 000 0012 		зп	10(М7)
      00 037 0022 		ржа	'22'
   56 15 31 74021 		пв	WHATYP
   57 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
   60 00 22 74005 		мода	TYPE12
      00 010 0000 		сч	TARNYB
   61 17 012 0000 		нтж	(М17)
      00 26 40063 		по	L0063
   62 00 30 40064 		пб	L0064
   63 00 30 40075 	L0063	пб	L0075
   64 00 22 74011 	L0064	мода	NOTF
      00 010 0000 		сч	TARNYB
   65 00 037 0003 		ржа	'3'
      07 005 0003 		вч	3(М7)
   66 00 22 74011 		мода	NOTF
      00 000 0000 		зп	TARNYB
   67 00 22 74012 		мода	NOTF1
      00 010 0000 		сч	TARNYB
   70 07 005 0003 		вч	3(М7)
      00 22 74012 		мода	NOTF1
   71 00 000 0000 		зп	TARNYB
      00 22 74013 		мода	NOTF2
   72 00 010 0000 		сч	TARNYB
      07 004 0003 		сл	3(М7)
   73 00 22 74013 		мода	NOTF2
      00 000 0000 		зп	TARNYB
   74 00 037 0022 		ржа	'22'
      00 22 00000 		мода	TARNYB
   75 07 010 0006 	L0075	сч	6(М7)
      00 22 74016 		мода	SAL
   76 00 000 0000 		зп	TARNYB
      00 037 0003 		ржа	'3'
   77 16 24 40365 		уиа	L0365
      00 043 0016 		счим	М16
  100 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  101 16 24 40366 		уиа	L0366
      00 043 0016 		счим	М16
  102 00 037 0022 		ржа	'22'
      15 31 74023 		пв	WRIKOR
  103 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  104 00 22 74010 		мода	KORT14
      00 010 0000 		сч	TARNYB
  105 00 037 0003 		ржа	'3'
      07 004 0001 		сл	1(М7)
  106 00 22 74010 		мода	KORT14
      00 000 0000 		зп	TARNYB
  107 07 010 0001 		сч	1(М7)
      00 043 0000 		счим	
  110 00 22 74005 		мода	TYPE12
      00 010 0000 		сч	TARNYB
  111 00 037 0022 		ржа	'22'
      17 012 0000 		нтж	(М17)
  112 00 27 40113 		пе	L0113
      00 30 40114 		пб	L0114
  113 00 30 40343 	L0113	пб	L0343
  114 00 22 74012 	L0114	мода	NOTF1
      00 010 0000 		сч	TARNYB
  115 00 037 0003 		ржа	'3'
      00 22 74006 		мода	TYPE13
  116 00 004 0000 		сл	TARNYB
      07 004 0001 		сл	1(М7)
  117 00 22 74012 		мода	NOTF1
      00 000 0000 		зп	TARNYB
  120 00 22 74026 		мода	PAGE1
      00 010 0000 		сч	TARNYB
  121 00 22 74012 		мода	NOTF1
      00 005 0000 		вч	TARNYB
  122 07 004 0001 		сл	1(М7)
      00 22 74013 		мода	NOTF2
  123 00 000 0000 		зп	TARNYB
      00 037 0022 		ржа	'22'
  124 16 24 74003 	L0124	уиа	TYPE1
      00 043 0016 		счим	М16
  125 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  126 16 24 74006 		уиа	TYPE13
      00 043 0016 		счим	М16
  127 15 31 74023 		пв	WRIKOR
  130 00 22 74010 		мода	KORT14
      00 010 0000 		сч	TARNYB
  131 00 037 0003 		ржа	'3'
      07 004 0001 		сл	1(М7)
  132 00 22 74010 		мода	KORT14
      00 000 0000 		зп	TARNYB
  133 00 037 0022 		ржа	'22'
      00 22 00000 		мода	TARNYB
  134 16 24 74012 	L0134	уиа	NOTF1
      00 043 0016 		счим	М16
  135 15 31 74022 		пв	GOTOPO
  136 15 31 74025 		пв	ENDKOR
  137 16 24 74012 		уиа	NOTF1
      00 043 0016 		счим	М16
  140 16 24 74013 		уиа	NOTF2
      00 043 0016 		счим	М16
  141 15 31 74024 		пв	CSTRIN
  142 00 30 40343 		пб	L0343
  143 00 22 74011 	L0143	мода	NOTF
      00 010 0000 		сч	TARNYB
  144 00 037 0003 		ржа	'3'
      00 006 0000 		вчоб	TARNYB
  145 07 004 0000 		сл	(М7)
      00 037 0022 		ржа	'22'
  146 00 26 40147 		по	L0147
      00 30 40152 		пб	L0152
  147 07 010 0001 	L0147	сч	1(М7)
      00 22 74011 		мода	NOTF
  150 00 000 0000 		зп	TARNYB
      00 037 0003 		ржа	'3'
  151 00 037 0022 		ржа	'22'
      00 22 00000 		мода	TARNYB
  152 16 24 40353 	L0152	уиа	L0353
      00 043 0016 		счим	М16
  153 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  154 16 24 40360 		уиа	L0360
      00 043 0016 		счим	М16
  155 15 31 74023 		пв	WRIKOR
  156 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  157 16 24 74011 		уиа	NOTF
      00 043 0016 		счим	М16
  160 16 24 40363 		уиа	L0363
      00 043 0016 		счим	М16
  161 16 24 40363 		уиа	L0363
      00 043 0016 		счим	М16
  162 16 24 40367 		уиа	L0367
      00 043 0016 		счим	М16
  163 16 24 40361 		уиа	L0361
      00 043 0016 		счим	М16
  164 16 24 40356 		уиа	L0356
      00 043 0016 		счим	М16
  165 15 31 74020 		пв	RASPS
  166 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  167 16 24 40367 		уиа	L0367
      00 043 0016 		счим	М16
  170 15 31 74017 		пв	HOWSMB
  171 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  172 16 24 40367 		уиа	L0367
      00 043 0016 		счим	М16
  173 16 24 74014 		уиа	WHO
      00 043 0016 		счим	М16
  174 16 24 74015 		уиа	WHO1
      00 043 0016 		счим	М16
  175 15 31 74023 		пв	WRIKOR
  176 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  177 16 24 40353 		уиа	L0353
      00 043 0016 		счим	М16
  200 16 24 40357 		уиа	L0357
      00 043 0016 		счим	М16
  201 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  202 15 31 74023 		пв	WRIKOR
  203 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  204 16 24 74003 		уиа	TYPE1
      00 043 0016 		счим	М16
  205 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  206 16 24 74006 		уиа	TYPE13
      00 043 0016 		счим	М16
  207 15 31 74023 		пв	WRIKOR
  210 16 24 40353 		уиа	L0353
      00 043 0016 		счим	М16
  211 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  212 16 24 40356 		уиа	L0356
      00 043 0016 		счим	М16
  213 15 31 74023 		пв	WRIKOR
  214 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  215 00 22 74011 		мода	NOTF
      00 010 0000 		сч	TARNYB
  216 00 037 0003 		ржа	'3'
      07 004 0003 		сл	3(М7)
  217 00 22 74012 		мода	NOTF1
      00 000 0000 		зп	TARNYB
  220 00 22 74026 		мода	PAGE1
      00 010 0000 		сч	TARNYB
  221 00 22 74012 		мода	NOTF1
      00 005 0000 		вч	TARNYB
  222 07 004 0001 		сл	1(М7)
      00 22 74013 		мода	NOTF2
  223 00 000 0000 		зп	TARNYB
      00 037 0022 		ржа	'22'
  224 00 30 40134 		пб	L0134
  225 00 22 74011 	L0225	мода	NOTF
      00 010 0000 		сч	TARNYB
  226 00 037 0003 		ржа	'3'
      00 006 0000 		вчоб	TARNYB
  227 07 004 0000 		сл	(М7)
      00 037 0022 		ржа	'22'
  230 00 26 40231 		по	L0231
      00 30 40234 		пб	L0234
  231 07 010 0001 	L0231	сч	1(М7)
      00 22 74011 		мода	NOTF
  232 00 000 0000 		зп	TARNYB
      00 037 0003 		ржа	'3'
  233 00 037 0022 		ржа	'22'
      00 22 00000 		мода	TARNYB
  234 16 24 40353 	L0234	уиа	L0353
      00 043 0016 		счим	М16
  235 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  236 16 24 40360 		уиа	L0360
      00 043 0016 		счим	М16
  237 15 31 74023 		пв	WRIKOR
  240 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  241 16 24 74011 		уиа	NOTF
      00 043 0016 		счим	М16
  242 16 24 40363 		уиа	L0363
      00 043 0016 		счим	М16
  243 16 24 40363 		уиа	L0363
      00 043 0016 		счим	М16
  244 16 24 40367 		уиа	L0367
      00 043 0016 		счим	М16
  245 16 24 40361 		уиа	L0361
      00 043 0016 		счим	М16
  246 16 24 40356 		уиа	L0356
      00 043 0016 		счим	М16
  247 15 31 74020 		пв	RASPS
  250 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  251 16 24 40367 		уиа	L0367
      00 043 0016 		счим	М16
  252 15 31 74017 		пв	HOWSMB
  253 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  254 16 24 40367 		уиа	L0367
      00 043 0016 		счим	М16
  255 16 24 74014 		уиа	WHO
      00 043 0016 		счим	М16
  256 16 24 74015 		уиа	WHO1
      00 043 0016 		счим	М16
  257 15 31 74023 		пв	WRIKOR
  260 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  261 16 24 40353 		уиа	L0353
      00 043 0016 		счим	М16
  262 16 24 40357 		уиа	L0357
      00 043 0016 		счим	М16
  263 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  264 15 31 74023 		пв	WRIKOR
  265 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  266 16 24 74003 		уиа	TYPE1
      00 043 0016 		счим	М16
  267 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  270 16 24 74006 		уиа	TYPE13
      00 043 0016 		счим	М16
  271 15 31 74023 		пв	WRIKOR
  272 00 22 74010 		мода	KORT14
      00 010 0000 		сч	TARNYB
  273 00 037 0003 		ржа	'3'
      07 004 0001 		сл	1(М7)
  274 00 22 74010 		мода	KORT14
      00 000 0000 		зп	TARNYB
  275 00 037 0022 		ржа	'22'
      15 31 74021 		пв	WHATYP
  276 16 24 74003 		уиа	TYPE1
      00 043 0016 		счим	М16
  277 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  300 16 24 74006 		уиа	TYPE13
      00 043 0016 		счим	М16
  301 15 31 74023 		пв	WRIKOR
  302 16 24 40353 		уиа	L0353
      00 043 0016 		счим	М16
  303 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  304 16 24 40356 		уиа	L0356
      00 043 0016 		счим	М16
  305 15 31 74023 		пв	WRIKOR
  306 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  307 00 22 74010 		мода	KORT14
      00 010 0000 		сч	TARNYB
  310 00 037 0003 		ржа	'3'
      07 004 0001 		сл	1(М7)
  311 00 22 74010 		мода	KORT14
      00 000 0000 		зп	TARNYB
  312 16 24 40353 		уиа	L0353
      00 043 0016 		счим	М16
  313 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  314 16 24 40356 		уиа	L0356
      00 043 0016 		счим	М16
  315 00 037 0022 		ржа	'22'
      15 31 74023 		пв	WRIKOR
  316 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  317 00 22 74011 		мода	NOTF
      00 010 0000 		сч	TARNYB
  320 00 037 0003 		ржа	'3'
      07 005 0003 		вч	3(М7)
  321 00 22 74011 		мода	NOTF
      00 000 0000 		зп	TARNYB
  322 07 004 0003 		сл	3(М7)
      00 22 74012 		мода	NOTF1
  323 00 000 0000 		зп	TARNYB
      00 22 74026 		мода	PAGE1
  324 00 010 0000 		сч	TARNYB
      00 22 74012 		мода	NOTF1
  325 00 005 0000 		вч	TARNYB
      07 004 0001 		сл	1(М7)
  326 00 22 74013 		мода	NOTF2
      00 000 0000 		зп	TARNYB
  327 00 22 74011 		мода	NOTF
      00 010 0000 		сч	TARNYB
  330 00 006 0000 		вчоб	TARNYB
      07 004 0000 		сл	(М7)
  331 00 037 0022 		ржа	'22'
      00 27 40333 		пе	L0333
  332 00 30 40334 		пб	L0334
  333 00 30 40342 	L0333	пб	L0342
  334 15 31 74025 	L0334	пв	ENDKOR
  335 16 24 40355 		уиа	L0355
      00 043 0016 		счим	М16
  336 16 24 40364 		уиа	L0364
      00 043 0016 		счим	М16
  337 15 31 74024 		пв	CSTRIN
  340 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  341 00 30 40343 		пб	L0343
  342 00 30 40134 	L0342	пб	L0134
  343 00 30 40351 	L0343	пб	L0351
  344 07 044 0010 	L0344	уии	М10(М7)
      16 044 0012 		уии	М12(М16)
  345 07 24 40354 		уиа	L0354
      00 043 0015 		счим	М15
  346 00 043 0010 		счим	М10
      00 043 0000 		счим	
  347 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
  350 12 30 00000 		пб	(М12)
  351 00 041 0000 	L0351	уим	
      00 041 0007 		уим	М7
  352 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
