; TXTRED - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 16160
; длина при загрузке: 38 слов (64 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*RPT*, 2=*EGO*, 3=*EGO*+16040, 4=*EGO*+20630, 
; 5=*EGO*+20631, 6=*RUSIS*, 7=SPAUD
; локальные метки: L0000=0, L0001=1, L0002=2, L0010=10, L0012=12, L0040=40, 
; L0043=43, L0044=44
; TXTRED: код модуля
         Type: Binary
         Code: 192 (040) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0000+L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40031 		пб	'40031'
    1 00 23 40045 	L0002	мод	'40045'
      00 010 0000 		сч	L0000+L0001
    2 00 22 74001 		мода	'74001'
      00 000 0000 		зп	L0000+L0001
    3 00 037 0003 		ржа	'3'
      00 22 74001 		мода	'74001'
    4 00 010 0000 	L0010	сч	L0000+L0001
      00 006 0000 		вчоб	L0000+L0001
    5 07 004 0002 	L0012	сл	2(М7)
      00 037 0022 		ржа	'22'
    6 00 27 40007 		пе	'40007'
      00 30 40012 		пб	'40012'
    7 07 010 0002 		сч	2(М7)
      00 22 74001 		мода	'74001'
   10 00 000 0000 		зп	L0000+L0001
      00 037 0003 		ржа	'3'
   11 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0000+L0001
   12 07 010 0001 		сч	1(М7)
      00 22 74006 		мода	'74006'
   13 00 000 0000 		зп	L0000+L0001
      00 037 0003 		ржа	'3'
   14 00 037 0022 		ржа	'22'
      00 22 00000 		мода	L0000+L0001
   15 16 24 40043 		уиа	L0043
      00 043 0016 		счим	М16
   16 16 24 40044 		уиа	L0044
      00 043 0016 		счим	М16
   17 15 31 74007 		пв	'74007'(М15)
   20 00 037 0003 	L0040	ржа	'3'
      00 037 0022 		ржа	'22'
   21 00 22 74004 	L0043	мода	'74004'
      00 010 0000 		сч	L0000+L0001
   22 00 037 0003 	L0044	ржа	'3'
      00 006 0000 		вчоб	L0000+L0001
   23 07 004 0000 		сл	(М7)
      00 037 0022 		ржа	'22'
   24 00 27 40025 		пе	'40025'
      00 30 40026 		пб	'40026'
   25 00 30 40015 		пб	'40015'
   26 07 010 0000 		сч	(М7)
      00 22 74006 		мода	'74006'
   27 00 000 0000 		зп	L0000+L0001
      00 037 0003 		ржа	'3'
   30 00 037 0022 		ржа	'22'
      00 30 40036 		пб	'40036'
   31 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   32 07 24 40040 		уиа	L0040
      07 001 0005 		зпм	5(М7)
   33 00 043 0015 		счим	М15
      00 043 0010 		счим	М10
   34 00 043 0000 		счим	
      00 037 0003 		ржа	'3'
   35 00 037 0002 		ржа	'2'
      12 30 00000 		пб	(М12)
   36 00 041 0000 		уим	
      00 041 0007 		уим	М7
   37 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
