; WCPABH - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 6048
; длина при загрузке: 43 слов (78 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*WДЛИHA*, 2=*W24*, 4=*WДЛИHA*+1, 5=*WДЛИHA*+2
; локальные метки: WCPABH=0, L0002=2, L0003=3, L0020=20, L0021=21, 
; L0022=22, L0023=23, L0035=35, L0042=42
; WCPABH: код модуля
         Type: Binary
         Code: 234 (047) words
      Address: 0

				СТАРТ	'0'
    0 00 037 0003 	WCPABH	ноп
				ноп
			START	ржа	'3'
      00 041 0012 		уим	М12
    1 00 040 0011 	L0002+L0003	уи	М11
      00 23 74001 		мод	*WДЛИHA*
    2 16 24 00000 		уиа	0(М16)
      14 24 40002 		уиа	L0002
    3 11 010 0000 		сч	(М11)
      16 34 40023 		пио	L0023
    4 00 036 0114 		сда	64+12
      14 015 0047 		или	39(М14)
    5 12 003 0000 		счм	(М12)
      00 036 0114 		сда	64+12
    6 14 015 0047 		или	39(М14)
      17 006 0000 		вчоб	(М17)
    7 00 27 40020 		пе	L0020
      14 012 0047 		нтж	39(М14)
   10 00 27 40021 	L0020+L0021	пе	L0021
      11 010 0000 		сч	(М11)
   11 14 011 0045 	L0022+L0023	и	37(М14)
      14 015 0047 		или	39(М14)
   12 12 003 0000 		счм	(М12)
      14 011 0045 		и	37(М14)
   13 14 015 0047 		или	39(М14)
      17 006 0000 		вчоб	(М17)
   14 00 27 40020 		пе	L0020
      14 012 0047 		нтж	39(М14)
   15 00 27 40021 		пе	L0021
      12 25 00001 		слиа	1(М12)
   16 11 25 00001 	L0035	слиа	1(М11)
      16 25 74003 		слиа	СИМ3
   17 00 30 40003 		пб	L0003
   20 14 010 0046 		сч	38(М14)
      00 30 40022 		пб	L0022
   21 14 010 0050 	L0042	сч	40(М14)
      00 22 00000 		мода	WCPABH
   22 00 037 0022 		ржа	'22'
      15 30 00000 		пб	(М15)
   23 00 23 74004 		мод	*WДЛИHA*+1
      16 24 00000 		уиа	0(М16)
   24 16 34 40042 		пио	L0042
      00 036 0130 		сда	64+24
   25 14 015 0047 		или	39(М14)
      12 003 0000 		счм	(М12)
   26 00 036 0130 		сда	64+24
      14 015 0047 		или	39(М14)
   27 17 006 0000 		вчоб	(М17)
      00 27 40020 		пе	L0020
   30 14 012 0047 		нтж	39(М14)
      00 27 40021 		пе	L0021
   31 00 23 74005 		мод	*WДЛИHA*+2
      16 24 74006 		уиа	СИМ6
   32 11 010 0000 		сч	(М11)
      16 22 74002 		мода	*W24*
   33 00 011 4003 		и	'4003'
      14 015 0047 		или	39(М14)
   34 12 003 0000 		счм	(М12)
      00 22 00000 		мода	WCPABH
   35 16 22 74002 		мода	*W24*
      00 011 4003 		и	'4003'
   36 14 015 0047 		или	39(М14)
      17 006 0000 		вчоб	(М17)
   37 00 27 40020 		пе	L0020
      14 012 0047 		нтж	39(М14)
   40 00 27 40021 		пе	L0021
      14 010 0047 		сч	39(М14)
   41 00 30 40022 		пб	L0022
   42 00 23 74005 		мод	*WДЛИHA*+2
      16 24 00000 		уиа	0(М16)
   43 11 010 0000 		сч	(М11)
      00 036 0130 		сда	64+24
   44 16 22 74002 		мода	*W24*
      00 011 4003 		и	'4003'
   45 14 015 0047 		или	39(М14)
      12 003 0000 		счм	(М12)
   46 00 036 0130 		сда	64+24
      00 30 40035 		пб	L0035
				ФИНИШ
