; WRILIN - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 7552
; длина при загрузке: 102 слов (172 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=PAGE, 2=CEN, 3=WHO, 4=WHO1, 5=ONE, 6=ONE1, 7=ONE2, 
; 8=NUM, 9=NUM2, 10=NUM3, 11=KOMA, 12=KOMA2, 13=KOMA7, 14=KLAIDA, 
; 15=ENDKOR, 16=HOWSMB, 17=RASPS, 18=WRIKOR, 19=ONESTR, 20=IDII, 21=PAGE3, 
; 22=PAGE4, 23=PAGE5
; локальные метки: WRILIN=0, L0001=1, L0024=24, L0025=25, L0030=30, 
; L0113=113, L0116=116, L0117=117, L0124=124, L0126=126, L0127=127, 
; L0130=130, L0131=131, L0132=132, L0133=133, L0134=134, L0135=135, 
; L0142=142, L0143=143, L0144=144, L0145=145
; WRILIN: код модуля
         Type: Binary
         Code: 516 (0126) words
      Address: 0

				СТАРТ	'0'
* next insn used as data
    0 16 24 40001 	L0001+WRILIN	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40117 		пб	L0117
    1 00 22 74006 		мода	ONE1
      00 010 0000 		сч	L0001+WRILIN
    2 16 24 40131 		уиа	L0131
      15 31 74024 		пв	IDII
    3 00 037 0003 		ржа	'3'
      00 22 74005 		мода	ONE
    4 00 004 0000 		сл	L0001+WRILIN
      00 22 74002 		мода	CEN
    5 00 000 0000 		зп	L0001+WRILIN
      00 22 74025 		мода	PAGE3
    6 00 010 0000 		сч	L0001+WRILIN
      00 22 74026 		мода	PAGE4
    7 00 004 0000 		сл	L0001+WRILIN
      00 22 74027 		мода	PAGE5
   10 00 004 0000 		сл	L0001+WRILIN
      07 000 0011 		зп	9(М7)
   11 00 037 0022 		ржа	'22'
      15 31 74023 		пв	ONESTR
   12 00 22 74025 	L0024+L0025	мода	PAGE3
      00 010 0000 		сч	L0001+WRILIN
   13 00 037 0003 		ржа	'3'
      00 22 74007 		мода	ONE2
   14 00 004 0000 	L0030	сл	L0001+WRILIN
      07 004 0002 		сл	2(М7)
   15 07 000 0012 		зп	10(М7)
      07 010 0011 		сч	9(М7)
   16 16 24 40131 		уиа	L0131
      15 31 74024 		пв	IDII
   17 07 005 0012 		вч	10(М7)
      07 004 0001 		сл	1(М7)
   20 07 000 0013 		зп	11(М7)
      07 010 0013 		сч	11(М7)
   21 00 006 0000 		вчоб	L0001+WRILIN
      07 004 0000 		сл	(М7)
   22 00 037 0022 		ржа	'22'
      00 27 40024 		пе	L0024
   23 00 30 40025 		пб	L0025
   24 00 30 40030 		пб	L0030
   25 07 010 0007 		сч	7(М7)
      07 000 0014 		зп	12(М7)
   26 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   27 00 30 40113 		пб	L0113
   30 16 24 74015 		уиа	KOMA7
      00 043 0016 		счим	М16
   31 16 24 40130 		уиа	L0130
      00 043 0016 		счим	М16
   32 16 24 40130 		уиа	L0130
      00 043 0016 		счим	М16
   33 15 31 74022 		пв	WRIKOR
   34 16 24 40142 		уиа	L0142
      00 043 0016 		счим	М16
   35 16 24 40134 		уиа	L0134
      00 043 0016 		счим	М16
   36 16 24 40134 		уиа	L0134
      00 043 0016 		счим	М16
   37 16 24 40144 		уиа	L0144
      00 043 0016 		счим	М16
   40 16 24 40133 		уиа	L0133
      00 043 0016 		счим	М16
   41 16 24 40131 		уиа	L0131
      00 043 0016 		счим	М16
   42 15 31 74021 		пв	RASPS
   43 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   44 16 24 40144 		уиа	L0144
      00 043 0016 		счим	М16
   45 15 31 74020 	L0113	пв	HOWSMB
   46 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   47 16 24 40144 	L0116+L0117	уиа	L0144
      00 043 0016 		счим	М16
   50 16 24 74003 		уиа	WHO
      00 043 0016 		счим	М16
   51 16 24 74004 		уиа	WHO1
      00 043 0016 		счим	М16
   52 15 31 74022 	L0124	пв	WRIKOR
   53 00 037 0003 	L0126+L0127	ржа	'3'
      00 037 0022 		ржа	'22'
   54 16 24 74015 	L0130+L0131	уиа	KOMA7
      00 043 0016 		счим	М16
   55 16 24 40132 	L0132+L0133	уиа	L0132
      00 043 0016 		счим	М16
   56 16 24 40130 	L0134+L0135	уиа	L0130
      00 043 0016 		счим	М16
   57 15 31 74022 		пв	WRIKOR
   60 16 24 74015 		уиа	KOMA7
      00 043 0016 		счим	М16
   61 16 24 40130 	L0142+L0143	уиа	L0130
      00 043 0016 		счим	М16
   62 16 24 40130 	L0144+L0145	уиа	L0130
      00 043 0016 		счим	М16
   63 15 31 74022 		пв	WRIKOR
   64 16 24 74002 		уиа	CEN
      00 043 0016 		счим	М16
   65 16 24 40135 		уиа	L0135
      00 043 0016 		счим	М16
   66 16 24 40135 		уиа	L0135
      00 043 0016 		счим	М16
   67 16 24 40145 		уиа	L0145
      00 043 0016 		счим	М16
   70 16 24 40133 		уиа	L0133
      00 043 0016 		счим	М16
   71 16 24 40131 		уиа	L0131
      00 043 0016 		счим	М16
   72 15 31 74021 		пв	RASPS
   73 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   74 16 24 40145 		уиа	L0145
      00 043 0016 		счим	М16
   75 15 31 74020 		пв	HOWSMB
   76 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   77 16 24 40145 		уиа	L0145
      00 043 0016 		счим	М16
  100 16 24 74003 		уиа	WHO
      00 043 0016 		счим	М16
  101 16 24 74004 		уиа	WHO1
      00 043 0016 		счим	М16
  102 15 31 74022 		пв	WRIKOR
  103 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  104 16 24 40126 		уиа	L0126
      00 043 0016 		счим	М16
  105 16 24 40130 		уиа	L0130
      00 043 0016 		счим	М16
  106 16 24 40133 		уиа	L0133
      00 043 0016 		счим	М16
  107 15 31 74022 		пв	WRIKOR
  110 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  111 15 31 74017 		пв	ENDKOR
  112 00 30 40116 		пб	L0116
  113 16 24 40143 		уиа	L0143
      00 043 0016 		счим	М16
  114 15 31 74016 		пв	KLAIDA
  115 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
  116 00 30 40124 		пб	L0124
  117 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
  120 07 24 40127 		уиа	L0127
      00 043 0015 		счим	М15
  121 00 043 0010 		счим	М10
      00 043 0000 		счим	
  122 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
  123 12 30 00000 		пб	(М12)
  124 00 041 0000 		уим	
      00 041 0007 		уим	М7
  125 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
