; WRITEH - модуль СИПРОДа, автокод БЕМШ
; разобрано disbesm6, объект в siprod.bin, слово 7488
; длина при загрузке: 27 слов (48 команд)
; адреса в командах (в слове две команды)
; внешние символы: 1=*NUNU*, 2=*NUST*, 3=*GOT*, 4=*REGIM*, 5=TWOPLA, 
; 6=WRIVER, 7=WRIHOR, 8=WRILIN, 9=ONEPLA, 10=WRIKOR
; локальные метки: L0001=1, L0010=10, L0012=12, L0030=30, L0031=31, 
; L0032=32
; WRITEH: код модуля
         Type: Binary
         Code: 144 (030) words
      Address: 0

				СТАРТ	'0'
    0 16 24 40001 	L0001	ноп
				ноп
			START	уиа	'40001'(М16)
      00 30 40021 		пб	'40021'
    1 07 010 0000 		сч	(М7)
      00 043 0000 		счим	
    2 00 22 74003 		мода	'74003'
      00 010 0000 		сч	L0001
    3 17 012 0000 		нтж	(М17)
      00 26 40005 		по	'40005'
    4 00 30 40006 	L0010	пб	'40006'
    5 00 30 40013 	L0012	пб	'40013'
    6 16 24 40030 		уиа	L0030
      00 043 0016 		счим	М16
    7 16 24 40031 		уиа	L0031
      00 043 0016 		счим	М16
   10 16 24 40032 		уиа	L0032
      00 043 0016 		счим	М16
   11 15 31 74012 		пв	'74012'(М15)
   12 00 037 0003 		ржа	'3'
      00 037 0022 		ржа	'22'
   13 15 31 74011 		пв	'74011'(М15)
   14 15 31 74010 	L0030+L0031	пв	'74010'(М15)
   15 15 31 74007 	L0032	пв	'74007'(М15)
   16 15 31 74006 		пв	'74006'(М15)
   17 15 31 74005 		пв	'74005'(М15)
   20 00 30 40026 		пб	'40026'
   21 07 044 0010 		уии	М10(М7)
      16 044 0012 		уии	М12(М16)
   22 07 24 40031 		уиа	L0031
      00 043 0015 		счим	М15
   23 00 043 0010 		счим	М10
      00 043 0000 		счим	
   24 00 037 0003 		ржа	'3'
      00 037 0002 		ржа	'2'
   25 12 30 00000 		пб	(М12)
   26 00 041 0000 		уим	
      00 041 0007 		уим	М7
   27 00 041 0010 		уим	М10
      10 30 00000 		пб	(М10)
				ФИНИШ
