***************************************************
* ANATXT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 16224 образа SIPROD.BIN
*   Длина при загрузке: 124 слов, 226 команд
*   Вход: ANATXT
*   Внешние: *INS*, *STR*, *TXT*, *SCANER*, *LRE*, *ATV*, *INF*, RWINF, 
*   SYTINT, W/AИБ0
*   Смещения в *ATV*: 1
*   Смещения в *INF*: 1, 2
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *SCANER*: 1, 2
*   Смещения в *STR*: 24, 25, 26
*   Смещения в *TXT*: 1, 2, 3
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
ANATXT  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0152                    ,переход на L0152
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
L0010   ЗП     ANATXT                   ,ANATXT := СМ
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
L0012   МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     ANATXT                   ,ANATXT := СМ
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
L0015   ЗП     7(М7)                    ,7 := СМ
L0016   РЖА    '22'                     ,РЖ := '22'
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        ПВ     W/AИБ0(М15)              ,вызов через М15
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     ANATXT                   ,СМ := ANATXT
        НТЖ    ANATXT(М17)              ,СМ ^= ANATXT(М17)
        ПЕ     L0015                    ,если СМ≠0 → L0015
        ПБ     L0016                    ,переход на L0016
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        ПБ     L0072                    ,переход на L0072
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0035   СЧ     ANATXT                   ,СМ := ANATXT
L0036   РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     8(М7)                    ,8 := СМ
        ЗП     9(М7)                    ,9 := СМ
L0042   УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0172(М16)               ,М16 := L0172
L0045   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0173(М16)               ,М16 := L0173
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
L0052   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     W/AИБ0(М15)              ,вызов через М15
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     ANATXT                   ,СМ := ANATXT
        НТЖ    ANATXT(М17)              ,СМ ^= ANATXT(М17)
        ПО     L0035                    ,если СМ=0 → L0035
        ПБ     L0036                    ,переход на L0036
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
L0072   ПБ     L0052                    ,переход на L0052
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        СЧИМ                            ,СЧИ + магазин
L0076   МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
L0077   СЧ     ANATXT                   ,СМ := ANATXT
        НТЖ    ANATXT(М17)              ,СМ ^= ANATXT(М17)
        ПО     L0042                    ,если СМ=0 → L0042
        ПБ     L0045                    ,переход на L0045
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        СЧ     8(М7)                    ,СМ := 8(М7)
L0105   МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0111   МОДА   ANATXT                   ,мод.адрес +1: ANATXT
L0112   СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        ЗП     7(М7)                    ,7 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     ANATXT                   ,СМ := ANATXT
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L0120   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0121   ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0130                    ,переход на L0130
        СЧ     10(М7)                   ,СМ := 10(М7)
L0125   МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '3'                      ,РЖ := '3'
L0130   СЧ     8(М7)                    ,СМ := 8(М7)
        ВЧ     7(М7)                    ,СМ -= 7(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
L0134   ЗП     ANATXT                   ,ANATXT := СМ
L0135   МОДА   *ATV*                    ,мод.адрес +1: *ATV*
L0136   СЧ     ANATXT                   ,СМ := ANATXT
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     ANATXT                   ,ANATXT := СМ
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
L0142   СЧ     ANATXT                   ,СМ := ANATXT
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '22'                     ,РЖ := '22'
L0146   ПВ     RWINF(М15)               ,вызов через М15
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        МОДА   *INF*                    ,мод.адрес +1: *INF*
L0151   СЧ     ANATXT                   ,СМ := ANATXT
L0152   МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     ANATXT                   ,СМ := ANATXT
L0157   МОДА   *ATV*+1                  ,мод.адрес +1: *ATV*+1
        ЗП     ANATXT                   ,ANATXT := СМ
L0161   РЖА    '22'                     ,РЖ := '22'
        ПБ     L0142                    ,переход на L0142
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     ANATXT                   ,СМ := ANATXT
        НТЖ    ANATXT(М17)              ,СМ ^= ANATXT(М17)
        ПЕ     L0076                    ,если СМ≠0 → L0076
L0172   ПБ     L0077                    ,переход на L0077
L0173   МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        ПБ     L0105                    ,переход на L0105
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     ANATXT                   ,СМ := ANATXT
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     7(М7)                    ,СМ -= 7(М7)
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
        ЗП     ANATXT                   ,ANATXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0142                    ,переход на L0142
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     ANATXT                   ,СМ := ANATXT
        НТЖ    ANATXT(М17)              ,СМ ^= ANATXT(М17)
        ПО     L0111                    ,если СМ=0 → L0111
        ПБ     L0112                    ,переход на L0112
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        ПБ     L0125                    ,переход на L0125
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        ЗП     7(М7)                    ,7 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
        СЧ     ANATXT                   ,СМ := ANATXT
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ANATXT(М17)              ,СМ ^= ANATXT(М17)
        ПЕ     L0120                    ,если СМ≠0 → L0120
        ПБ     L0121                    ,переход на L0121
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        ПБ     L0130                    ,переход на L0130
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     ANATXT                   ,СМ := ANATXT
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0130                    ,переход на L0130
        СЧ     7(М7)                    ,СМ := 7(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     7(М7)                    ,7 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     ANATXT                   ,СМ := ANATXT
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ВЧ     ANATXT                   ,СМ -= ANATXT
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0134                    ,если СМ=0 → L0134
        ПБ     L0135                    ,переход на L0135
        ПБ     L0136                    ,переход на L0136
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        ПБ     L0010                    ,переход на L0010
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     ANATXT                   ,СМ := ANATXT
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
        СЧ     ANATXT                   ,СМ := ANATXT
        НТЖ    ANATXT(М17)              ,СМ ^= ANATXT(М17)
        ПО     L0146                    ,если СМ=0 → L0146
        ПБ     L0151                    ,переход на L0151
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        СЧ     ANATXT(М7)               ,СМ := ANATXT(М7)
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
        ЗП     ANATXT                   ,ANATXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        ПБ     L0157                    ,переход на L0157
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0161(М7)                ,М7 := L0161
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     ANATXT(М12)              ,переход через М12
        МОДА   ANATXT                   ,мод.адрес +1: ANATXT
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     ANATXT(М10)              ,переход через М10

