***************************************************
* AORB - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5952 образа SIPROD.BIN
*   Длина при загрузке: 27 слов, 54 команд
*   Вход: AORB
*   Внешние: KONSTA
*   Регистры: М10, М11, М12, М13, М14, М15, М16, М17
***************************************************
AORB    СТАРТ  0
        СЧИМ   М15                      ,стек := М15, СМ := М15
        ПВ     KONSTA(М15)              ,вызов через М15
        ЗПМ    9(М12)                   ,ЗП + магазин: 9(М12)
        УИМ    М16                      ,М16 := СМ + стек
        УИМ    М13                      ,М13 := СМ + стек
        УИМ    М11                      ,М11 := СМ + стек
        УИ     М14                      ,М14 := СМ
L0007   СЧ     AORB                     ,СМ := AORB
        СЧМ    AORB(М13)                ,магазин + СЧ: AORB(М13)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   3(М10)                   ,СМ := (адрес) - СМ
        УИМ    М13                      ,М13 := СМ + стек
        СЛИА   1(М13)                   ,М13 += 1
        МОДА   AORB                     ,мод.адрес +1: AORB
        СЧМ    AORB(М14)                ,магазин + СЧ: AORB(М14)
        ИЛИ    AORB(М11)                ,СМ |= AORB(М11)
        СЛИА   1(М14)                   ,М14 += 1
        ЧЕД    AORB(М17)                ,СМ := кол-во единиц в AORB(М17)
        СЛИА   1(М11)                   ,М11 += 1
        ЦИКЛ   L0007(М13)               ,М13-- и если ≠0 → повтор
L0024   ИЛИ    3(М10)                   ,СМ |= 3(М10)
        ЗПМ    AORB(М16)                ,ЗП + магазин: AORB(М16)
        РЖА    '6'                      ,РЖ := '6'
        МОД    9(М12)                   ,мод.адрес по коду: 9(М12)
        ПБ     AORB                     ,переход на AORB
        МОДА   AORB                     ,мод.адрес +1: AORB
        СЧИМ   М15                      ,стек := М15, СМ := М15
        ПВ     KONSTA(М15)              ,вызов через М15
        ЗПМ    9(М12)                   ,ЗП + магазин: 9(М12)
        УИМ    М16                      ,М16 := СМ + стек
        УИ     М13                      ,М13 := СМ
        СЧ     AORB(М13)                ,СМ := AORB(М13)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   3(М10)                   ,СМ := (адрес) - СМ
        УИМ    М13                      ,М13 := СМ + стек
        УИМ    М15                      ,М15 := СМ + стек
        СЛИА   1(М13)                   ,М13 += 1
        УИМ    М11                      ,М11 := СМ + стек
        УИ     М14                      ,М14 := СМ
        СЧ     AORB                     ,СМ := AORB
        СЧМ    AORB(М14)                ,магазин + СЧ: AORB(М14)
        ИЛИ    AORB(М11)                ,СМ |= AORB(М11)
        СЛИА   1(М14)                   ,М14 += 1
        ЗП     AORB(М15)                ,AORB := СМ
        СЛИА   1(М11)                   ,М11 += 1
        ЧЕД    AORB(М17)                ,СМ := кол-во единиц в AORB(М17)
        СЛИА   1(М15)                   ,М15 += 1
        ЦИКЛ   L0024(М13)               ,М13-- и если ≠0 → повтор
        ИЛИ    3(М10)                   ,СМ |= 3(М10)
        ЗПМ    AORB(М16)                ,ЗП + магазин: AORB(М16)
        РЖА    '6'                      ,РЖ := '6'
        МОД    9(М12)                   ,мод.адрес по коду: 9(М12)
        ПБ     AORB                     ,переход на AORB
        МОДА   AORB                     ,мод.адрес +1: AORB

