***************************************************
* BEGPG - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 13792 образа SIPROD.BIN
*   Длина при загрузке: 438 слов, 780 команд
*   Вход: BEGPG
*   Внешние: *NDAB*, *STR*, *COMTIT*, *NUST*, *DYD*, *PUFOR*, *STAND*, 
*   *LYG*, *SEK*, *PUS*, *APJ*, *EGO*, *PAGE*, *REGIM*, FT*571, FT*003, 
*   WTBACK, RASPS, RSYMB, BEGSTR, ENDSTR, RNSYMB, I*DI*I, I*MU*I
*   Смещения в *COMTIT*: 12
*   Смещения в *DYD*: 1, 2
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1, 2, 3
*   Смещения в *NUST*: 1
*   Смещения в *PAGE*: 1, 2, 3, 4, 5
*   Смещения в *PUFOR*: 1, 2, 3, 4, 5, 6
*   Смещения в *REGIM*: 3, 4, 5, 7
*   Смещения в *SEK*: 2, 3
*   Смещения в *STAND*: 1
*   Смещения в *STR*: 24, 25, 26
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
BEGPG   СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0576                    ,переход на L0576
L0002   СЧ     BEGPG(М7)                ,СМ := BEGPG(М7)
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
L0004   ЗП     BEGPG                    ,BEGPG := СМ
L0005   РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
L0010   УИА    L0621(М16)               ,М16 := L0621
L0011   ПВ     I*DI*I(М15)              ,вызов через М15
L0012   ЗП     16(М7)                   ,16 := СМ
L0013   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     BEGPG                    ,СМ := BEGPG
L0015   СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUFOR*                  ,мод.адрес +1: *PUFOR*
        ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUFOR*+1                ,мод.адрес +1: *PUFOR*+1
        ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   *PAGE*+2                 ,мод.адрес +1: *PAGE*+2
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUFOR*+2                ,мод.адрес +1: *PUFOR*+2
        ЗП     BEGPG                    ,BEGPG := СМ
L0034   МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
L0035   СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUFOR*+3                ,мод.адрес +1: *PUFOR*+3
        ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
L0041   СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUFOR*+4                ,мод.адрес +1: *PUFOR*+4
        ЗП     BEGPG                    ,BEGPG := СМ
L0044   МОДА   *PAGE*+5                 ,мод.адрес +1: *PAGE*+5
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUFOR*+5                ,мод.адрес +1: *PUFOR*+5
        ЗП     BEGPG                    ,BEGPG := СМ
L0050   СЧ     12(М7)                   ,СМ := 12(М7)
L0051   ЗП     17(М7)                   ,17 := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        УИА    L0621(М16)               ,М16 := L0621
        ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     18(М7)                   ,18 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
L0063   ВЧОБ   BEGPG                    ,СМ := (адрес) - СМ
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
L0065   СЛ     BEGPG                    ,СМ += BEGPG
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0035                    ,если СМ≠0 → L0035
        ПБ     L0044                    ,переход на L0044
L0071   МОДА   BEGPG                    ,мод.адрес +1: BEGPG
L0072   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     BEGPG                    ,СМ := BEGPG
L0076   НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
L0077   ПО     L0041                    ,если СМ=0 → L0041
        ПБ     L0044                    ,переход на L0044
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
L0103   СЧ     BEGPG                    ,СМ := BEGPG
L0104   МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        ЗП     BEGPG                    ,BEGPG := СМ
        РЖА    '3'                      ,РЖ := '3'
L0107   РЖА    '22'                     ,РЖ := '22'
L0110   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0050                    ,если СМ=0 → L0050
        ПБ     L0051                    ,переход на L0051
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0131                    ,переход на L0131
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        УИА    L0616(М16)               ,М16 := L0616
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     FT*571(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПВ     FT*003(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     BEGPG(М7)                ,СМ := BEGPG(М7)
L0131   ЗП     19(М7)                   ,19 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
        УИА    L0621(М16)               ,М16 := L0621
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПЕ     L0063                    ,если СМ≠0 → L0063
        ПБ     L0065                    ,переход на L0065
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     19(М7)                   ,19 := СМ
L0150   РЖА    '3'                      ,РЖ := '3'
L0151   РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*+3                ,мод.адрес +1: *REGIM*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0071                    ,если СМ=0 → L0071
L0160   ПБ     L0072                    ,переход на L0072
L0161   МОДА   BEGPG                    ,мод.адрес +1: BEGPG
L0162   ПБ     L0072                    ,переход на L0072
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
L0166   МОДА   *REGIM*+5                ,мод.адрес +1: *REGIM*+5
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
L0171   ПО     L0076                    ,если СМ=0 → L0076
        ПБ     L0077                    ,переход на L0077
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0131                    ,переход на L0131
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
L0200   МОДА   *REGIM*+4                ,мод.адрес +1: *REGIM*+4
L0201   СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПЕ     L0103                    ,если СМ≠0 → L0103
L0204   ПБ     L0104                    ,переход на L0104
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0540                    ,переход на L0540
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     BEGPG(М7)                ,СМ := BEGPG(М7)
        СЧИМ                            ,СЧИ + магазин
L0212   СЧ     19(М7)                   ,СМ := 19(М7)
L0213   НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0107                    ,если СМ=0 → L0107
        ПБ     L0110                    ,переход на L0110
        ПБ     L0072                    ,переход на L0072
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
L0221   СЧ     BEGPG                    ,СМ := BEGPG
L0222   РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ВЧ     BEGPG                    ,СМ -= BEGPG
        МОДА   *COMTIT*+14              ,мод.адрес +1: *COMTIT*+14
L0226   ВЧ     BEGPG                    ,СМ -= BEGPG
L0227   УИА    L0621(М16)               ,М16 := L0621
        ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0233   СЛ     BEGPG                    ,СМ += BEGPG
L0234   ЗП     20(М7)                   ,20 := СМ
L0235   УИА    *COMTIT*(М16)            ,М16 := *COMTIT*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0620(М16)               ,М16 := L0620
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0643(М16)               ,М16 := L0643
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0245   УИА    *COMTIT*+14(М16)         ,М16 := *COMTIT*+14
L0246   СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0540                    ,переход на L0540
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0263   СЧ     BEGPG                    ,СМ := BEGPG
L0264   ЗП     21(М7)                   ,21 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     BEGPG                    ,СМ := BEGPG
        ЗП     22(М7)                   ,22 := СМ
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     BEGPG                    ,СМ := BEGPG
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     BEGPG                    ,СМ := BEGPG
L0300   СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
        УИА    L0621(М16)               ,М16 := L0621
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '22'                     ,РЖ := '22'
L0305   НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПЕ     L0150                    ,если СМ≠0 → L0150
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     7(М7)                    ,СМ := 7(М7)
L0311   СЧИМ                            ,СЧИ + магазин
L0312   МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0150                    ,если СМ=0 → L0150
        ПБ     L0151                    ,переход на L0151
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0162                    ,переход на L0162
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0013(М7)                ,СМ += L0013(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     BEGPG                    ,BEGPG := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '22'                     ,РЖ := '22'
L0335   НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0160                    ,если СМ=0 → L0160
        ПБ     L0161                    ,переход на L0161
        ПБ     L0162                    ,переход на L0162
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0213                    ,переход на L0213
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0166                    ,если СМ=0 → L0166
        ПБ     L0171                    ,переход на L0171
L0353   МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     BEGPG(М7)                ,СМ := BEGPG(М7)
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        ЗП     BEGPG                    ,BEGPG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0200                    ,если СМ=0 → L0200
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0200                    ,если СМ=0 → L0200
        ПБ     L0201                    ,переход на L0201
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0213                    ,переход на L0213
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
L0402   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     23(М7)                   ,23 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0212                    ,переход на L0212
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     '4066'(М7)               ,СМ := '4066'(М7)
        МОД    L0646                    ,мод.адрес по коду: L0646
        УИА    BEGPG(М1)                ,М1 := BEGPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
L0414   ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     23(М7)                   ,СМ := 23(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     23(М7)                   ,23 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ВЧОБ   17(М7)                   ,СМ := (адрес) - СМ
L0425   ПО     L0204                    ,если СМ=0 → L0204
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0427   СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUFOR*+6                ,мод.адрес +1: *PUFOR*+6
        ЗП     BEGPG                    ,BEGPG := СМ
L0432   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПЕ     L0221                    ,если СМ≠0 → L0221
        ПБ     L0222                    ,переход на L0222
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0235                    ,переход на L0235
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
L0444   СЧ     BEGPG(М7)                ,СМ := BEGPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
L0451   ПО     L0226                    ,если СМ=0 → L0226
        ПБ     L0227                    ,переход на L0227
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0235                    ,переход на L0235
L0455   МОДА   BEGPG                    ,мод.адрес +1: BEGPG
L0456   СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0233                    ,если СМ=0 → L0233
        ПБ     L0234                    ,переход на L0234
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0235                    ,переход на L0235
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0540                    ,переход на L0540
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0473   СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
L0475   МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЛ     BEGPG                    ,СМ += BEGPG
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        ЗП     BEGPG                    ,BEGPG := СМ
        СЧ     BEGPG(М7)                ,СМ := BEGPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*+7                ,мод.адрес +1: *REGIM*+7
L0505   СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПЕ     L0245                    ,если СМ≠0 → L0245
        ПБ     L0246                    ,переход на L0246
        ПБ     L0451                    ,переход на L0451
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        ЗП     24(М7)                   ,24 := СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     BEGPG                    ,СМ := BEGPG
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     25(М7)                   ,25 := СМ
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     BEGPG                    ,СМ += BEGPG
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        УИА    L0630(М16)               ,М16 := L0630
        ПВ     I*MU*I(М15)              ,вызов через М15
        ЗП     26(М7)                   ,26 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
L0540   СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПЕ     L0263                    ,если СМ≠0 → L0263
L0544   ПБ     L0264                    ,переход на L0264
L0545   МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0300                    ,переход на L0300
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0551   СЧ     BEGPG                    ,СМ := BEGPG
L0552   РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        ВЧ     BEGPG                    ,СМ -= BEGPG
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     24(М7)                   ,24 := СМ
L0557   МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PAGE*+2                 ,мод.адрес +1: *PAGE*+2
        СЛ     BEGPG                    ,СМ += BEGPG
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     BEGPG                    ,СМ += BEGPG
        МОДА   *PAGE*+5                 ,мод.адрес +1: *PAGE*+5
        СЛ     BEGPG                    ,СМ += BEGPG
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        УИА    L0630(М16)               ,М16 := L0630
L0575   ПВ     I*MU*I(М15)              ,вызов через М15
L0576   ЗП     26(М7)                   ,26 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     26(М7)                   ,СМ := 26(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     8(М7)                    ,СМ -= 8(М7)
L0603   ЗП     27(М7)                   ,27 := СМ
        СЧ     24(М7)                   ,СМ := 24(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L0606   ЗП     28(М7)                   ,28 := СМ
L0607   СЧ     1(М7)                    ,СМ := 1(М7)
L0610   ЗП     23(М7)                   ,23 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        СЧ     BEGPG                    ,СМ := BEGPG
L0616   НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
L0617   ПО     L0311                    ,если СМ=0 → L0311
L0620   ПБ     L0312                    ,переход на L0312
L0621   МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0335                    ,переход на L0335
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
L0624   СЧ     23(М7)                   ,СМ := 23(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     13(М7)                   ,13 := СМ
L0630   МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        ЗП     14(М7)                   ,14 := СМ
L0634   СЧ     2(М7)                    ,СМ := 2(М7)
L0635   ВЧ     23(М7)                   ,СМ -= 23(М7)
L0636   ЗП     15(М7)                   ,15 := СМ
        СЧ     26(М7)                   ,СМ := 26(М7)
        УИА    L0634(М16)               ,М16 := L0634
        ПВ     I*MU*I(М15)              ,вызов через М15
        ЗП     13(М7)                   ,13 := СМ
L0643   СЧ     14(М7)                   ,СМ := 14(М7)
        УИА    L0636(М16)               ,М16 := L0636
        ПВ     I*MU*I(М15)              ,вызов через М15
L0646   УИА    L0630(М16)               ,М16 := L0630
        ПВ     I*MU*I(М15)              ,вызов через М15
        СЛ     L0015(М7)                ,СМ += L0015(М7)
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     29(М7)                   ,29 := СМ
L0653   МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
L0654   СЧ     BEGPG                    ,СМ := BEGPG
L0655   СЛ     L0005(М7)                ,СМ += L0005(М7)
        ЗП     13(М7)                   ,13 := СМ
L0657   СЧ     23(М7)                   ,СМ := 23(М7)
L0660   ВЧ     1(М7)                    ,СМ -= 1(М7)
L0661   ЗП     14(М7)                   ,14 := СМ
L0662   СЧ     13(М7)                   ,СМ := 13(М7)
        УИА    L0635(М16)               ,М16 := L0635
L0664   ПВ     I*MU*I(М15)              ,вызов через М15
L0665   МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЛ     L0034(М7)                ,СМ += L0034(М7)
        ЗП     28(М7)                   ,28 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0353                    ,переход на L0353
        СЧ     23(М7)                   ,СМ := 23(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     13(М7)                   ,13 := СМ
        СЧ     26(М7)                   ,СМ := 26(М7)
        УИА    L0634(М16)               ,М16 := L0634
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     29(М7)                   ,29 := СМ
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЛ     BEGPG                    ,СМ += BEGPG
        МОДА   *PAGE*+2                 ,мод.адрес +1: *PAGE*+2
        СЛ     BEGPG                    ,СМ += BEGPG
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     13(М7)                   ,13 := СМ
        СЧ     23(М7)                   ,СМ := 23(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     14(М7)                   ,14 := СМ
        СЧ     13(М7)                   ,СМ := 13(М7)
        УИА    L0635(М16)               ,М16 := L0635
        ПВ     I*MU*I(М15)              ,вызов через М15
        СЛ     L0034(М7)                ,СМ += L0034(М7)
        ЗП     28(М7)                   ,28 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     13(М7)                   ,13 := СМ
        УИА    L0610(М16)               ,М16 := L0610
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0624(М16)               ,М16 := L0624
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L0654                    ,мод.адрес по коду: L0654
        УИА    BEGPG(М1)                ,М1 := BEGPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        УИА    BEGPG(М16)               ,М16 := BEGPG
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0634(М16)               ,М16 := L0634
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     13(М7)                   ,13 := СМ
        УИА    L0610(М16)               ,М16 := L0610
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0624(М16)               ,М16 := L0624
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L0654                    ,мод.адрес по коду: L0654
        УИА    BEGPG(М1)                ,М1 := BEGPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        УИА    BEGPG(М16)               ,М16 := BEGPG
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0634(М16)               ,М16 := L0634
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     24(М7)                   ,СМ := 24(М7)
        ЗП     30(М7)                   ,30 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0414                    ,переход на L0414
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        УИА    L0606(М16)               ,М16 := L0606
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0624(М16)               ,М16 := L0624
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L0654                    ,мод.адрес по коду: L0654
        УИА    BEGPG(М1)                ,М1 := BEGPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        УИА    BEGPG(М16)               ,М16 := BEGPG
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0655(М16)               ,М16 := L0655
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     30(М7)                   ,СМ := 30(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     30(М7)                   ,30 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ВЧОБ   25(М7)                   ,СМ := (адрес) - СМ
        ПО     L0402                    ,если СМ=0 → L0402
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        УИА    L0630(М16)               ,М16 := L0630
        ПВ     I*MU*I(М15)              ,вызов через М15
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     31(М7)                   ,31 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0425                    ,если СМ=0 → L0425
        ПБ     L0427                    ,переход на L0427
        СЧ     10(М7)                   ,СМ := 10(М7)
        ЗП     31(М7)                   ,31 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     31(М7)                   ,СМ := 31(М7)
        ЗП     32(М7)                   ,32 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0444                    ,переход на L0444
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        УИА    L0607(М16)               ,М16 := L0607
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0624(М16)               ,М16 := L0624
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L0657                    ,мод.адрес по коду: L0657
        УИА    BEGPG(М1)                ,М1 := BEGPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        УИА    BEGPG(М16)               ,М16 := BEGPG
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0653(М16)               ,М16 := L0653
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     32(М7)                   ,СМ := 32(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0011(М7)                ,СМ += L0011(М7)
        ЗП     32(М7)                   ,32 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ВЧОБ   27(М7)                   ,СМ := (адрес) - СМ
        ПО     L0432                    ,если СМ=0 → L0432
        СЧ     23(М7)                   ,СМ := 23(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     23(М7)                   ,23 := СМ
        ВЧОБ   2(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0305                    ,если СМ=0 → L0305
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*+4                ,мод.адрес +1: *REGIM*+4
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПЕ     L0455                    ,если СМ≠0 → L0455
        ПБ     L0456                    ,переход на L0456
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0540                    ,переход на L0540
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ВЧ     BEGPG                    ,СМ -= BEGPG
        УИА    L0621(М16)               ,М16 := L0621
        ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        ЗП     17(М7)                   ,17 := СМ
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        УИА    L0630(М16)               ,М16 := L0630
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     33(М7)                   ,33 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0473                    ,если СМ=0 → L0473
        ПБ     L0475                    ,переход на L0475
        СЧ     10(М7)                   ,СМ := 10(М7)
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     5(М7)                    ,СМ := 5(М7)
        ЗП     34(М7)                   ,34 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        УИА    L0621(М16)               ,М16 := L0621
        ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЛ     BEGPG                    ,СМ += BEGPG
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        ЗП     35(М7)                   ,35 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     36(М7)                   ,36 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        УИА    L0606(М16)               ,М16 := L0606
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0661(М16)               ,М16 := L0661
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L0660                    ,мод.адрес по коду: L0660
        УИА    BEGPG(М1)                ,М1 := BEGPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        УИА    BEGPG(М16)               ,М16 := BEGPG
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     35(М7)                   ,СМ := 35(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0004(М7)                ,СМ += L0004(М7)
        ЗП     35(М7)                   ,35 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     36(М7)                   ,СМ := 36(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     36(М7)                   ,36 := СМ
        ВЧОБ   2(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0505                    ,если СМ=0 → L0505
        СЧ     35(М7)                   ,СМ := 35(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     6(М7)                    ,СМ -= 6(М7)
        ЗП     35(М7)                   ,35 := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        ЗП     37(М7)                   ,37 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        ЗП     38(М7)                   ,38 := СМ
        УИА    *NDAB*+1(М16)            ,М16 := *NDAB*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0665(М16)               ,М16 := L0665
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0665(М16)               ,М16 := L0665
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L0660                    ,мод.адрес по коду: L0660
        УИА    BEGPG(М1)                ,М1 := BEGPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        УИА    BEGPG(М16)               ,М16 := BEGPG
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0664(М16)               ,М16 := L0664
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RASPS(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0544                    ,если СМ=0 → L0544
        ПБ     L0545                    ,переход на L0545
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0575                    ,переход на L0575
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     BEGPG                    ,СМ := BEGPG
        НТЖ    BEGPG(М17)               ,СМ ^= BEGPG(М17)
        ПО     L0551                    ,если СМ=0 → L0551
        ПБ     L0552                    ,переход на L0552
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0557                    ,переход на L0557
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     BEGPG                    ,BEGPG := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0575                    ,переход на L0575
        СЧ     21(М7)                   ,СМ := 21(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     BEGPG                    ,BEGPG := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     22(М7)                   ,СМ := 22(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ЗП     BEGPG                    ,BEGPG := СМ
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     BEGPG                    ,СМ := BEGPG
        МОДА   *PUS*                    ,мод.адрес +1: *PUS*
        ЗП     BEGPG                    ,BEGPG := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     WTBACK(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     BEGPG                    ,СМ := BEGPG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     BEGPG                    ,BEGPG := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        ПБ     L0603                    ,переход на L0603
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0617(М7)                ,М7 := L0617
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     BEGPG(М12)               ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     BEGPG(М10)               ,переход через М10
        МОДА   BEGPG                    ,мод.адрес +1: BEGPG

