***************************************************
* ENDPG - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 11680 образа SIPROD.BIN
*   Длина при загрузке: 260 слов, 466 команд
*   Вход: ENDPG
*   Внешние: *EGO*, *PAGE*, *REGIM*, *NDAB*, *LYG*, *DYD*, *TXT*, *STAND*, 
*   *PLN*, *RPT*, *SEK*, *NUST*, FT*571, FT*003, FT*002, NUSTA, NEWMAX, 
*   KLAIDA, TOPAGE, VIAPUZ, I*DI*I, I*MU*I
*   Смещения в *DYD*: 1, 2
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1, 2, 3
*   Смещения в *NUST*: 1, 5, 6, 7, 8, 9
*   Смещения в *PAGE*: 1, 2, 3
*   Смещения в *REGIM*: 9, 10
*   Смещения в *SEK*: 2, 3
*   Смещения в *STAND*: 1, 2, 4
*   Смещения в *TXT*: 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
ENDPG   СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0341                    ,переход на L0341
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '3'                      ,РЖ := '3'
L0005   МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        СЛ     ENDPG                    ,СМ += ENDPG
        ЗП     12(М7)                   ,12 := СМ
L0010   СЧ     4(М7)                    ,СМ := 4(М7)
L0011   СЧИМ                            ,СЧИ + магазин
L0012   МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     ENDPG                    ,СМ := ENDPG
L0014   РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0010                    ,если СМ≠0 → L0010
        ПБ     L0011                    ,переход на L0011
L0020   ПБ     L0022                    ,переход на L0022
L0021   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
L0022   СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*+2                ,мод.адрес +1: *STAND*+2
        СЧ     ENDPG                    ,СМ := ENDPG
L0026   НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
L0027   ПЕ     L0020                    ,если СМ≠0 → L0020
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ47                    ,мод.адрес +1: СИМ47
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0020                    ,если СМ≠0 → L0020
L0036   ПБ     L0021                    ,переход на L0021
L0037   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПВ     VIAPUZ(М15)              ,вызов через М15
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0140                    ,переход на L0140
L0043   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '3'                      ,РЖ := '3'
L0047   ВЧОБ   ENDPG                    ,СМ := (адрес) - СМ
        СЛ     L0014(М7)                ,СМ += L0014(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0026                    ,если СМ=0 → L0026
        ПБ     L0027                    ,переход на L0027
L0054   ПВ     TOPAGE(М15)              ,вызов через М15
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
L0057   СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*+2                ,мод.адрес +1: *STAND*+2
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
L0063   ПЕ     L0036                    ,если СМ≠0 → L0036
L0064   СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ47                    ,мод.адрес +1: СИМ47
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0036                    ,если СМ≠0 → L0036
        ПБ     L0037                    ,переход на L0037
L0073   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПВ     VIAPUZ(М15)              ,вызов через М15
L0075   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     ENDPG                    ,СМ := ENDPG
L0102   НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
L0103   ПО     L0043                    ,если СМ=0 → L0043
        ПБ     L0047                    ,переход на L0047
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
L0107   СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '3'                      ,РЖ := '3'
L0111   СЛ     L0001(М7)                ,СМ += L0001(М7)
L0112   МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     ENDPG                    ,ENDPG := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
L0116   МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
L0117   СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   ENDPG                    ,СМ := (адрес) - СМ
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЛ     ENDPG                    ,СМ += ENDPG
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0054                    ,если СМ≠0 → L0054
        ПБ     L0057                    ,переход на L0057
L0127   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
L0130   МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     ENDPG                    ,СМ := ENDPG
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
L0133   ЗП     ENDPG                    ,ENDPG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
L0140   МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0063                    ,если СМ≠0 → L0063
        ПБ     L0064                    ,переход на L0064
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0140                    ,переход на L0140
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     ENDPG                    ,СМ := ENDPG
        УИА    L0360(М16)               ,М16 := L0360
        ПВ     I*DI*I(М15)              ,вызов через М15
L0154   ЗП     13(М7)                   ,13 := СМ
L0155   РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     ENDPG                    ,СМ := ENDPG
L0162   РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
L0164   ПО     L0073                    ,если СМ=0 → L0073
        ПБ     L0075                    ,переход на L0075
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
L0170   ЗП     ENDPG                    ,ENDPG := СМ
L0171   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     ENDPG                    ,СМ := ENDPG
        СЧИМ                            ,СЧИ + магазин
L0175   СЧ     13(М7)                   ,СМ := 13(М7)
        УИА    L0360(М16)               ,М16 := L0360
        ПВ     I*MU*I(М15)              ,вызов через М15
L0200   НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0102                    ,если СМ≠0 → L0102
        ПБ     L0103                    ,переход на L0103
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0112                    ,переход на L0112
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
L0206   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПО     L0107                    ,если СМ=0 → L0107
        ПБ     L0111                    ,переход на L0111
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
L0220   ЗП     ENDPG                    ,ENDPG := СМ
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0133                    ,переход на L0133
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
L0226   МОДА   *REGIM*+12               ,мод.адрес +1: *REGIM*+12
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0116                    ,если СМ≠0 → L0116
        ПБ     L0117                    ,переход на L0117
L0233   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0247                    ,переход на L0247
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *NUST*+11                ,мод.адрес +1: *NUST*+11
        СЧ     ENDPG                    ,СМ := ENDPG
L0240   УИА    L0360(М16)               ,М16 := L0360
L0241   ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     14(М7)                   ,14 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NUST*+11                ,мод.адрес +1: *NUST*+11
L0245   СЧ     ENDPG                    ,СМ := ENDPG
L0246   СЧИМ                            ,СЧИ + магазин
L0247   СЧ     14(М7)                   ,СМ := 14(М7)
        УИА    L0360(М16)               ,М16 := L0360
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
L0254   ПЕ     L0127                    ,если СМ≠0 → L0127
        ПБ     L0130                    ,переход на L0130
        ПБ     L0247                    ,переход на L0247
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     8(М7)                    ,СМ := 8(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
L0263   СЛ     ENDPG                    ,СМ += ENDPG
L0264   ЗП     15(М7)                   ,15 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     ENDPG                    ,СМ := ENDPG
L0270   РЖА    '3'                      ,РЖ := '3'
L0271   СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     15(М7)                   ,15 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *PAGE*+2                 ,мод.адрес +1: *PAGE*+2
        ЗП     ENDPG                    ,ENDPG := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
L0301   СЧ     ENDPG                    ,СМ := ENDPG
L0302   РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        СЛ     ENDPG                    ,СМ += ENDPG
        МОДА   СИМ57                    ,мод.адрес +1: СИМ57
L0306   СЛ     ENDPG                    ,СМ += ENDPG
        ЗП     16(М7)                   ,16 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
L0311   СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0154                    ,если СМ≠0 → L0154
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
L0322   МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     ENDPG                    ,СМ := ENDPG
L0324   НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПО     L0154                    ,если СМ=0 → L0154
        ПБ     L0155                    ,переход на L0155
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
L0330   ПБ     L0171                    ,переход на L0171
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     ENDPG                    ,СМ := ENDPG
L0334   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
L0337   ЗП     ENDPG                    ,ENDPG := СМ
        ВЧ     3(М7)                    ,СМ -= 3(М7)
L0341   РЖА    '22'                     ,РЖ := '22'
        ПО     L0162                    ,если СМ=0 → L0162
        ПБ     L0164                    ,переход на L0164
        УИА    L0366(М16)               ,М16 := L0366
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0346   ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     ENDPG                    ,СМ := ENDPG
L0352   РЖА    '3'                      ,РЖ := '3'
L0353   ВЧ     1(М7)                    ,СМ -= 1(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0170                    ,если СМ=0 → L0170
L0356   ПБ     L0171                    ,переход на L0171
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
L0360   ПБ     L0247                    ,переход на L0247
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     17(М7)                   ,17 := СМ
L0364   РЖА    '3'                      ,РЖ := '3'
        МОДА   *RPT*                    ,мод.адрес +1: *RPT*
L0366   ВЧ     ENDPG                    ,СМ -= ENDPG
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0175                    ,если СМ≠0 → L0175
        ПБ     L0200                    ,переход на L0200
        МОДА   *RPT*                    ,мод.адрес +1: *RPT*
        СЧ     ENDPG                    ,СМ := ENDPG
        ЗП     17(М7)                   ,17 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        УИА    L0352(М16)               ,М16 := L0352
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     FT*571(М15)              ,вызов через М15
L0403   МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПВ     FT*003(М15)              ,вызов через М15
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     18(М7)                   ,18 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0233                    ,переход на L0233
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     18(М7)                   ,СМ := 18(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        УИА    L0364(М16)               ,М16 := L0364
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     19(М7)                   ,19 := СМ
        СЛ     L0005(М7)                ,СМ += L0005(М7)
        ЗП     20(М7)                   ,20 := СМ
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     FT*571(М15)              ,вызов через М15
        СЧ     19(М7)                   ,СМ := 19(М7)
        ЗП     21(М7)                   ,21 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0226                    ,переход на L0226
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОД    L0403                    ,мод.адрес по коду: L0403
        УИА    ENDPG(М1)                ,М1 := ENDPG
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        УИА    ENDPG(М16)               ,М16 := ENDPG
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     FT*002(М15)              ,вызов через М15
        СЧ     21(М7)                   ,СМ := 21(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     21(М7)                   ,21 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ВЧОБ   20(М7)                   ,СМ := (адрес) - СМ
        ПО     L0220                    ,если СМ=0 → L0220
        ПВ     FT*003(М15)              ,вызов через М15
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     18(М7)                   ,СМ := 18(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     18(М7)                   ,18 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ВЧОБ   16(М7)                   ,СМ := (адрес) - СМ
        ПО     L0206                    ,если СМ=0 → L0206
        СЧ     17(М7)                   ,СМ := 17(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     17(М7)                   ,17 := СМ
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0240                    ,если СМ=0 → L0240
        ПБ     L0241                    ,переход на L0241
        ПБ     L0200                    ,переход на L0200
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПО     L0245                    ,если СМ=0 → L0245
        ПБ     L0246                    ,переход на L0246
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0330                    ,переход на L0330
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0254                    ,переход на L0254
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *PLN*                    ,мод.адрес +1: *PLN*
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *PLN*                    ,мод.адрес +1: *PLN*
        ЗП     ENDPG                    ,ENDPG := СМ
        УИА    L0360(М16)               ,М16 := L0360
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     NEWMAX(М15)              ,вызов через М15
        МОДА   *STAND*+1                ,мод.адрес +1: *STAND*+1
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *STAND*+1                ,мод.адрес +1: *STAND*+1
        ЗП     ENDPG                    ,ENDPG := СМ
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*+1                ,мод.адрес +1: *STAND*+1
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПО     L0263                    ,если СМ=0 → L0263
        ПБ     L0264                    ,переход на L0264
        ПБ     L0302                    ,переход на L0302
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*+11               ,мод.адрес +1: *REGIM*+11
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПО     L0270                    ,если СМ=0 → L0270
        ПБ     L0271                    ,переход на L0271
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0330                    ,переход на L0330
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *NUST*+7                 ,мод.адрес +1: *NUST*+7
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *NUST*+7                 ,мод.адрес +1: *NUST*+7
        ЗП     ENDPG                    ,ENDPG := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     NUSTA(М15)               ,вызов через М15
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+7                 ,мод.адрес +1: *NUST*+7
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0301                    ,если СМ≠0 → L0301
        ПБ     L0302                    ,переход на L0302
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        ПБ     L0330                    ,переход на L0330
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПЕ     L0306                    ,если СМ≠0 → L0306
        ПБ     L0311                    ,переход на L0311
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        ЗП     ENDPG                    ,ENDPG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        ЗП     ENDPG                    ,ENDPG := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     4(М7)                    ,СМ := 4(М7)
        МОДА   *REGIM*+11               ,мод.адрес +1: *REGIM*+11
        ЗП     ENDPG                    ,ENDPG := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        МОДА   *NUST*+5                 ,мод.адрес +1: *NUST*+5
        ЗП     ENDPG                    ,ENDPG := СМ
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     ENDPG                    ,СМ := ENDPG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПО     L0322                    ,если СМ=0 → L0322
        ПБ     L0324                    ,переход на L0324
        СЧ     10(М7)                   ,СМ := 10(М7)
        МОДА   *NUST*+5                 ,мод.адрес +1: *NUST*+5
        ЗП     ENDPG                    ,ENDPG := СМ
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *NUST*+6                 ,мод.адрес +1: *NUST*+6
        ЗП     ENDPG                    ,ENDPG := СМ
        ПВ     NUSTA(М15)               ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+11               ,мод.адрес +1: *REGIM*+11
        ЗП     ENDPG                    ,ENDPG := СМ
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        СЧ     ENDPG(М7)                ,СМ := ENDPG(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*+12               ,мод.адрес +1: *REGIM*+12
        СЧ     ENDPG                    ,СМ := ENDPG
        НТЖ    ENDPG(М17)               ,СМ ^= ENDPG(М17)
        ПО     L0334                    ,если СМ=0 → L0334
        ПБ     L0337                    ,переход на L0337
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG
        МОДА   *NUST*+11                ,мод.адрес +1: *NUST*+11
        СЧ     ENDPG                    ,СМ := ENDPG
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     ENDPG                    ,ENDPG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+12               ,мод.адрес +1: *REGIM*+12
        ЗП     ENDPG                    ,ENDPG := СМ
        ПБ     L0346                    ,переход на L0346
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0356(М7)                ,М7 := L0356
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     ENDPG(М12)               ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     ENDPG(М10)               ,переход через М10
        МОДА   ENDPG                    ,мод.адрес +1: ENDPG

