***************************************************
* ENDTUR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 20256 образа SIPROD.BIN
*   Длина при загрузке: 77 слов, 128 команд
*   Вход: ENDTUR
*   Внешние: *EGO*, *FOR*, *JAU*, FT*571, FT*002, FT*003, I*DI*I, I*MU*I
*   Смещения в *EGO*: 8601
*   Смещения в *FOR*: 1
*   Смещения в *JAU*: 1
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
ENDTUR  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0070                    ,переход на L0070
        МОДА   *FOR*                    ,мод.адрес +1: *FOR*
        СЧ     ENDTUR                   ,СМ := ENDTUR
        ЗП     5(М7)                    ,5 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     ENDTUR(М7)               ,СМ := ENDTUR(М7)
L0007   СЧИМ                            ,СЧИ + магазин
L0010   МОДА   *JAU*+1                  ,мод.адрес +1: *JAU*+1
        СЧ     ENDTUR                   ,СМ := ENDTUR
L0012   РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDTUR(М17)              ,СМ ^= ENDTUR(М17)
        ПЕ     L0007                    ,если СМ≠0 → L0007
        ПБ     L0010                    ,переход на L0010
        ПБ     L0024                    ,переход на L0024
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        МОДА   *FOR*                    ,мод.адрес +1: *FOR*
L0021   СЧ     ENDTUR                   ,СМ := ENDTUR
        УИА    L0102(М16)               ,М16 := L0102
        ПВ     I*DI*I(М15)              ,вызов через М15
L0024   ЗП     5(М7)                    ,5 := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    L0102(М16)               ,М16 := L0102
        ПВ     I*MU*I(М15)              ,вызов через М15
        ЗП     6(М7)                    ,6 := СМ
        МОДА   *FOR*                    ,мод.адрес +1: *FOR*
        СЧ     ENDTUR                   ,СМ := ENDTUR
L0033   СЧИМ                            ,СЧИ + магазин
        СЧ     6(М7)                    ,СМ := 6(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDTUR(М17)              ,СМ ^= ENDTUR(М17)
        ПЕ     L0021                    ,если СМ≠0 → L0021
        ПБ     L0024                    ,переход на L0024
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        СЧ     5(М7)                    ,СМ := 5(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     ENDTUR(М7)               ,СМ += ENDTUR(М7)
        ЗП     5(М7)                    ,5 := СМ
        РЖА    '22'                     ,РЖ := '22'
L0047   МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        МОДА   СИМ14                    ,мод.адрес +1: СИМ14
        СЧ     ENDTUR                   ,СМ := ENDTUR
        РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ15                    ,мод.адрес +1: СИМ15
        СЛ     ENDTUR                   ,СМ += ENDTUR
L0055   МОДА   СИМ16                    ,мод.адрес +1: СИМ16
        СЛ     ENDTUR                   ,СМ += ENDTUR
        УИА    L0103(М16)               ,М16 := L0103
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        ЗП     7(М7)                    ,7 := СМ
        СЧ     ENDTUR(М7)               ,СМ := ENDTUR(М7)
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '22'                     ,РЖ := '22'
L0066   СЧ     8(М7)                    ,СМ := 8(М7)
L0067   РЖА    '3'                      ,РЖ := '3'
L0070   ВЧ     ENDTUR(М7)               ,СМ -= ENDTUR(М7)
        ЗП     4(М7)                    ,4 := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        УИА    L0105(М16)               ,М16 := L0105
        ПВ     I*MU*I(М15)              ,вызов через М15
L0075   МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        СЛ     ENDTUR(М7)               ,СМ += ENDTUR(М7)
        ЗП     9(М7)                    ,9 := СМ
L0100   СЛ     L0007(М7)                ,СМ += L0007(М7)
L0101   ВЧ     ENDTUR(М7)               ,СМ -= ENDTUR(М7)
L0102   ЗП     10(М7)                   ,10 := СМ
L0103   УИА    L0100(М16)               ,М16 := L0100
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0105   РЖА    '22'                     ,РЖ := '22'
        ПВ     FT*571(М15)              ,вызов через М15
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        СЧ     9(М7)                    ,СМ := 9(М7)
        ЗП     11(М7)                   ,11 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0114   ПБ     L0055                    ,переход на L0055
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        МОД    L0114                    ,мод.адрес по коду: L0114
        УИА    ENDTUR(М1)               ,М1 := ENDTUR
        МОДА   СИМ17(М1)                ,мод.адрес +1: СИМ17(М1)
        УИА    ENDTUR(М16)              ,М16 := ENDTUR
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     FT*002(М15)              ,вызов через М15
        СЧ     11(М7)                   ,СМ := 11(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     ENDTUR(М7)               ,СМ += ENDTUR(М7)
        ЗП     11(М7)                   ,11 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        ВЧОБ   10(М7)                   ,СМ := (адрес) - СМ
        ПО     L0047                    ,если СМ=0 → L0047
        ПВ     FT*003(М15)              ,вызов через М15
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        СЧ     8(М7)                    ,СМ := 8(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     ENDTUR(М7)               ,СМ += ENDTUR(М7)
        ЗП     8(М7)                    ,8 := СМ
        СЧ     5(М7)                    ,СМ := 5(М7)
        ВЧ     ENDTUR(М7)               ,СМ -= ENDTUR(М7)
        ЗП     5(М7)                    ,5 := СМ
        СЧ     ENDTUR(М7)               ,СМ := ENDTUR(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     5(М7)                    ,СМ := 5(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ENDTUR(М17)              ,СМ ^= ENDTUR(М17)
        ПО     L0066                    ,если СМ=0 → L0066
        ПБ     L0067                    ,переход на L0067
        ПБ     L0033                    ,переход на L0033
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        ПБ     L0075                    ,переход на L0075
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0101(М7)                ,М7 := L0101
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     ENDTUR(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     ENDTUR(М10)              ,переход через М10
        МОДА   ENDTUR                   ,мод.адрес +1: ENDTUR

