***************************************************
* FILLS - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 15072 образа SIPROD.BIN
*   Длина при загрузке: 20 слов, 34 команд
*   Вход: FILLS
*   Внешние: *STR*,  Ы 2Б0
*   Смещения в *STR*: 24, 25, 26
*   Регистры: М7, М10, М12, М15, М16
***************************************************
FILLS   СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0012                    ,переход на L0012
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     FILLS                    ,СМ := FILLS
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ВЧ     FILLS                    ,СМ -= FILLS
        СЛ     FILLS(М7)                ,СМ += FILLS(М7)
L0010   ЗП     1(М7)                    ,1 := СМ
        УИА    L0022(М16)               ,М16 := L0022
L0012   СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L0023                    ,мод.адрес по коду: L0023
        УИА    FILLS(М16)               ,М16 := FILLS
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
L0017   ПВ      Ы 2Б0(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
L0021   РЖА    '22'                     ,РЖ := '22'
L0022   ПБ     L0017                    ,переход на L0017
L0023   МОДА   FILLS                    ,мод.адрес +1: FILLS
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0021(М7)                ,М7 := L0021
        ЗПМ    2(М7)                    ,ЗП + магазин: 2(М7)
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     FILLS(М12)               ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     FILLS(М10)               ,переход через М10

