***************************************************
* GOSTAS - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 21024 образа SIPROD.BIN
*   Длина при загрузке: 32 слов, 42 команд
*   Вход: GOSTAS
*   Внешние: *LOL*
*   Смещения в *LOL*: 7
*   Регистры: М1, М7, М10, М12, М15, М16
***************************************************
GOSTAS  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0015                    ,переход на L0015
        СЧ     GOSTAS(М7)               ,СМ := GOSTAS(М7)
L0003   ЗП     2(М7)                    ,2 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОД    L0027                    ,мод.адрес по коду: L0027
        УИА    GOSTAS(М1)               ,М1 := GOSTAS
L0010   МОДА   L0027(М1)                ,мод.адрес +1: L0027(М1)
        СЧ     GOSTAS                   ,СМ := GOSTAS
L0012   МОДА   *LOL*+77777(М1)          ,мод.адрес +1: *LOL*+77777(
        ЗП     GOSTAS                   ,GOSTAS := СМ
        МОД    L0027                    ,мод.адрес по коду: L0027
L0015   УИА    GOSTAS(М1)               ,М1 := GOSTAS
        МОДА   L0027(М1)                ,мод.адрес +1: L0027(М1)
        СЧ     GOSTAS                   ,СМ := GOSTAS
        МОДА   *LOL*+7(М1)              ,мод.адрес +1: *LOL*+7(М1)
        ЗП     GOSTAS                   ,GOSTAS := СМ
L0022   СЧ     2(М7)                    ,СМ := 2(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     GOSTAS(М7)               ,СМ += GOSTAS(М7)
L0025   ЗП     2(М7)                    ,2 := СМ
        ВЧОБ   1(М7)                    ,СМ := (адрес) - СМ
L0027   РЖА    '22'                     ,РЖ := '22'
L0030   ПО     L0003                    ,если СМ=0 → L0003
        ПБ     L0022                    ,переход на L0022
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0025(М7)                ,М7 := L0025
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     GOSTAS(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     GOSTAS(М10)              ,переход через М10
        МОДА   GOSTAS                   ,мод.адрес +1: GOSTAS

