***************************************************
* NEWMAX - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 20864 образа SIPROD.BIN
*   Длина при загрузке: 71 слов, 136 команд
*   Вход: NEWMAX
*   Внешние: *LYG*, *NDAB*, *SEK*, *REGIM*
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1, 2
*   Смещения в *SEK*: 2, 3
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
NEWMAX  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0075                    ,переход на L0075
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    L0106                    ,мод.адрес по коду: L0106
L0005   СЧ     NEWMAX                   ,СМ := NEWMAX
L0006   НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     L0005                    ,если СМ=0 → L0005
L0010   ПБ     L0006                    ,переход на L0006
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
L0012   ПБ     L0014                    ,переход на L0014
L0013   МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
L0014   МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     NEWMAX                   ,СМ := NEWMAX
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   NEWMAX                   ,СМ := (адрес) - СМ
L0020   МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
L0021   СЛ     NEWMAX                   ,СМ += NEWMAX
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0013                    ,если СМ=0 → L0013
        ПБ     L0014                    ,переход на L0014
L0025   МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
L0026   ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     NEWMAX                   ,СМ := NEWMAX
L0032   РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ12                    ,мод.адрес +1: СИМ12
        ВЧ     NEWMAX                   ,СМ -= NEWMAX
        РЖА    '22'                     ,РЖ := '22'
L0036   ПЕ     L0020                    ,если СМ≠0 → L0020
L0037   ПБ     L0021                    ,переход на L0021
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   СИМ12                    ,мод.адрес +1: СИМ12
L0043   СЧ     NEWMAX                   ,СМ := NEWMAX
L0044   СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
L0050   ПЕ     L0025                    ,если СМ≠0 → L0025
L0051   ПБ     L0026                    ,переход на L0026
        ПБ     L0062                    ,переход на L0062
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     NEWMAX(М7)               ,СМ := NEWMAX(М7)
L0055   СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
L0061   ПЕ     L0032                    ,если СМ≠0 → L0032
L0062   ПБ     L0037                    ,переход на L0037
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    L0106                    ,мод.адрес по коду: L0106
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
L0071   ПО     L0036                    ,если СМ=0 → L0036
        ПБ     L0037                    ,переход на L0037
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
L0074   ПБ     L0074                    ,переход на L0074
L0075   МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     NEWMAX(М7)               ,СМ := NEWMAX(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     NEWMAX                   ,СМ := NEWMAX
L0102   НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПЕ     L0043                    ,если СМ≠0 → L0043
L0104   ПБ     L0044                    ,переход на L0044
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
L0106   ПБ     L0062                    ,переход на L0062
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     NEWMAX                   ,СМ := NEWMAX
        РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ14                    ,мод.адрес +1: СИМ14
        ВЧ     NEWMAX                   ,СМ -= NEWMAX
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0050                    ,если СМ≠0 → L0050
        ПБ     L0051                    ,переход на L0051
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   СИМ14                    ,мод.адрес +1: СИМ14
        СЧ     NEWMAX                   ,СМ := NEWMAX
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     L0055                    ,если СМ=0 → L0055
        ПБ     L0062                    ,переход на L0062
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    L0106                    ,мод.адрес по коду: L0106
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     L0061                    ,если СМ=0 → L0061
        ПБ     L0062                    ,переход на L0062
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     NEWMAX                   ,СМ := NEWMAX
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        ЗП     NEWMAX                   ,NEWMAX := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    L0106                    ,мод.адрес по коду: L0106
        СЧ     NEWMAX                   ,СМ := NEWMAX
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     L0071                    ,если СМ=0 → L0071
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     NEWMAX(М7)               ,СМ := NEWMAX(М7)
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        ЗП     NEWMAX                   ,NEWMAX := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        ПБ     L0102                    ,переход на L0102
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0104(М7)                ,М7 := L0104
        ЗПМ    2(М7)                    ,ЗП + магазин: 2(М7)
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     NEWMAX(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     NEWMAX(М10)              ,переход через М10

