***************************************************
* NOTA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5920 образа SIPROD.BIN
*   Длина при загрузке: 12 слов, 20 команд
*   Вход: NOTA
*   Регистры: М11, М12, М13, М15
***************************************************
NOTA    СТАРТ  0
        УИ     М11                      ,М11 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     NOTA(М11)                ,СМ := NOTA(М11)
        МОДА   L0012                    ,мод.адрес +1: L0012
        ВЧОБ   NOTA                     ,СМ := (адрес) - СМ
L0005   УИМ    М11                      ,М11 := СМ + стек
        УИМ    М12                      ,М12 := СМ + стек
        УИ     М13                      ,М13 := СМ
        СЛИА   1(М11)                   ,М11 += 1
        МОДА   NOTA                     ,мод.адрес +1: NOTA
L0012   СЧ     NOTA(М13)                ,СМ := NOTA(М13)
L0013   МОДА   L0013                    ,мод.адрес +1: L0013
        НТЖ    NOTA                     ,СМ ^= NOTA
        СЛИА   1(М13)                   ,М13 += 1
        ЗП     NOTA(М12)                ,NOTA := СМ
        СЛИА   1(М12)                   ,М12 += 1
        ЦИКЛ   L0005(М11)               ,М11-- и если ≠0 → повтор
        ЗПМ    NOTA                     ,ЗП + магазин: NOTA
        РЖА    '6'                      ,РЖ := '6'
        ПБ     NOTA(М15)                ,переход через М15

