***************************************************
* PAPRAP - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 9984 образа SIPROD.BIN
*   Длина при загрузке: 581 слов, 976 команд
*   Вход: PAPRAP
*   Внешние: *COMCON*, *EGO*, *INS*, *RUSIS*, *SCANER*, SPAUD, KLAIDA, 
*   RASPS1, KORNET, RMAKR, MASVAL, TXTRED, SYTINT, RSYMB, Б7ЗФ (, RNSYMB, 
*   GETSTR, I*MU*I
*   Смещения в *COMCON*: 19, 20
*   Смещения в *EGO*: 7200, 8600, 8601
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *SCANER*: 1, 2
*   Регистры: М1, М2, М7, М10, М12, М15, М16, М17
***************************************************
PAPRAP  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0737                    ,переход на L0737
L0002   СЧ     1(М7)                    ,СМ := 1(М7)
L0003   ЗП     20(М7)                   ,20 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0005   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     21(М7)                   ,21 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
L0010   ЗП     22(М7)                   ,22 := СМ
L0011   РЖА    '22'                     ,РЖ := '22'
L0012   МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     16(М7)                   ,СМ -= 16(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0011                    ,если СМ=0 → L0011
        ПБ     L0012                    ,переход на L0012
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0703                    ,переход на L0703
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    L1006(М16)               ,М16 := L1006
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GETSTR(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
L0033   СЧ     PAPRAP                   ,СМ := PAPRAP
L0034   ЗП     24(М7)                   ,24 := СМ
L0035   РЖА    '3'                      ,РЖ := '3'
        СЧ     '4033'(М7)               ,СМ := '4033'(М7)
L0037   ЗП     25(М7)                   ,25 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
L0041   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *INS*+31(М16)            ,М16 := *INS*+31
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0044   УИА    L1010(М16)               ,М16 := L1010
L0045   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0760(М16)               ,М16 := L0760
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0050   УИА    L0762(М16)               ,М16 := L0762
L0051   СЧИМ   М16                      ,стек := М16, СМ := М16
L0052   РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
L0054   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *COMCON*+23              ,мод.адрес +1: *COMCON*+23
        СЧ     PAPRAP                   ,СМ := PAPRAP
        СЧИМ                            ,СЧИ + магазин
        СЧ     25(М7)                   ,СМ := 25(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0033                    ,если СМ=0 → L0033
        ПБ     L0034                    ,переход на L0034
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0675                    ,переход на L0675
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     PAPRAP                   ,СМ := PAPRAP
L0072   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0073   ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     Б7ЗФ ((М15)              ,вызов через М15
L0077   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     14(М7)                   ,СМ := 14(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     PAPRAP                   ,СМ := PAPRAP
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0044                    ,если СМ=0 → L0044
        ПБ     L0045                    ,переход на L0045
L0107   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0052                    ,переход на L0052
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
L0114   СЧ     26(М7)                   ,СМ := 26(М7)
L0115   НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0050                    ,если СМ=0 → L0050
        ПБ     L0051                    ,переход на L0051
        ПБ     L0472                    ,переход на L0472
L0121   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0631                    ,переход на L0631
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4033'(М7)               ,СМ := '4033'(М7)
        ЗП     28(М7)                   ,28 := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    L1010(М16)               ,М16 := L1010
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1012(М16)               ,М16 := L1012
L0136   СЧИМ   М16                      ,стек := М16, СМ := М16
L0137   УИА    L1013(М16)               ,М16 := L1013
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0760(М16)               ,М16 := L0760
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0143   РЖА    '22'                     ,РЖ := '22'
L0144   ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
L0147   РЖА    '22'                     ,РЖ := '22'
L0150   СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
L0153   ЗП     29(М7)                   ,29 := СМ
L0154   СЧ     '4035'(М7)               ,СМ := '4035'(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     28(М7)                   ,СМ := 28(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0072                    ,если СМ=0 → L0072
        ПБ     L0073                    ,переход на L0073
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0077                    ,переход на L0077
L0165   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
L0170   СЛ     L0001(М7)                ,СМ += L0001(М7)
L0171   ЗП     27(М7)                   ,27 := СМ
        ВЧОБ   3(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
L0174   ПО     L0054                    ,если СМ=0 → L0054
L0175   ПБ     L0045                    ,переход на L0045
L0176   УИА    L0750(М16)               ,М16 := L0750
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0760(М16)               ,М16 := L0760
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1010(М16)               ,М16 := L1010
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1014(М16)               ,М16 := L1014
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
L0210   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
L0213   ЗП     27(М7)                   ,27 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0216   МОД    L1012                    ,мод.адрес по коду: L1012
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   *COMCON*+77777(М1)       ,мод.адрес +1: *COMCON*+777
        СЧ     PAPRAP                   ,СМ := PAPRAP
        СЧИМ                            ,СЧИ + магазин
        СЧ     25(М7)                   ,СМ := 25(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0114                    ,если СМ=0 → L0114
        ПБ     L0115                    ,переход на L0115
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0121                    ,переход на L0121
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     27(М7)                   ,СМ := 27(М7)
L0233   РЖА    '3'                      ,РЖ := '3'
L0234   СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     27(М7)                   ,27 := СМ
L0236   ВЧОБ   10(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0107                    ,если СМ=0 → L0107
L0241   ПБ     L0045                    ,переход на L0045
L0242   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     29(М7)                   ,29 := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    L1010(М16)               ,М16 := L1010
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1014(М16)               ,М16 := L1014
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1011(М16)               ,М16 := L1011
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
L0255   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     26(М7)                   ,СМ := 26(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     26(М7)                   ,26 := СМ
        СЧ     17(М7)                   ,СМ := 17(М7)
        ЗП     30(М7)                   ,30 := СМ
        СЧ     26(М7)                   ,СМ := 26(М7)
L0267   ВЧ     1(М7)                    ,СМ -= 1(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0136                    ,если СМ≠0 → L0136
        ПБ     L0137                    ,переход на L0137
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0671                    ,переход на L0671
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     26(М7)                   ,СМ := 26(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   PAPRAP                   ,СМ := (адрес) - СМ
        СЛ     L0012(М7)                ,СМ += L0012(М7)
        РЖА    '22'                     ,РЖ := '22'
L0303   ПЕ     L0143                    ,если СМ≠0 → L0143
        ПБ     L0144                    ,переход на L0144
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0671                    ,переход на L0671
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0147                    ,если СМ≠0 → L0147
        ПБ     L0150                    ,переход на L0150
        ПБ     L0165                    ,переход на L0165
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     21(М7)                   ,СМ := 21(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0153                    ,если СМ=0 → L0153
        ПБ     L0154                    ,переход на L0154
        ПБ     L0165                    ,переход на L0165
L0327   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
L0330   МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        УИА    *COMCON*+24(М16)         ,М16 := *COMCON*+24
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        СЧ     '4040'(М7)               ,СМ := '4040'(М7)
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        ЗП     PAPRAP                   ,PAPRAP := СМ
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     22(М7)                   ,СМ := 22(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0170                    ,если СМ≠0 → L0170
        ПБ     L0171                    ,переход на L0171
        ПБ     L0176                    ,переход на L0176
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     20(М7)                   ,СМ := 20(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0174                    ,если СМ≠0 → L0174
        ПБ     L0175                    ,переход на L0175
        ПБ     L0703                    ,переход на L0703
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0236                    ,переход на L0236
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
L0375   СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        УИА    *COMCON*+24(М16)         ,М16 := *COMCON*+24
        ПВ     I*MU*I(М15)              ,вызов через М15
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     20(М7)                   ,СМ := 20(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0213                    ,если СМ≠0 → L0213
        СЧ     1(М7)                    ,СМ := 1(М7)
L0413   СЧИМ                            ,СЧИ + магазин
        СЧ     21(М7)                   ,СМ := 21(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0210                    ,если СМ≠0 → L0210
        ПБ     L0216                    ,переход на L0216
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0213                    ,если СМ=0 → L0213
        ПБ     L0216                    ,переход на L0216
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
L0430   МОДА   *COMCON*+24              ,мод.адрес +1: *COMCON*+24
        ВЧ     PAPRAP                   ,СМ -= PAPRAP
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     31(М7)                   ,СМ := 31(М7)
L0435   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     19(М7)                   ,19 := СМ
        УИА    L0752(М16)               ,М16 := L0752
L0441   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0760(М16)               ,М16 := L0760
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1002(М16)               ,М16 := L1002
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     20(М7)                   ,СМ := 20(М7)
L0463   НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0233                    ,если СМ≠0 → L0233
        ПБ     L0234                    ,переход на L0234
L0466   ПБ     L0703                    ,переход на L0703
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     22(М7)                   ,22 := СМ
L0472   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0241                    ,если СМ≠0 → L0241
        ПБ     L0242                    ,переход на L0242
        ПБ     L0255                    ,переход на L0255
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    L0760(М16)               ,М16 := L0760
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     TXTRED(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    *EGO*+16040(М16)         ,М16 := *EGO*+16040
L0511   СЧИМ   М16                      ,стек := М16, СМ := М16
L0512   УИА    L1001(М16)               ,М16 := L1001
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0750(М16)               ,М16 := L0750
L0515   СЧИМ   М16                      ,стек := М16, СМ := М16
L0516   ПВ     MASVAL(М15)              ,вызов через М15
L0517   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0522   УИА    L1011(М16)               ,М16 := L1011
L0523   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RMAKR(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0005                    ,переход на L0005
L0531   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        УИА    *COMCON*+24(М16)         ,М16 := *COMCON*+24
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        УИА    L1011(М16)               ,М16 := L1011
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RMAKR(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     PAPRAP                   ,СМ := PAPRAP
L0552   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0035(М7)                ,СМ += L0035(М7)
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОД    L1011                    ,мод.адрес по коду: L1011
L0557   ПБ     L0267                    ,переход на L0267
L0560   ПБ     L0303                    ,переход на L0303
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0303                    ,переход на L0303
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0472                    ,переход на L0472
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
L0601   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0435                    ,переход на L0435
L0605   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KORNET(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     24(М7)                   ,СМ -= 24(М7)
        ЗП     31(М7)                   ,31 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
L0631   МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1011                    ,мод.адрес по коду: L1011
        УИА    PAPRAP(М2)               ,М2 := PAPRAP
        МОДА   L1046(М2)                ,мод.адрес +1: L1046(М2)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
L0640   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1016(М16)               ,М16 := L1016
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0643   РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0650   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0327                    ,если СМ=0 → L0327
        ПБ     L0330                    ,переход на L0330
        ПБ     L0375                    ,переход на L0375
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОД    L1011                    ,мод.адрес по коду: L1011
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   L1046(М1)                ,мод.адрес +1: L1046(М1)
L0663   СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0037(М7)                ,СМ += L0037(М7)
        ЗП     24(М7)                   ,24 := СМ
        УИА    L0753(М16)               ,М16 := L0753
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0671   УИА    L0760(М16)               ,М16 := L0760
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М2)               ,М2 := PAPRAP
L0675   МОДА   СИМ41(М2)                ,мод.адрес +1: СИМ41(М2)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0702   УИА    L0762(М16)               ,М16 := L0762
L0703   СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
L0707   РЖА    '22'                     ,РЖ := '22'
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     4(М7)                    ,СМ -= 4(М7)
        ЗП     32(М7)                   ,32 := СМ
        СЧ     24(М7)                   ,СМ := 24(М7)
        СЛ     L0003(М7)                ,СМ += L0003(М7)
L0716   ЗП     19(М7)                   ,19 := СМ
        УИА    L1017(М16)               ,М16 := L1017
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0772(М16)               ,М16 := L0772
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0772(М16)               ,М16 := L0772
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0725   МОД    L1010                    ,мод.адрес по коду: L1010
L0726   УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1002(М16)               ,М16 := L1002
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1020(М16)               ,М16 := L1020
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
L0737   ПВ     RASPS1(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0003(М7)                ,СМ += L0003(М7)
L0745   СЛ     L0041(М7)                ,СМ += L0041(М7)
        ЗП     24(М7)                   ,24 := СМ
        УИА    L0754(М16)               ,М16 := L0754
L0750   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0760(М16)               ,М16 := L0760
L0752   СЧИМ   М16                      ,стек := М16, СМ := М16
L0753   МОД    L1010                    ,мод.адрес по коду: L1010
L0754   УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
L0757   СЧИМ   М16                      ,стек := М16, СМ := М16
L0760   УИА    L1007(М16)               ,М16 := L1007
L0761   СЧИМ   М16                      ,стек := М16, СМ := М16
L0762   УИА    L0761(М16)               ,М16 := L0761
L0763   СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
L0765   ПВ     RNSYMB(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0005                    ,переход на L0005
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
L0772   СЧ     9(М7)                    ,СМ := 9(М7)
L0773   ЗП     21(М7)                   ,21 := СМ
L0774   РЖА    '3'                      ,РЖ := '3'
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        УИА    *COMCON*+24(М16)         ,М16 := *COMCON*+24
        ПВ     I*MU*I(М15)              ,вызов через М15
L1001   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
L1002   СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
L1004   СЧ     '4042'(М7)               ,СМ := '4042'(М7)
        МОД    L1010                    ,мод.адрес по коду: L1010
L1006   УИА    PAPRAP(М1)               ,М1 := PAPRAP
L1007   МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
L1010   ЗП     PAPRAP                   ,PAPRAP := СМ
L1011   МОД    L1011                    ,мод.адрес по коду: L1011
L1012   УИА    PAPRAP(М2)               ,М2 := PAPRAP
L1013   МОДА   L1046(М2)                ,мод.адрес +1: L1046(М2)
L1014   СЧ     PAPRAP                   ,СМ := PAPRAP
L1015   СЛ     L0037(М7)                ,СМ += L0037(М7)
L1016   ВЧ     9(М7)                    ,СМ -= 9(М7)
L1017   ЗП     32(М7)                   ,32 := СМ
L1020   СЧ     5(М7)                    ,СМ := 5(М7)
L1021   ЗП     24(М7)                   ,24 := СМ
L1022   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0430                    ,переход на L0430
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     24(М7)                   ,24 := СМ
        УИА    L0754(М16)               ,М16 := L0754
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0763(М16)               ,М16 := L0763
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
L1046   ПВ     RSYMB(М15)               ,вызов через М15
L1047   МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ВЧОБ   32(М7)                   ,СМ := (адрес) - СМ
        ПО     L0413                    ,если СМ=0 → L0413
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0005                    ,переход на L0005
L1072   УИА    L1007(М16)               ,М16 := L1007
L1073   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KORNET(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     24(М7)                   ,СМ -= 24(М7)
        ЗП     31(М7)                   ,31 := СМ
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        УИА    *COMCON*+24(М16)         ,М16 := *COMCON*+24
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0761(М16)               ,М16 := L0761
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1016(М16)               ,М16 := L1016
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0463                    ,если СМ=0 → L0463
        ПБ     L0466                    ,переход на L0466
        СЧ     31(М7)                   ,СМ := 31(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     31(М7)                   ,31 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0005                    ,переход на L0005
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KORNET(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4033'(М7)               ,СМ := '4033'(М7)
        ЗП     32(М7)                   ,32 := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1017(М16)               ,М16 := L1017
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0760(М16)               ,М16 := L0760
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4035'(М7)               ,СМ := '4035'(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     32(М7)                   ,СМ := 32(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0511                    ,если СМ=0 → L0511
        ПБ     L0512                    ,переход на L0512
        ПБ     L0517                    ,переход на L0517
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     22(М7)                   ,СМ := 22(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0515                    ,если СМ=0 → L0515
        ПБ     L0516                    ,переход на L0516
        ПБ     L0441                    ,переход на L0441
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0631                    ,переход на L0631
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     22(М7)                   ,СМ := 22(М7)
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0522                    ,если СМ≠0 → L0522
        ПБ     L0523                    ,переход на L0523
        ПБ     L0531                    ,переход на L0531
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    L0774(М16)               ,М16 := L0774
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RMAKR(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    L0772(М16)               ,М16 := L0772
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RMAKR(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     3(М7)                    ,СМ := 3(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        УИА    *COMCON*+24(М16)         ,М16 := *COMCON*+24
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        УИА    L0773(М16)               ,М16 := L0773
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RMAKR(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     19(М7)                   ,19 := СМ
        УИА    L1002(М16)               ,М16 := L1002
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     KORNET(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     3(М7)                    ,СМ := 3(М7)
        ЗП     32(М7)                   ,32 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     24(М7)                   ,СМ := 24(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     PAPRAP                   ,PAPRAP := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПВ     Б7ЗФ ((М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     8(М7)                    ,СМ := 8(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     PAPRAP                   ,СМ := PAPRAP
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0557                    ,если СМ=0 → L0557
        ПБ     L0560                    ,переход на L0560
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ПБ     L0601                    ,переход на L0601
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     19(М7)                   ,19 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1002(М16)               ,М16 := L1002
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1017(М16)               ,М16 := L1017
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     32(М7)                   ,СМ := 32(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     32(М7)                   ,32 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     27(М7)                   ,27 := СМ
        ВЧОБ   6(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0552                    ,если СМ=0 → L0552
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     PAPRAP                   ,СМ := PAPRAP
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KORNET(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1010                    ,мод.адрес по коду: L1010
        УИА    PAPRAP(М1)               ,М1 := PAPRAP
        МОДА   СИМ41(М1)                ,мод.адрес +1: СИМ41(М1)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    L1012                    ,мод.адрес по коду: L1012
        УИА    PAPRAP(М2)               ,М2 := PAPRAP
        МОДА   L1072(М2)                ,мод.адрес +1: L1072(М2)
        УИА    PAPRAP(М16)              ,М16 := PAPRAP
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     27(М7)                   ,27 := СМ
        ВЧОБ   3(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0605                    ,если СМ=0 → L0605
        ПБ     L0435                    ,переход на L0435
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        УИА    *COMCON*+24(М16)         ,М16 := *COMCON*+24
        ПВ     I*MU*I(М15)              ,вызов через М15
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0640                    ,если СМ=0 → L0640
        ПБ     L0643                    ,переход на L0643
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     PAPRAP                   ,СМ := PAPRAP
        ЗП     31(М7)                   ,31 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     25(М7)                   ,СМ := 25(М7)
        УИА    L0765(М16)               ,М16 := L0765
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        ЗП     34(М7)                   ,34 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0663                    ,переход на L0663
        СЧ     34(М7)                   ,СМ := 34(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     34(М7)                   ,34 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1012(М16)               ,М16 := L1012
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *EGO*+16040(М16)         ,М16 := *EGO*+16040
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1021(М16)               ,М16 := L1021
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ВЧОБ   PAPRAP                   ,СМ := (адрес) - СМ
        ПО     L0650                    ,если СМ=0 → L0650
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     PAPRAP                   ,СМ := PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0005                    ,переход на L0005
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    L1015(М16)               ,М16 := L1015
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0745                    ,переход на L0745
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     15(М7)                   ,СМ := 15(М7)
        ЗП     20(М7)                   ,20 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПО     L0702                    ,если СМ=0 → L0702
        ПБ     L0703                    ,переход на L0703
        ПБ     L0165                    ,переход на L0165
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
        ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0716                    ,переход на L0716
        УИА    L1022(М16)               ,М16 := L1022
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1022(М16)               ,М16 := L1022
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     SPAUD(М15)               ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        ВЧОБ   PAPRAP                   ,СМ := (адрес) - СМ
        ПО     L0707                    ,если СМ=0 → L0707
        СЧ     PAPRAP(М7)               ,СМ := PAPRAP(М7)
        МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
        ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     20(М7)                   ,СМ := 20(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    PAPRAP(М17)              ,СМ ^= PAPRAP(М17)
        ПЕ     L0725                    ,если СМ≠0 → L0725
        ПБ     L0726                    ,переход на L0726
        ПБ     L0745                    ,переход на L0745
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИА    *EGO*+16040(М16)         ,М16 := *EGO*+16040
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L1001(М16)               ,М16 := L1001
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0750(М16)               ,М16 := L0750
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     MASVAL(М15)              ,вызов через М15
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     PAPRAP(М7)               ,СМ := PAPRAP(М7)
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        ЗП     PAPRAP                   ,PAPRAP := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0005                    ,переход на L0005
        ПБ     L0745                    ,переход на L0745
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0757(М7)                ,М7 := L0757
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М2                       ,стек := М2, СМ := М2
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     PAPRAP(М12)              ,переход через М12
        МОДА   PAPRAP                   ,мод.адрес +1: PAPRAP
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М2                       ,М2 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     PAPRAP(М10)              ,переход через М10

