***************************************************
* RASTXT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 16896 образа SIPROD.BIN
*   Длина при загрузке: 430 слов, 772 команд
*   Вход: RASTXT
*   Внешние: *NRD*, *PUFOR*, *RAI*, *SEK*, *PUS*, *PAP*, *SUT*, *SLY*, 
*   *SCANER*, *DYD*, *PLN*, *LNT*, *STL*, *APJ*, *REGIM*, *LYG*, *ATV*, 
*   *TXT*, *TAB*, *STR*, *NUST*, *NDAB*, *NDABL*, *EGO*, *PAGE*, *INS*, 
*   ENDPG, BEGPG, SEKLYG, LYGPAR, NEWMAX, SEKDYD, SEKGIR, BEGSTR, ENDSTR, 
*   SPAUD, KOKSEK, WTBACK, KLAIDA, RSYMB, I*DI*I, I*MU*I
*   Смещения в *ATV*: 1
*   Смещения в *DYD*: 1, 2
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1, 2
*   Смещения в *NDABL*: 1
*   Смещения в *NRD*: 24
*   Смещения в *NUST*: 1, 8
*   Смещения в *PAGE*: 1
*   Смещения в *PUFOR*: 6
*   Смещения в *RAI*: 1
*   Смещения в *SCANER*: 1, 2
*   Смещения в *SEK*: 2
*   Смещения в *SLY*: 1
*   Смещения в *STL*: 1
*   Смещения в *STR*: 24, 25, 26
*   Смещения в *SUT*: 1
*   Смещения в *TAB*: 1, 2, 3, 4
*   Смещения в *TXT*: 1, 2, 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
RASTXT  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0572                    ,переход на L0572
L0002   СЧ     6(М7)                    ,СМ := 6(М7)
L0003   СЧИМ                            ,СЧИ + магазин
        МОДА   *TAB*+4                  ,мод.адрес +1: *TAB*+4
L0005   СЧ     RASTXT                   ,СМ := RASTXT
L0006   НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0005                    ,если СМ=0 → L0005
L0010   ПБ     L0006                    ,переход на L0006
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0012   ПБ     L0114                    ,переход на L0114
L0013   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0014   СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     11(М7)                   ,11 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     12(М7)                   ,12 := СМ
        УИА    *NRD*(М16)               ,М16 := *NRD*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *TAB*+1(М16)             ,М16 := *TAB*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0616(М16)               ,М16 := L0616
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0032   УИА    L0610(М16)               ,М16 := L0610
L0033   СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    *NRD*(М16)               ,М16 := *NRD*
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0042   УИА    *TAB*+2(М16)             ,М16 := *TAB*+2
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0044   УИА    L0617(М16)               ,М16 := L0617
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0610(М16)               ,М16 := L0610
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
L0056   МОДА   *LNT*                    ,мод.адрес +1: *LNT*
L0057   СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0032                    ,если СМ≠0 → L0032
        ПБ     L0033                    ,переход на L0033
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0044                    ,переход на L0044
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     11(М7)                   ,СМ := 11(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        ЗП     11(М7)                   ,11 := СМ
        СЧ     12(М7)                   ,СМ := 12(М7)
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        ЗП     12(М7)                   ,12 := СМ
        СЧ     11(М7)                   ,СМ := 11(М7)
L0076   ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        СЛ     L0014(М7)                ,СМ += L0014(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0042                    ,если СМ≠0 → L0042
        ПБ     L0044                    ,переход на L0044
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        УИА    L0612(М16)               ,М16 := L0612
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
L0114   ВЧ     RASTXT                   ,СМ -= RASTXT
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     13(М7)                   ,13 := СМ
        СЧ     12(М7)                   ,СМ := 12(М7)
L0120   ВЧ     11(М7)                   ,СМ -= 11(М7)
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     14(М7)                   ,14 := СМ
        СЧ     6(М7)                    ,СМ := 6(М7)
L0124   СЧИМ                            ,СЧИ + магазин
L0125   МОДА   *PAP*                    ,мод.адрес +1: *PAP*
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
L0131   ПО     L0056                    ,если СМ=0 → L0056
L0132   ПБ     L0057                    ,переход на L0057
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0076                    ,переход на L0076
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0136   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
L0137   СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NDABL*+1                ,мод.адрес +1: *NDABL*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NDABL*                  ,мод.адрес +1: *NDABL*
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *STL*                    ,мод.адрес +1: *STL*
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *STL*+1                  ,мод.адрес +1: *STL*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
L0166   МОДА   *DYD*                    ,мод.адрес +1: *DYD*
L0167   ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *PAP*                    ,мод.адрес +1: *PAP*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '22'                     ,РЖ := '22'
L0174   МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0013(М7)                ,СМ += L0013(М7)
L0200   МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0201   ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     RASTXT                   ,СМ := RASTXT
        СЛ     L0014(М7)                ,СМ += L0014(М7)
L0205   МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
L0206   ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     RASTXT                   ,СМ := RASTXT
L0211   МОДА   *PUS*                    ,мод.адрес +1: *PUS*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     WTBACK(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ЗП     RASTXT                   ,RASTXT := СМ
L0222   РЖА    '3'                      ,РЖ := '3'
L0223   МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *RAI*+1                  ,мод.адрес +1: *RAI*+1
L0226   ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '22'                     ,РЖ := '22'
L0230   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
        СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0120                    ,если СМ=0 → L0120
        ПБ     L0125                    ,переход на L0125
L0237   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0240   СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     RASTXT                   ,СМ := RASTXT
L0244   НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
L0245   ПЕ     L0124                    ,если СМ≠0 → L0124
        ПБ     L0125                    ,переход на L0125
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0276                    ,переход на L0276
L0251   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0252   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
        СЧ     RASTXT                   ,СМ := RASTXT
L0256   НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0131                    ,если СМ=0 → L0131
        ПБ     L0132                    ,переход на L0132
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0167                    ,переход на L0167
L0263   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
L0266   МОДА   *TAB*+4                  ,мод.адрес +1: *TAB*+4
        СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0136                    ,если СМ≠0 → L0136
        ПБ     L0137                    ,переход на L0137
L0273   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     KOKSEK(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0276   МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     RASTXT                   ,СМ := RASTXT
        ЗП     15(М7)                   ,15 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0302   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0303   СЧ     RASTXT                   ,СМ := RASTXT
        ЗП     16(М7)                   ,16 := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     RASTXT                   ,СМ := RASTXT
L0307   ЗП     17(М7)                   ,17 := СМ
L0310   МОДА   *TXT*+1                  ,мод.адрес +1: *TXT*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *TXT*+2                  ,мод.адрес +1: *TXT*+2
        СЧ     RASTXT                   ,СМ := RASTXT
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0320   ЗП     RASTXT                   ,RASTXT := СМ
        УИА    L0640(М16)               ,М16 := L0640
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0625(М16)               ,М16 := L0625
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0325   РЖА    '22'                     ,РЖ := '22'
L0326   ПВ     SPAUD(М15)               ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     15(М7)                   ,СМ := 15(М7)
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     16(М7)                   ,СМ := 16(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ЗП     RASTXT                   ,RASTXT := СМ
L0341   СЧ     17(М7)                   ,СМ := 17(М7)
L0342   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0343   ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '22'                     ,РЖ := '22'
L0351   НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0166                    ,если СМ≠0 → L0166
        ПБ     L0167                    ,переход на L0167
L0354   ПБ     L0167                    ,переход на L0167
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЛ     RASTXT                   ,СМ += RASTXT
        РЖА    '22'                     ,РЖ := '22'
L0365   ПО     L0174                    ,если СМ=0 → L0174
        ПБ     L0201                    ,переход на L0201
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0370   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0200                    ,если СМ≠0 → L0200
        ПБ     L0201                    ,переход на L0201
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0240                    ,переход на L0240
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     RASTXT                   ,СМ := RASTXT
L0404   СЧИМ                            ,СЧИ + магазин
L0405   МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
L0406   СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
L0410   ПО     L0205                    ,если СМ=0 → L0205
        ПБ     L0206                    ,переход на L0206
        ПБ     L0240                    ,переход на L0240
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     RASTXT                   ,СМ := RASTXT
        ЗП     19(М7)                   ,19 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0226                    ,переход на L0226
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0626(М16)               ,М16 := L0626
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0602(М16)               ,М16 := L0602
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0430   УИА    L0610(М16)               ,М16 := L0610
L0431   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '4113'(М7)               ,СМ := '4113'(М7)
L0441   НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
L0442   ПЕ     L0222                    ,если СМ≠0 → L0222
        ПБ     L0223                    ,переход на L0223
        ПБ     L0230                    ,переход на L0230
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0446   СЧ     19(М7)                   ,СМ := 19(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     19(М7)                   ,19 := СМ
        РЖА    '22'                     ,РЖ := '22'
L0453   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0454   МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        ПО     L0211                    ,если СМ=0 → L0211
        ПБ     L0240                    ,переход на L0240
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
L0461   СЧ     RASTXT                   ,СМ := RASTXT
L0462   ЗП     20(М7)                   ,20 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        СЧ     20(М7)                   ,СМ := 20(М7)
        СЧИМ                            ,СЧИ + магазин
L0470   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
L0471   СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0237                    ,если СМ=0 → L0237
        ПБ     L0240                    ,переход на L0240
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
L0505   ПЕ     L0244                    ,если СМ≠0 → L0244
L0506   ПБ     L0245                    ,переход на L0245
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0510   ПБ     L0256                    ,переход на L0256
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0251                    ,если СМ=0 → L0251
        ПБ     L0252                    ,переход на L0252
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     SEKGIR(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     SEKDYD(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0526   УИА    L0605(М16)               ,М16 := L0605
L0527   СЧИМ   М16                      ,стек := М16, СМ := М16
L0530   ПВ     NEWMAX(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     LYGPAR(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        СЛ     RASTXT                   ,СМ += RASTXT
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0263                    ,если СМ≠0 → L0263
L0544   ПБ     L0266                    ,переход на L0266
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЛ     RASTXT                   ,СМ += RASTXT
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0273                    ,если СМ≠0 → L0273
        ПБ     L0276                    ,переход на L0276
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
L0571   ЗП     RASTXT                   ,RASTXT := СМ
L0572   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
L0577   СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0302                    ,если СМ=0 → L0302
L0602   ПБ     L0303                    ,переход на L0303
L0603   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0326                    ,переход на L0326
L0605   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0606   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
L0610   МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        СЧ     RASTXT                   ,СМ := RASTXT
L0612   НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0307                    ,если СМ≠0 → L0307
        ПБ     L0310                    ,переход на L0310
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0616   ПБ     L0365                    ,переход на L0365
L0617   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЛ     RASTXT                   ,СМ += RASTXT
L0625   МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
L0626   ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *ATV*+1                  ,мод.адрес +1: *ATV*+1
L0632   СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0320                    ,если СМ≠0 → L0320
L0636   ПБ     L0326                    ,переход на L0326
L0637   МОДА   RASTXT                   ,мод.адрес +1: RASTXT
L0640   МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЛ     RASTXT                   ,СМ += RASTXT
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0325                    ,если СМ≠0 → L0325
        ПБ     L0326                    ,переход на L0326
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0343                    ,переход на L0343
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     SEKLYG(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+4                  ,мод.адрес +1: *TAB*+4
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0341                    ,если СМ=0 → L0341
        ПБ     L0342                    ,переход на L0342
        ПБ     L0370                    ,переход на L0370
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0571                    ,переход на L0571
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+4                  ,мод.адрес +1: *TAB*+4
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     RASTXT                   ,СМ := RASTXT
        ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0351                    ,если СМ=0 → L0351
        ПБ     L0354                    ,переход на L0354
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ВЧ     RASTXT                   ,СМ -= RASTXT
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ВЧ     RASTXT                   ,СМ -= RASTXT
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0571                    ,переход на L0571
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *TAB*+4                  ,мод.адрес +1: *TAB*+4
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0571                    ,переход на L0571
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     21(М7)                   ,21 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     22(М7)                   ,22 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ115                   ,мод.адрес +1: СИМ115
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0404                    ,если СМ=0 → L0404
        ПБ     L0405                    ,переход на L0405
        ПБ     L0530                    ,переход на L0530
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0471                    ,переход на L0471
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     23(М7)                   ,23 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОД    L0632                    ,мод.адрес по коду: L0632
        УИА    RASTXT(М1)               ,М1 := RASTXT
        МОДА   СИМ116(М1)               ,мод.адрес +1: СИМ116(М1)
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     23(М7)                   ,СМ := 23(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     23(М7)                   ,23 := СМ
        ВЧОБ   8(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0410                    ,если СМ=0 → L0410
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *NDABL*+1                ,мод.адрес +1: *NDABL*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0430                    ,если СМ≠0 → L0430
        ПБ     L0431                    ,переход на L0431
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0446                    ,переход на L0446
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *NDABL*+1                ,мод.адрес +1: *NDABL*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        УИА    L0606(М16)               ,М16 := L0606
        ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDABL*+1                ,мод.адрес +1: *NDABL*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        СЧИМ                            ,СЧИ + магазин
        СЧ     25(М7)                   ,СМ := 25(М7)
        УИА    L0606(М16)               ,М16 := L0606
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0441                    ,если СМ=0 → L0441
        ПБ     L0442                    ,переход на L0442
        ПБ     L0446                    ,переход на L0446
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *NDABL*+1                ,мод.адрес +1: *NDABL*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0453                    ,если СМ≠0 → L0453
        ПБ     L0454                    ,переход на L0454
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0462                    ,переход на L0462
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     24(М7)                   ,24 := СМ
        СЧ     24(М7)                   ,СМ := 24(М7)
        ВЧОБ   RASTXT                   ,СМ := (адрес) - СМ
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0461                    ,если СМ=0 → L0461
        ПБ     L0462                    ,переход на L0462
        ПБ     L0446                    ,переход на L0446
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ115                   ,мод.адрес +1: СИМ115
        СЧ     RASTXT                   ,СМ := RASTXT
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0470                    ,если СМ=0 → L0470
        ПБ     L0471                    ,переход на L0471
        ПБ     L0530                    ,переход на L0530
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   СИМ115                   ,мод.адрес +1: СИМ115
        СЧ     RASTXT                   ,СМ := RASTXT
        ЗП     26(М7)                   ,26 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ115                   ,мод.адрес +1: СИМ115
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     26(М7)                   ,СМ := 26(М7)
        МОДА   СИМ115                   ,мод.адрес +1: СИМ115
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     22(М7)                   ,СМ := 22(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     22(М7)                   ,22 := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     22(М7)                   ,СМ := 22(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПО     L0505                    ,если СМ=0 → L0505
        ПБ     L0506                    ,переход на L0506
        ПБ     L0406                    ,переход на L0406
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОД    L0636                    ,мод.адрес по коду: L0636
        УИА    RASTXT(М1)               ,М1 := RASTXT
        МОДА   СИМ122(М1)               ,мод.адрес +1: СИМ122(М1)
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     27(М7)                   ,СМ := 27(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     27(М7)                   ,27 := СМ
        ВЧОБ   8(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0510                    ,если СМ=0 → L0510
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     RASTXT                   ,СМ := RASTXT
        НТЖ    RASTXT(М17)              ,СМ ^= RASTXT(М17)
        ПЕ     L0526                    ,если СМ≠0 → L0526
        ПБ     L0527                    ,переход на L0527
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПБ     L0530                    ,переход на L0530
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *NDABL*+1                ,мод.адрес +1: *NDABL*+1
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЛ     RASTXT                   ,СМ += RASTXT
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     28(М7)                   ,28 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L0637                    ,мод.адрес по коду: L0637
        УИА    RASTXT(М1)               ,М1 := RASTXT
        МОДА   СИМ123(М1)               ,мод.адрес +1: СИМ123(М1)
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L0637                    ,мод.адрес по коду: L0637
        УИА    RASTXT(М1)               ,М1 := RASTXT
        МОДА   *SEK*+77777(М1)          ,мод.адрес +1: *SEK*+77777(
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     28(М7)                   ,СМ := 28(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     28(М7)                   ,28 := СМ
        ВЧОБ   4(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0544                    ,если СМ=0 → L0544
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *PAP*                    ,мод.адрес +1: *PAP*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     RASTXT(М7)               ,СМ := RASTXT(М7)
        МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     RASTXT(М7)               ,СМ := RASTXT(М7)
        МОДА   *SUT*+1                  ,мод.адрес +1: *SUT*+1
        ЗП     RASTXT                   ,RASTXT := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     RASTXT                   ,СМ := RASTXT
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ЗП     RASTXT                   ,RASTXT := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *PLN*                    ,мод.адрес +1: *PLN*
        ЗП     RASTXT                   ,RASTXT := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     RASTXT                   ,СМ := RASTXT
        МОДА   *PUFOR*+6                ,мод.адрес +1: *PUFOR*+6
        ЗП     RASTXT                   ,RASTXT := СМ
        ПБ     L0577                    ,переход на L0577
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0603(М7)                ,М7 := L0603
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     RASTXT(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     RASTXT(М10)              ,переход через М10
        МОДА   RASTXT                   ,мод.адрес +1: RASTXT

