***************************************************
* RWBIT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 6016 образа SIPROD.BIN
*   Длина при загрузке: 15 слов, 24 команд
*   Вход: RWBIT
*   Регистры: М10, М11, М12, М13, М14, М15, М17
***************************************************
RWBIT   СТАРТ  0
        УИМ    М13                      ,М13 := СМ + стек
        УИА    L0014(М10)               ,М10 := L0014
        УИМ    М14                      ,М14 := СМ + стек
        УИМ    М12                      ,М12 := СМ + стек
        УИ     М11                      ,М11 := СМ
        СЧ     RWBIT(М11)               ,СМ := RWBIT(М11)
        СЧМ    RWBIT(М12)               ,магазин + СЧ: RWBIT(М12)
        УИМ    М12                      ,М12 := СМ + стек
        РЖА    '3'                      ,РЖ := '3'
        СДА    64-1(М12)                ,сдвиг СМ влево на 1(М1
        И      1(М10)                   ,СМ &= 1(М10)
        СЧМ    RWBIT(М13)               ,магазин + СЧ: RWBIT(М13)
L0014   ВЧОБ   RWBIT(М10)               ,СМ := (адрес) - СМ
        УИМ    М13                      ,М13 := СМ + стек
        СДА    64(М13)                  ,сдвиг СМ на 64(М13)
        СЧМ    1(М10)                   ,магазин + СЧ: 1(М10)
        СДА    64(М13)                  ,сдвиг СМ на 64(М13)
        НТЖ    2(М10)                   ,СМ ^= 2(М10)
        СЧМ    RWBIT(М14)               ,магазин + СЧ: RWBIT(М14)
        И      RWBIT(М17)               ,СМ &= RWBIT(М17)
        ИЛИ    RWBIT(М17)               ,СМ |= RWBIT(М17)
        ЗПМ    RWBIT(М14)               ,ЗП + магазин: RWBIT(М14)
        РЖА    '6'                      ,РЖ := '6'
        ПБ     RWBIT(М15)               ,переход через М15

