***************************************************
* SCHEMA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 10848 образа SIPROD.BIN
*   Длина при загрузке: 521 слов, 860 команд
*   Вход: SCHEMA
*   Внешние: *BLO*, *RUSIS*, *INS*, *NUSTA*, *EGO*, *NDAB*, *TXT*, *PAGE*, 
*   *STR*, *STAND*, *STANN*, *STV*, *MKR*, *SCANER*, *NUST*, *REGIM*, 
*   *FOP*, *RPT*, *GOT*, *FIN*, SPAUD, REDTXT, LOADGO, ENDKOR, WRIKOR, 
*   ENDPG, TOPAGE, GOSTAS, SYTINT, KLAIDA, RNSYMB,      Ы Ц, GETSTR, START, 
*   I*DI*I
*   Смещения в *EGO*: 7200, 8600, 8601
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *MKR*: 500, 501
*   Смещения в *NDAB*: 1, 2
*   Смещения в *PAGE*: 3, 4
*   Смещения в *REGIM*: 8, 9
*   Смещения в *SCANER*: 1, 2
*   Смещения в *STAND*: 1
*   Смещения в *STR*: 24
*   Смещения в *TXT*: 3
*   Регистры: М1, М2, М7, М10, М12, М15, М16, М17
***************************************************
SCHEMA  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0645                    ,переход на L0645
L0002   СЧ     1(М7)                    ,СМ := 1(М7)
L0003   ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L0712                    ,мод.адрес по коду: L0712
L0010   УИА    SCHEMA(М1)               ,М1 := SCHEMA
L0011   МОДА   *REGIM*+77777(М1)        ,мод.адрес +1: *REGIM*+7777
L0012   ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
L0015   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   13(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0003                    ,если СМ=0 → L0003
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     26(М7)                   ,26 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        МОД    L0713                    ,мод.адрес по коду: L0713
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   *INS*+77777(М1)          ,мод.адрес +1: *INS*+77777(
        ЗП     SCHEMA                   ,SCHEMA := СМ
L0037   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     26(М7)                   ,СМ := 26(М7)
L0041   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     26(М7)                   ,26 := СМ
        ВЧОБ   15(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0015                    ,если СМ=0 → L0015
L0047   СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
L0050   МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *RPT*                    ,мод.адрес +1: *RPT*
L0055   ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        ЗП     27(М7)                   ,27 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0062   ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
L0067   МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
L0070   ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     START(М15)               ,вызов через М15
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        ЗП     28(М7)                   ,28 := СМ
L0106   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ВЧ     SCHEMA                   ,СМ -= SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0047                    ,если СМ≠0 → L0047
        ПБ     L0050                    ,переход на L0050
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0116   ПБ     L0055                    ,переход на L0055
L0117   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L0725(М16)               ,М16 := L0725
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GETSTR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0124   МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ          Ы Ц(М15)            ,вызов через М15
L0133   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0134   СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0062                    ,если СМ=0 → L0062
L0142   ПБ     L0070                    ,переход на L0070
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0146   РЖА    '3'                      ,РЖ := '3'
L0147   ВЧОБ   SCHEMA                   ,СМ := (адрес) - СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0151   СЛ     SCHEMA                   ,СМ += SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0067                    ,если СМ=0 → L0067
        ПБ     L0070                    ,переход на L0070
L0155   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0156   ПБ     L0055                    ,переход на L0055
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        ЗП     29(М7)                   ,29 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0163   СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
L0164   МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0170   ВЧ     1(М7)                    ,СМ -= 1(М7)
L0171   ЗП     24(М7)                   ,24 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0711(М16)               ,М16 := L0711
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0716(М16)               ,М16 := L0716
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0664(М16)               ,М16 := L0664
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
L0206   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0210   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
L0215   СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОД    L0712                    ,мод.адрес по коду: L0712
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
L0224   МОДА   L0772(М1)                ,мод.адрес +1: L0772(М1)
        СЧ     SCHEMA                   ,СМ := SCHEMA
        СЧИМ                            ,СЧИ + магазин
        СЧ     29(М7)                   ,СМ := 29(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0116                    ,если СМ=0 → L0116
L0233   ПБ     L0117                    ,переход на L0117
L0234   ПБ     L0124                    ,переход на L0124
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
L0240   СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   7(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
L0244   ПО     L0106                    ,если СМ=0 → L0106
        УИА    L0702(М16)               ,М16 := L0702
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0247   ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
L0256   СЧ     7(М7)                    ,СМ := 7(М7)
L0257   СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
L0263   НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
L0264   ПЕ     L0133                    ,если СМ≠0 → L0133
        ПБ     L0134                    ,переход на L0134
        ПБ     L0142                    ,переход на L0142
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *STANN*                  ,мод.адрес +1: *STANN*
L0272   ЗП     SCHEMA                   ,SCHEMA := СМ
L0273   РЖА    '3'                      ,РЖ := '3'
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
L0301   РЖА    '22'                     ,РЖ := '22'
        ПБ     L0037                    ,переход на L0037
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     6(М7)                    ,СМ := 6(М7)
L0305   СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0146                    ,если СМ≠0 → L0146
L0312   ПБ     L0147                    ,переход на L0147
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0224                    ,переход на L0224
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        ЗП     30(М7)                   ,30 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0321   РЖА    '22'                     ,РЖ := '22'
L0322   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0326   ВЧ     SCHEMA                   ,СМ -= SCHEMA
L0327   РЖА    '22'                     ,РЖ := '22'
        ПО     L0155                    ,если СМ=0 → L0155
        ПБ     L0156                    ,переход на L0156
        ПБ     L0215                    ,переход на L0215
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ          Ы Ц(М15)            ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0336   СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
L0340   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0163                    ,если СМ=0 → L0163
        ПБ     L0164                    ,переход на L0164
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0151                    ,переход на L0151
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     14(М7)                   ,СМ := 14(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L0353   СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0170                    ,если СМ≠0 → L0170
        ПБ     L0171                    ,переход на L0171
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0215                    ,переход на L0215
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L0366   ЗП     31(М7)                   ,31 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0720(М16)               ,М16 := L0720
L0372   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0714(М16)               ,М16 := L0714
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
L0376   ПВ     SYTINT(М15)              ,вызов через М15
L0377   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     31(М7)                   ,СМ := 31(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
L0405   РЖА    '3'                      ,РЖ := '3'
L0406   СЧ     27(М7)                   ,СМ := 27(М7)
        ВЧОБ   SCHEMA                   ,СМ := (адрес) - СМ
        СЛ     L0011(М7)                ,СМ += L0011(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0206                    ,если СМ≠0 → L0206
        ПБ     L0210                    ,переход на L0210
        СЧ     9(М7)                    ,СМ := 9(М7)
        ЗП     27(М7)                   ,27 := СМ
L0416   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     27(М7)                   ,СМ := 27(М7)
        МОДА   *RPT*                    ,мод.адрес +1: *RPT*
L0422   ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0426   СЛ     L0001(М7)                ,СМ += L0001(М7)
L0427   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L0436   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0437   ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0037                    ,переход на L0037
L0447   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0454   НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0233                    ,если СМ≠0 → L0233
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0233                    ,если СМ=0 → L0233
        ПБ     L0234                    ,переход на L0234
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0240                    ,переход на L0240
L0467   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     GOSTAS(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
L0476   РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0504   НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0244                    ,если СМ=0 → L0244
        ПБ     L0247                    ,переход на L0247
L0507   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
L0512   ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0516   СЧ     3(М7)                    ,СМ := 3(М7)
L0517   СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0256                    ,если СМ=0 → L0256
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0256                    ,если СМ=0 → L0256
        ПБ     L0257                    ,переход на L0257
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0534   ПБ     L0467                    ,переход на L0467
L0535   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
L0540   МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0263                    ,если СМ≠0 → L0263
        ПБ     L0264                    ,переход на L0264
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0301                    ,переход на L0301
L0547   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
L0551   СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     SCHEMA                   ,СМ += SCHEMA
        ЗП     32(М7)                   ,32 := СМ
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        ВЧ     32(М7)                   ,СМ -= 32(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0272                    ,если СМ≠0 → L0272
        ПБ     L0273                    ,переход на L0273
        ПВ     TOPAGE(М15)              ,вызов через М15
L0565   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDPG(М15)               ,вызов через М15
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     SCHEMA                   ,SCHEMA := СМ
L0577   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0602   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0305                    ,если СМ=0 → L0305
        ПБ     L0312                    ,переход на L0312
L0611   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0612   УИА    L0660(М16)               ,М16 := L0660
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0614   УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0666(М16)               ,М16 := L0666
L0617   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0321                    ,если СМ=0 → L0321
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
L0634   МОДА   *BLO*                    ,мод.адрес +1: *BLO*
L0635   СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0321                    ,если СМ=0 → L0321
L0640   ПБ     L0322                    ,переход на L0322
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0366                    ,переход на L0366
L0643   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0644   СЧ     1(М7)                    ,СМ := 1(М7)
L0645   СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0326                    ,если СМ=0 → L0326
        ПБ     L0327                    ,переход на L0327
L0653   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0467                    ,переход на L0467
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0656   СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
L0657   МОДА   *STAND*                  ,мод.адрес +1: *STAND*
L0660   ЗП     SCHEMA                   ,SCHEMA := СМ
L0661   РЖА    '3'                      ,РЖ := '3'
L0662   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     33(М7)                   ,33 := СМ
L0664   СЧ     9(М7)                    ,СМ := 9(М7)
L0665   СЧИМ                            ,СЧИ + магазин
L0666   МОДА   *STANN*                  ,мод.адрес +1: *STANN*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
L0671   НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0336                    ,если СМ=0 → L0336
L0673   ПБ     L0340                    ,переход на L0340
L0674   СЧ     12(М7)                   ,СМ := 12(М7)
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    L1003(М16)               ,М16 := L1003
L0701   СЧИМ   М16                      ,стек := М16, СМ := М16
L0702   УИА    L0722(М16)               ,М16 := L0722
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0704   УИА    L0673(М16)               ,М16 := L0673
L0705   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
L0707   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0710   РЖА    '3'                      ,РЖ := '3'
L0711   РЖА    '22'                     ,РЖ := '22'
L0712   СЧ     33(М7)                   ,СМ := 33(М7)
L0713   УИА    L0671(М16)               ,М16 := L0671
L0714   ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0716   ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0720   СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
L0722   ЗП     SCHEMA                   ,SCHEMA := СМ
L0723   СЧ     1(М7)                    ,СМ := 1(М7)
L0724   ЗП     25(М7)                   ,25 := СМ
L0725   РЖА    '22'                     ,РЖ := '22'
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0041(М7)                ,СМ += L0041(М7)
        ЗП     34(М7)                   ,34 := СМ
        МОД    L0723                    ,мод.адрес по коду: L0723
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   L0756(М1)                ,мод.адрес +1: L0756(М1)
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОД    L0712                    ,мод.адрес по коду: L0712
        УИА    SCHEMA(М2)               ,М2 := SCHEMA
        МОДА   *PAGE*+77777(М2)         ,мод.адрес +1: *PAGE*+77777
L0741   ЗП     SCHEMA                   ,SCHEMA := СМ
L0742   РЖА    '22'                     ,РЖ := '22'
L0743   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
L0745   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
L0747   ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   5(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0353                    ,если СМ=0 → L0353
        ПБ     L0467                    ,переход на L0467
        СЧ     8(М7)                    ,СМ := 8(М7)
        СЧИМ                            ,СЧИ + магазин
L0756   МОДА   *FOP*                    ,мод.адрес +1: *FOP*
L0757   СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0372                    ,если СМ=0 → L0372
        ПБ     L0377                    ,переход на L0377
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0376                    ,если СМ≠0 → L0376
L0772   ПБ     L0377                    ,переход на L0377
L0773   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0467                    ,переход на L0467
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
L1003   МОДА   *STANN*                  ,мод.адрес +1: *STANN*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
L1007   ПЕ     L0405                    ,если СМ≠0 → L0405
        ПБ     L0406                    ,переход на L0406
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0416                    ,переход на L0416
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L0657(М16)               ,М16 := L0657
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0665(М16)               ,М16 := L0665
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     5(М7)                    ,СМ := 5(М7)
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0422                    ,переход на L0422
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L1007(М16)               ,М16 := L1007
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0674(М16)               ,М16 := L0674
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0426                    ,если СМ≠0 → L0426
        ПБ     L0427                    ,переход на L0427
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0447                    ,переход на L0447
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0436                    ,если СМ=0 → L0436
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0436                    ,если СМ=0 → L0436
        ПБ     L0437                    ,переход на L0437
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0447                    ,переход на L0447
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L1003(М16)               ,М16 := L1003
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L1003(М16)               ,М16 := L1003
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0665(М16)               ,М16 := L0665
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     ENDKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     8(М7)                    ,СМ := 8(М7)
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0041(М7)                ,СМ += L0041(М7)
        ЗП     34(М7)                   ,34 := СМ
        МОД    L0723                    ,мод.адрес по коду: L0723
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   L0742(М1)                ,мод.адрес +1: L0742(М1)
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОД    L0712                    ,мод.адрес по коду: L0712
        УИА    SCHEMA(М2)               ,М2 := SCHEMA
        МОДА   *PAGE*+77777(М2)         ,мод.адрес +1: *PAGE*+77777
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   5(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0454                    ,если СМ=0 → L0454
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОД    *BLO*                    ,мод.адрес по коду: *BLO*
        ПБ     L0467                    ,переход на L0467
        ПБ     L0476                    ,переход на L0476
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0504                    ,переход на L0504
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0507                    ,переход на L0507
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0512                    ,переход на L0512
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0551                    ,переход на L0551
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0565                    ,переход на L0565
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L0705(М16)               ,М16 := L0705
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0577                    ,переход на L0577
        УИА    L0710(М16)               ,М16 := L0710
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0577                    ,переход на L0577
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L0704(М16)               ,М16 := L0704
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0577                    ,переход на L0577
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0516                    ,если СМ=0 → L0516
        ПБ     L0517                    ,переход на L0517
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0547                    ,переход на L0547
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+11               ,мод.адрес +1: *REGIM*+11
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     GOSTAS(М15)              ,вызов через М15
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0534                    ,если СМ=0 → L0534
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0534                    ,если СМ=0 → L0534
        ПБ     L0535                    ,переход на L0535
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0547                    ,переход на L0547
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        МОД    L0712                    ,мод.адрес по коду: L0712
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   18(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0540                    ,если СМ=0 → L0540
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     REDTXT(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0617                    ,переход на L0617
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *STV*                    ,мод.адрес +1: *STV*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *MKR*+765                ,мод.адрес +1: *MKR*+765
        ЗП     SCHEMA                   ,SCHEMA := СМ
        УИА    L0707(М16)               ,М16 := L0707
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *STV*                    ,мод.адрес +1: *STV*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+10               ,мод.адрес +1: *REGIM*+10
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *MKR*+765                ,мод.адрес +1: *MKR*+765
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0617                    ,переход на L0617
        УИА    L0773(М16)               ,М16 := L0773
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0701(М16)               ,М16 := L0701
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0671(М16)               ,М16 := L0671
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     ENDKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     9(М7)                    ,СМ := 9(М7)
        ЗП     28(М7)                   ,28 := СМ
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *FIN*                    ,мод.адрес +1: *FIN*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L0725(М16)               ,М16 := L0725
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0724(М16)               ,М16 := L0724
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     SPAUD(М15)               ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0611                    ,если СМ≠0 → L0611
        ПБ     L0612                    ,переход на L0612
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0602                    ,переход на L0602
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        МОД    L0712                    ,мод.адрес по коду: L0712
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   СИМ74(М1)                ,мод.адрес +1: СИМ74(М1)
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   21(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0614                    ,если СМ=0 → L0614
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *NUSTA*                  ,мод.адрес +1: *NUSTA*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+10               ,мод.адрес +1: *REGIM*+10
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0634                    ,если СМ≠0 → L0634
        ПБ     L0635                    ,переход на L0635
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0640                    ,переход на L0640
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     28(М7)                   ,СМ := 28(М7)
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0643                    ,если СМ≠0 → L0643
        ПБ     L0644                    ,переход на L0644
        ПБ     L0037                    ,переход на L0037
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0653                    ,переход на L0653
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0661(М7)                ,М7 := L0661
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М2                       ,стек := М2, СМ := М2
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SCHEMA(М12)              ,переход через М12
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М2                       ,М2 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SCHEMA(М10)              ,переход через М10

