***************************************************
* SEGTAB - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 16384 образа SIPROD.BIN
*   Длина при загрузке: 401 слов, 728 команд
*   Вход: SEGTAB
*   Внешние: *STR*, *INS*, *TXT*, *TAB*, *LYG*, *LRE*, *ATV*, *SLY*, *EGO*, 
*   *DYD*, *LNT*, *SEK*, *INF*, *NRD*, *SCANER*, *NUST*, *RUSIS*, *NDAB*, 
*   *PAGE*, *REGIM*, KLAIDA, RASTXT, ANATXT, LYGPAR, NEWMAX, SEKDYD, 
*   SEKGIR, RWINF, SYTINT, GETSTR, SEKLYG, BEGPG, ENDPG, BEGSTR, ENDSTR, 
*   RSYMB, I*MU*I, I*DI*I
*   Смещения в *ATV*: 1
*   Смещения в *DYD*: 1, 2
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *INF*: 1, 2
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1, 2, 3
*   Смещения в *NRD*: 24
*   Смещения в *NUST*: 8
*   Смещения в *PAGE*: 3, 4, 5
*   Смещения в *SCANER*: 1, 2
*   Смещения в *SEK*: 2, 3
*   Смещения в *SLY*: 1
*   Смещения в *STR*: 24, 25, 26
*   Смещения в *TAB*: 1, 2, 3, 4
*   Смещения в *TXT*: 1, 2, 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
SEGTAB  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0544                    ,переход на L0544
L0002   СЧ     3(М7)                    ,СМ := 3(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        ЗП     19(М7)                   ,19 := СМ
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
L0010   СЧ     SEGTAB                   ,СМ := SEGTAB
L0011   УИА    L0601(М16)               ,М16 := L0601
L0012   ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ЗП     20(М7)                   ,20 := СМ
L0015   МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
L0016   СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
L0021   СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     21(М7)                   ,21 := СМ
        СЧ     20(М7)                   ,СМ := 20(М7)
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        СЛ     L0011(М7)                ,СМ += L0011(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0015                    ,если СМ=0 → L0015
        ПБ     L0016                    ,переход на L0016
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0021                    ,переход на L0021
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     11(М7)                   ,СМ := 11(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0037   РЖА    '22'                     ,РЖ := '22'
L0040   ПБ     L0525                    ,переход на L0525
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
L0043   ЗП     23(М7)                   ,23 := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    *NRD*(М16)               ,М16 := *NRD*
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0047   УИА    L0602(М16)               ,М16 := L0602
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0605(М16)               ,М16 := L0605
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0563(М16)               ,М16 := L0563
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0062   СЧ     23(М7)                   ,СМ := 23(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЛ     SEGTAB                   ,СМ += SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0037                    ,если СМ=0 → L0037
        ПБ     L0040                    ,переход на L0040
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0043                    ,переход на L0043
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     12(М7)                   ,СМ := 12(М7)
L0101   ЗП     22(М7)                   ,22 := СМ
L0102   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0104   ПБ     L0525                    ,переход на L0525
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0114   РЖА    '22'                     ,РЖ := '22'
L0115   МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     '4111'(М7)               ,СМ := '4111'(М7)
L0117   МОД    L0606                    ,мод.адрес по коду: L0606
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   СИМ112(М1)               ,мод.адрес +1: СИМ112(М1)
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     '4111'(М7)               ,СМ := '4111'(М7)
        МОД    L0606                    ,мод.адрес по коду: L0606
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   СИМ113(М1)               ,мод.адрес +1: СИМ113(М1)
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     24(М7)                   ,24 := СМ
        ВЧОБ   17(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0047                    ,если СМ=0 → L0047
L0137   СЧ     2(М7)                    ,СМ := 2(М7)
L0140   ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L0607                    ,мод.адрес по коду: L0607
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
L0150   ЗП     SEGTAB                   ,SEGTAB := СМ
L0151   МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
L0155   ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   8(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0062                    ,если СМ=0 → L0062
        СЧ     1(М7)                    ,СМ := 1(М7)
L0162   МОДА   *SLY*+1                  ,мод.адрес +1: *SLY*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0167   ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
L0173   МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
L0174   СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0101                    ,если СМ=0 → L0101
        ПБ     L0102                    ,переход на L0102
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0104                    ,переход на L0104
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     3(М7)                    ,СМ := 3(М7)
        РЖА    '3'                      ,РЖ := '3'
L0212   ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
L0213   УИА    *LNT*(М16)               ,М16 := *LNT*
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0216   МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
L0217   ВЧ     SEGTAB                   ,СМ -= SEGTAB
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЛ     SEGTAB                   ,СМ += SEGTAB
L0222   МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     SEGTAB                   ,СМ += SEGTAB
        ВЧ     4(М7)                    ,СМ -= 4(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0114                    ,если СМ=0 → L0114
        ПБ     L0115                    ,переход на L0115
        ПБ     L0117                    ,переход на L0117
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
L0241   ЗП     SEGTAB                   ,SEGTAB := СМ
L0242   РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
L0245   ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     26(М7)                   ,26 := СМ
L0250   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0251   СЧ     SEGTAB                   ,СМ := SEGTAB
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0254   ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     SEGTAB(М7)               ,СМ := SEGTAB(М7)
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ115                   ,мод.адрес +1: СИМ115
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SEGTAB                   ,СМ := SEGTAB
L0272   РЖА    '22'                     ,РЖ := '22'
L0273   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0137                    ,если СМ≠0 → L0137
        ПБ     L0140                    ,переход на L0140
        ПБ     L0162                    ,переход на L0162
L0277   МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0300   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        УИА    L0561(М16)               ,М16 := L0561
L0303   ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
        СЧ     27(М7)                   ,СМ := 27(М7)
        УИА    L0561(М16)               ,М16 := L0561
        ПВ     I*MU*I(М15)              ,вызов через М15
L0314   РЖА    '22'                     ,РЖ := '22'
L0315   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0150                    ,если СМ≠0 → L0150
        ПБ     L0151                    ,переход на L0151
L0320   ПБ     L0155                    ,переход на L0155
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0322   СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   СИМ117                   ,мод.адрес +1: СИМ117
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   СИМ120                   ,мод.адрес +1: СИМ120
        ЗП     SEGTAB                   ,SEGTAB := СМ
        ПБ     L0162                    ,переход на L0162
L0331   МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0332   СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ117                   ,мод.адрес +1: СИМ117
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
L0336   МОДА   СИМ120                   ,мод.адрес +1: СИМ120
L0337   ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
L0343   МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *SEK*                    ,мод.адрес +1: *SEK*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ120                   ,мод.адрес +1: СИМ120
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
L0353   ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SEKLYG(М15)              ,вызов через М15
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SEGTAB                   ,СМ := SEGTAB
L0360   РЖА    '3'                      ,РЖ := '3'
L0361   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0173                    ,если СМ≠0 → L0173
L0365   ПБ     L0174                    ,переход на L0174
L0366   ПБ     L0420                    ,переход на L0420
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИА    L0612(М16)               ,М16 := L0612
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GETSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
L0375   РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SEGTAB                   ,СМ := SEGTAB
L0400   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0401   ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     26(М7)                   ,СМ := 26(М7)
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     26(М7)                   ,26 := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        ЗП     29(М7)                   ,29 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     *NRD*(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     7(М7)                    ,СМ := 7(М7)
L0415   СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
L0420   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0212                    ,если СМ=0 → L0212
        ПБ     L0213                    ,переход на L0213
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0424   ПБ     L0222                    ,переход на L0222
L0425   МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0216                    ,если СМ≠0 → L0216
L0433   ПБ     L0217                    ,переход на L0217
        ПБ     L0415                    ,переход на L0415
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     13(М7)                   ,СМ := 13(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0441   РЖА    '22'                     ,РЖ := '22'
L0442   ПБ     L0525                    ,переход на L0525
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0445   СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        ЗП     30(М7)                   ,30 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0614(М16)               ,М16 := L0614
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0615(М16)               ,М16 := L0615
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0457   РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     30(М7)                   ,СМ := 30(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0466   ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     *NRD*(М15)               ,вызов через М15
        СЧ     10(М7)                   ,СМ := 10(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L0475   СЧ     SEGTAB                   ,СМ := SEGTAB
L0476   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0241                    ,если СМ≠0 → L0241
        ПБ     L0242                    ,переход на L0242
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0502   ПБ     L0245                    ,переход на L0245
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     31(М7)                   ,СМ := 31(М7)
L0505   МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0254                    ,переход на L0254
L0512   СЧ     2(М7)                    ,СМ := 2(М7)
L0513   СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
L0516   ПЕ     L0250                    ,если СМ≠0 → L0250
        ПБ     L0251                    ,переход на L0251
        ПБ     L0415                    ,переход на L0415
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     14(М7)                   ,СМ := 14(М7)
L0523   ЗП     22(М7)                   ,22 := СМ
L0524   РЖА    '3'                      ,РЖ := '3'
L0525   РЖА    '22'                     ,РЖ := '22'
        ПБ     L0525                    ,переход на L0525
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0530   МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        СЧ     SEGTAB                   ,СМ := SEGTAB
L0532   МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0544   МОДА   *INF*                    ,мод.адрес +1: *INF*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
L0551   МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *ATV*+1                  ,мод.адрес +1: *ATV*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
L0555   СЧ     2(М7)                    ,СМ := 2(М7)
L0556   СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
L0560   РЖА    '22'                     ,РЖ := '22'
L0561   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0272                    ,если СМ=0 → L0272
L0563   ПБ     L0273                    ,переход на L0273
        ПБ     L0343                    ,переход на L0343
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0277                    ,если СМ=0 → L0277
        ПБ     L0300                    ,переход на L0300
        ПБ     L0332                    ,переход на L0332
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0601   СЧ     SEGTAB                   ,СМ := SEGTAB
L0602   ЗП     32(М7)                   ,32 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0604   РЖА    '22'                     ,РЖ := '22'
L0605   ПБ     L0320                    ,переход на L0320
L0606   УИА    *STR*(М16)               ,М16 := *STR*
L0607   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0616(М16)               ,М16 := L0616
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0612   УИА    L0555(М16)               ,М16 := L0555
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0614   УИА    L0563(М16)               ,М16 := L0563
L0615   СЧИМ   М16                      ,стек := М16, СМ := М16
L0616   ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0620   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     18(М7)                   ,СМ := 18(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '4123'(М7)               ,СМ := '4123'(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0314                    ,если СМ≠0 → L0314
        ПБ     L0315                    ,переход на L0315
        ПБ     L0322                    ,переход на L0322
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     32(М7)                   ,СМ := 32(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     32(М7)                   ,32 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        ПО     L0303                    ,если СМ=0 → L0303
        ПБ     L0332                    ,переход на L0332
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
        СЧ     33(М7)                   ,СМ := 33(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0331                    ,если СМ=0 → L0331
        ПБ     L0332                    ,переход на L0332
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0336                    ,если СМ=0 → L0336
        ПБ     L0337                    ,переход на L0337
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKGIR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKDYD(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИА    L0560(М16)               ,М16 := L0560
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     NEWMAX(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     LYGPAR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+4                  ,мод.адрес +1: *TAB*+4
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *ATV*+1                  ,мод.адрес +1: *ATV*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0353                    ,если СМ≠0 → L0353
        ПБ     L0361                    ,переход на L0361
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЛ     SEGTAB                   ,СМ += SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0360                    ,если СМ≠0 → L0360
        ПБ     L0361                    ,переход на L0361
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0375                    ,переход на L0375
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0365                    ,если СМ=0 → L0365
        ПБ     L0366                    ,переход на L0366
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKGIR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKLYG(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0420                    ,переход на L0420
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0400                    ,если СМ=0 → L0400
        ПБ     L0401                    ,переход на L0401
        ПБ     L0420                    ,переход на L0420
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЛ     SEGTAB                   ,СМ += SEGTAB
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0420                    ,переход на L0420
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     29(М7)                   ,СМ := 29(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0424                    ,если СМ=0 → L0424
        ПБ     L0425                    ,переход на L0425
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0466                    ,переход на L0466
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0433                    ,если СМ≠0 → L0433
        ПБ     L0442                    ,переход на L0442
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        СЛ     SEGTAB                   ,СМ += SEGTAB
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0441                    ,если СМ=0 → L0441
        ПБ     L0442                    ,переход на L0442
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0445                    ,переход на L0445
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     16(М7)                   ,СМ := 16(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0525                    ,переход на L0525
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     3(М7)                    ,СМ := 3(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        ЗП     19(М7)                   ,19 := СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        УИА    L0601(М16)               ,М16 := L0601
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЛ     SEGTAB                   ,СМ += SEGTAB
        МОДА   *TAB*+2                  ,мод.адрес +1: *TAB*+2
        ЗП     SEGTAB                   ,SEGTAB := СМ
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        МОДА   *TAB*+1                  ,мод.адрес +1: *TAB*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L0607                    ,мод.адрес по коду: L0607
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   8(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0457                    ,если СМ=0 → L0457
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ANATXT(М15)              ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0475                    ,если СМ≠0 → L0475
        ПБ     L0476                    ,переход на L0476
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0505                    ,переход на L0505
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0502                    ,если СМ≠0 → L0502
        ПБ     L0505                    ,переход на L0505
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        СЛ     SEGTAB                   ,СМ += SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0512                    ,если СМ=0 → L0512
        ПБ     L0513                    ,переход на L0513
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0516                    ,переход на L0516
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     15(М7)                   ,СМ := 15(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0525                    ,переход на L0525
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     RASTXT(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0523                    ,если СМ≠0 → L0523
        ПБ     L0524                    ,переход на L0524
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0167                    ,переход на L0167
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0530                    ,переход на L0530
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИА    L0604(М16)               ,М16 := L0604
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     34(М7)                   ,34 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4111'(М7)               ,СМ := '4111'(М7)
        МОД    L0620                    ,мод.адрес по коду: L0620
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   *STR*+77777(М1)          ,мод.адрес +1: *STR*+77777(
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     34(М7)                   ,СМ := 34(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        ЗП     34(М7)                   ,34 := СМ
        ВЧОБ   9(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0532                    ,если СМ=0 → L0532
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0551                    ,переход на L0551
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0556(М7)                ,М7 := L0556
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SEGTAB(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SEGTAB(М10)              ,переход через М10
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB

