***************************************************
* SEKGIR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 17664 образа SIPROD.BIN
*   Длина при загрузке: 394 слов, 734 команд
*   Вход: SEKGIR
*   Внешние: *SEK*, *LRE*, *TAB*, *REGIM*, *SUT*, *LYG*, *SLY*, *DYD*, 
*   *NRD*, *INF*, *ADR*, *SEP*, *PAGE*, *EGO*, SEKDYD, RWINF, WRREM, 
*   KOKSON, ADRSEK, KOKSEK, I*MU*I
*   Смещения в *ADR*: 1, 2, 3
*   Смещения в *DYD*: 1, 2
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *INF*: 1, 2
*   Смещения в *LYG*: 1, 2
*   Смещения в *NRD*: 24
*   Смещения в *PAGE*: 3, 4, 5
*   Смещения в *SEK*: 1, 2, 3
*   Смещения в *SEP*: 1, 2, 3, 4, 5
*   Смещения в *SLY*: 1
*   Смещения в *SUT*: 1
*   Смещения в *TAB*: 1
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
SEKGIR  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0547                    ,переход на L0547
L0002   МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
L0003   СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     13(М7)                   ,13 := СМ
L0005   РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0010   ЗП     14(М7)                   ,14 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
L0012   ЗП     15(М7)                   ,15 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0017   СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     16(М7)                   ,16 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
L0022   ЗП     17(М7)                   ,17 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     18(М7)                   ,18 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
L0030   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0017                    ,если СМ=0 → L0017
L0034   ПБ     L0022                    ,переход на L0022
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
L0042   РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
L0047   МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     SEKGIR                   ,СМ += SEKGIR
        УИА    L0572(М16)               ,М16 := L0572
L0052   ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ВЧ     8(М7)                    ,СМ -= 8(М7)
        ЗП     19(М7)                   ,19 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0034                    ,переход на L0034
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0061   СЧ     SEKGIR                   ,СМ := SEKGIR
L0062   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0065   ЗП     SEKGIR                   ,SEKGIR := СМ
L0066   РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     KOKSEK(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     ADRSEK(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0100   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0042                    ,если СМ=0 → L0042
        ПБ     L0047                    ,переход на L0047
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     9(М7)                    ,СМ := 9(М7)
        УИА    *LYG*+1(М16)             ,М16 := *LYG*+1
        ПВ     I*MU*I(М15)              ,вызов через М15
L0107   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0110   РЖА    '3'                      ,РЖ := '3'
        ВЧ     8(М7)                    ,СМ -= 8(М7)
        МОДА   *ADR*+1                  ,мод.адрес +1: *ADR*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
L0117   МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0123   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0124   СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0130   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0061                    ,если СМ≠0 → L0061
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
L0134   МОДА   *SEP*                    ,мод.адрес +1: *SEP*
L0135   СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0061                    ,если СМ≠0 → L0061
        ПБ     L0062                    ,переход на L0062
L0141   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0142   ПБ     L0100                    ,переход на L0100
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
L0147   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0150   ПЕ     L0065                    ,если СМ≠0 → L0065
L0151   ПБ     L0066                    ,переход на L0066
        ПБ     L0100                    ,переход на L0100
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
L0155   СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     20(М7)                   ,20 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
L0161   СЧ     SEKGIR                   ,СМ := SEKGIR
L0162   ЗП     21(М7)                   ,21 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        ЗП     17(М7)                   ,17 := СМ
        МОДА   СИМ57                    ,мод.адрес +1: СИМ57
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0167   МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
L0170   ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   СИМ60                    ,мод.адрес +1: СИМ60
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0173   МОДА   СИМ55                    ,мод.адрес +1: СИМ55
L0174   ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0430                    ,переход на L0430
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0200   МОДА   *SEP*                    ,мод.адрес +1: *SEP*
L0201   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
L0205   ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
L0211   СЛ     L0005(М7)                ,СМ += L0005(М7)
L0212   РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0107                    ,если СМ≠0 → L0107
        ПБ     L0110                    ,переход на L0110
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
L0217   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
L0223   СЛ     L0003(М7)                ,СМ += L0003(М7)
L0224   ЗП     22(М7)                   ,22 := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*                    ,мод.адрес +1: *SEK*
L0230   СЧ     SEKGIR                   ,СМ := SEKGIR
L0231   РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0117                    ,если СМ≠0 → L0117
        ПБ     L0124                    ,переход на L0124
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
L0240   МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0123                    ,если СМ=0 → L0123
L0244   ПБ     L0124                    ,переход на L0124
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0052                    ,переход на L0052
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0250   СЧ     2(М7)                    ,СМ := 2(М7)
L0251   СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+1                  ,мод.адрес +1: *SEK*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0130                    ,если СМ≠0 → L0130
        ПБ     L0135                    ,переход на L0135
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0265   ПО     L0134                    ,если СМ=0 → L0134
L0266   ПБ     L0135                    ,переход на L0135
L0267   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0052                    ,переход на L0052
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
L0273   СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0277   ПО     L0141                    ,если СМ=0 → L0141
        ПБ     L0142                    ,переход на L0142
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0231                    ,переход на L0231
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    L0607                    ,мод.адрес по коду: L0607
        УИА    SEKGIR(М1)               ,М1 := SEKGIR
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0312   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0313   ПО     L0147                    ,если СМ=0 → L0147
        ПБ     L0150                    ,переход на L0150
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0052                    ,переход на L0052
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0320   ПБ     L0231                    ,переход на L0231
L0321   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
L0324   МОДА   *SLY*                    ,мод.адрес +1: *SLY*
L0325   СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0155                    ,если СМ=0 → L0155
        ПБ     L0162                    ,переход на L0162
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
L0334   МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0336   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0161                    ,если СМ=0 → L0161
        ПБ     L0162                    ,переход на L0162
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0052                    ,переход на L0052
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     KOKSON(М15)              ,вызов через М15
L0345   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0346   СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0167                    ,если СМ≠0 → L0167
        ПБ     L0170                    ,переход на L0170
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0356   ПБ     L0212                    ,переход на L0212
L0357   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
L0363   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0173                    ,если СМ=0 → L0173
        ПБ     L0174                    ,переход на L0174
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     SEKGIR                   ,СМ := SEKGIR
        СЧИМ                            ,СЧИ + магазин
L0373   МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
L0374   СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0200                    ,если СМ≠0 → L0200
        ПБ     L0201                    ,переход на L0201
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
L0403   СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0205                    ,если СМ=0 → L0205
        ПБ     L0212                    ,переход на L0212
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0414   СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0420   ПЕ     L0211                    ,если СМ≠0 → L0211
        ПБ     L0212                    ,переход на L0212
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     WRREM(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
L0427   СЧИМ                            ,СЧИ + магазин
L0430   МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0217                    ,если СМ=0 → L0217
L0434   ПБ     L0224                    ,переход на L0224
L0435   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0440   РЖА    '3'                      ,РЖ := '3'
L0441   ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0223                    ,если СМ≠0 → L0223
        ПБ     L0224                    ,переход на L0224
        ПБ     L0321                    ,переход на L0321
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0450   ПБ     L0511                    ,переход на L0511
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     15(М7)                   ,СМ := 15(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0455   ПО     L0230                    ,если СМ=0 → L0230
        ПБ     L0231                    ,переход на L0231
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0321                    ,переход на L0321
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0473   РЖА    '22'                     ,РЖ := '22'
L0474   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0475   ПО     L0240                    ,если СМ=0 → L0240
        ПБ     L0244                    ,переход на L0244
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0500   МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0501   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0012(М7)                ,СМ += L0012(М7)
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
L0506   РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
L0511   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0250                    ,если СМ≠0 → L0250
        ПБ     L0251                    ,переход на L0251
        ПБ     L0267                    ,переход на L0267
L0521   МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0522   МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     23(М7)                   ,23 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0526   МОДА   *SUT*                    ,мод.адрес +1: *SUT*
L0527   СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
L0534   МОДА   *INF*                    ,мод.адрес +1: *INF*
L0535   СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
L0541   СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0547   ПЕ     L0265                    ,если СМ≠0 → L0265
        ПБ     L0266                    ,переход на L0266
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0554   ПБ     L0151                    ,переход на L0151
        ПБ     L0511                    ,переход на L0511
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
L0561   СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0273                    ,если СМ=0 → L0273
        ПБ     L0277                    ,переход на L0277
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0567   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0012(М7)                ,СМ += L0012(М7)
L0572   МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SUT*+1                  ,мод.адрес +1: *SUT*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
L0607   СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *SUT*+1                  ,мод.адрес +1: *SUT*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0312                    ,если СМ=0 → L0312
        ПБ     L0313                    ,переход на L0313
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0151                    ,переход на L0151
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    L0607                    ,мод.адрес по коду: L0607
        УИА    SEKGIR(М1)               ,М1 := SEKGIR
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0320                    ,если СМ≠0 → L0320
        ПБ     L0321                    ,переход на L0321
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     15(М7)                   ,СМ := 15(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0324                    ,если СМ=0 → L0324
        ПБ     L0325                    ,переход на L0325
        ПБ     L0336                    ,переход на L0336
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        ЗП     15(М7)                   ,15 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SEKDYD(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0334                    ,если СМ≠0 → L0334
        ПБ     L0336                    ,переход на L0336
        СЧ     7(М7)                    ,СМ := 7(М7)
        ЗП     18(М7)                   ,18 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0345                    ,если СМ=0 → L0345
        ПБ     L0346                    ,переход на L0346
        ПБ     L0430                    ,переход на L0430
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     SEKGIR                   ,СМ := SEKGIR
        УИА    L0572(М16)               ,М16 := L0572
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *SEP*+4                  ,мод.адрес +1: *SEP*+4
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0356                    ,если СМ=0 → L0356
        ПБ     L0357                    ,переход на L0357
        ПБ     L0363                    ,переход на L0363
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0414                    ,переход на L0414
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     11(М7)                   ,СМ := 11(М7)
        ЗП     24(М7)                   ,24 := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0373                    ,если СМ≠0 → L0373
        ПБ     L0374                    ,переход на L0374
        ПБ     L0403                    ,переход на L0403
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     11(М7)                   ,СМ := 11(М7)
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0030(М7)                ,СМ += L0030(М7)
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     19(М7)                   ,СМ := 19(М7)
        МОДА   *SEP*+4                  ,мод.адрес +1: *SEP*+4
        ВЧ     SEKGIR                   ,СМ -= SEKGIR
        УИА    L0567(М16)               ,М16 := L0567
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        СЛ     SEKGIR                   ,СМ += SEKGIR
        МОДА   *SEP*+2                  ,мод.адрес +1: *SEP*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0420                    ,если СМ=0 → L0420
        ПБ     L0427                    ,переход на L0427
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *ADR*+1                  ,мод.адрес +1: *ADR*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SEP*+4                  ,мод.адрес +1: *SEP*+4
        ВЧ     SEKGIR                   ,СМ -= SEKGIR
        УИА    L0567(М16)               ,М16 := L0567
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        СЛ     SEKGIR                   ,СМ += SEKGIR
        МОДА   *SEP*+2                  ,мод.адрес +1: *SEP*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0212                    ,переход на L0212
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0434                    ,если СМ=0 → L0434
        ПБ     L0435                    ,переход на L0435
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0440                    ,если СМ≠0 → L0440
        ПБ     L0441                    ,переход на L0441
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     3(М7)                    ,СМ := 3(М7)
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ADRSEK(М15)              ,вызов через М15
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0450                    ,если СМ=0 → L0450
        ПБ     L0455                    ,переход на L0455
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     9(М7)                    ,СМ := 9(М7)
        УИА    *LYG*+1(М16)             ,М16 := *LYG*+1
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     8(М7)                    ,СМ -= 8(М7)
        МОДА   *ADR*+1                  ,мод.адрес +1: *ADR*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     KOKSON(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0012(М7)                ,СМ += L0012(М7)
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     23(М7)                   ,СМ := 23(М7)
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0473                    ,если СМ=0 → L0473
        ПБ     L0474                    ,переход на L0474
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0475                    ,переход на L0475
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     WRREM(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     17(М7)                   ,СМ := 17(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0500                    ,если СМ≠0 → L0500
        ПБ     L0501                    ,переход на L0501
        ПБ     L0506                    ,переход на L0506
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     20(М7)                   ,СМ := 20(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     21(М7)                   ,СМ := 21(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     17(М7)                   ,17 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     5(М7)                    ,СМ := 5(М7)
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     13(М7)                   ,СМ := 13(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     14(М7)                   ,СМ := 14(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     15(М7)                   ,15 := СМ
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        ВЧ     5(М7)                    ,СМ -= 5(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0521                    ,если СМ≠0 → L0521
        ПБ     L0522                    ,переход на L0522
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0052                    ,переход на L0052
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0526                    ,если СМ≠0 → L0526
        ПБ     L0527                    ,переход на L0527
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0541                    ,переход на L0541
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        ВЧ     SEKGIR                   ,СМ -= SEKGIR
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0534                    ,если СМ≠0 → L0534
        ПБ     L0535                    ,переход на L0535
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0030                    ,переход на L0030
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     SEKGIR(М7)               ,СМ := SEKGIR(М7)
        МОДА   *SUT*+1                  ,мод.адрес +1: *SUT*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SEKGIR(М7)               ,СМ := SEKGIR(М7)
        МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     16(М7)                   ,СМ := 16(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     13(М7)                   ,СМ := 13(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     14(М7)                   ,СМ := 14(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0554                    ,переход на L0554
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0561(М7)                ,М7 := L0561
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SEKGIR(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SEKGIR(М10)              ,переход через М10
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR

