***************************************************
* SEKLYG - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 18144 образа SIPROD.BIN
*   Длина при загрузке: 139 слов, 260 команд
*   Вход: SEKLYG
*   Внешние: *TAB*, *INF*, *ATV*, *DYD*, *APJ*, *LYG*, *SEK*, *LNT*, *STL*, 
*   *SLY*, *NUST*, *PLN*, *PAGE*, *REGIM*, *TXT*, *NDAB*, BEGPG, KLAIDA, 
*   RWINF, SEKGIR
*   Смещения в *ATV*: 1
*   Смещения в *DYD*: 1, 2
*   Смещения в *INF*: 1, 2
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1
*   Смещения в *NUST*: 8
*   Смещения в *PAGE*: 3, 4, 5
*   Смещения в *SEK*: 2, 3
*   Смещения в *SLY*: 1
*   Смещения в *STL*: 1
*   Смещения в *TAB*: 1
*   Смещения в *TXT*: 1
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
SEKLYG  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0173                    ,переход на L0173
L0002   МОДА   СИМ44                    ,мод.адрес +1: СИМ44
L0003   СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        СЧ     SEKLYG                   ,СМ := SEKLYG
L0010   МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
L0012   СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
L0014   МОДА   *LNT*                    ,мод.адрес +1: *LNT*
L0015   СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     L0014                    ,если СМ≠0 → L0014
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*                    ,мод.адрес +1: *SEK*
L0023   СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     L0014                    ,если СМ=0 → L0014
        ПБ     L0015                    ,переход на L0015
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     L0023                    ,переход на L0023
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     4(М7)                    ,СМ := 4(М7)
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SEKGIR(М15)              ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *PLN*                    ,мод.адрес +1: *PLN*
L0050   ЗП     SEKLYG                   ,SEKLYG := СМ
L0051   РЖА    '3'                      ,РЖ := '3'
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     SEKLYG(М7)               ,СМ := SEKLYG(М7)
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
L0060   ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     SEKLYG(М7)               ,СМ := SEKLYG(М7)
        МОДА   *INF*                    ,мод.адрес +1: *INF*
L0063   ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
L0067   ЗП     SEKLYG                   ,SEKLYG := СМ
L0070   РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
L0077   МОДА   СИМ44                    ,мод.адрес +1: СИМ44
        СЧ     SEKLYG                   ,СМ := SEKLYG
L0101   МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        ВЧ     SEKLYG                   ,СМ -= SEKLYG
L0113   МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        ВЧ     SEKLYG                   ,СМ -= SEKLYG
        РЖА    '22'                     ,РЖ := '22'
L0116   ПЕ     L0050                    ,если СМ≠0 → L0050
        ПБ     L0051                    ,переход на L0051
        ПБ     L0164                    ,переход на L0164
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
L0122   МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
L0123   СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     SEKLYG                   ,СМ := SEKLYG
        ВЧОБ   SEKLYG                   ,СМ := (адрес) - СМ
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЛ     SEKLYG                   ,СМ += SEKLYG
L0135   РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0060                    ,если СМ≠0 → L0060
L0137   ПБ     L0063                    ,переход на L0063
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
L0143   ЗП     SEKLYG                   ,SEKLYG := СМ
L0144   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
L0150   МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
L0151   СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     L0067                    ,если СМ≠0 → L0067
        ПБ     L0070                    ,переход на L0070
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     L0123                    ,переход на L0123
L0157   МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
L0164   МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '22'                     ,РЖ := '22'
L0173   НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     L0077                    ,если СМ=0 → L0077
        ПБ     L0101                    ,переход на L0101
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
L0200   ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
L0202   МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
L0210   МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     5(М7)                    ,СМ := 5(М7)
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     L0113                    ,если СМ=0 → L0113
        ПБ     L0116                    ,переход на L0116
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     5(М7)                    ,СМ := 5(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEKLYG                   ,СМ := (адрес) - СМ
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     L0122                    ,если СМ≠0 → L0122
        ПБ     L0123                    ,переход на L0123
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     L0137                    ,переход на L0137
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ44                    ,мод.адрес +1: СИМ44
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKLYG                   ,СМ := SEKLYG
        ВЧОБ   SEKLYG                   ,СМ := (адрес) - СМ
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0135                    ,если СМ≠0 → L0135
        ПБ     L0137                    ,переход на L0137
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        УИА    L0210(М16)               ,М16 := L0210
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     L0143                    ,если СМ≠0 → L0143
        ПБ     L0144                    ,переход на L0144
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     L0157                    ,переход на L0157
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     L0150                    ,если СМ=0 → L0150
        ПБ     L0151                    ,переход на L0151
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     L0157                    ,переход на L0157
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     4(М7)                    ,СМ := 4(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     BEGPG(М15)               ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЛ     SEKLYG                   ,СМ += SEKLYG
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *SLY*+1                  ,мод.адрес +1: *SLY*+1
        СЧ     SEKLYG                   ,СМ := SEKLYG
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *SLY*+1                  ,мод.адрес +1: *SLY*+1
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0200                    ,переход на L0200
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0202(М7)                ,М7 := L0202
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SEKLYG(М12)              ,переход через М12
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SEKLYG(М10)              ,переход через М10

