***************************************************
* SPAUD - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 12096 образа SIPROD.BIN
*   Длина при загрузке: 1643 слов, 2934 команд
*   Вход: SPAUD
*   Внешние: *FIN*, *FORMA*, *REGIM*, *NDAB*, *COMTIT*, *PAGE*, *INS*, 
*   *NUST*, *NRD*, *RAI*, *ARPI*, *STAND*, *RUSIS*, *MKR*, *RAK*, *DAR*, 
*   *MEDIUM*, *NRM*, *VIE*, *LNT*, *EGO*, *SCANER*, *STR*, TOPAGE, WRIMAK, 
*   READMK, SYTINT, RNSYMB, COMANN, I*MU*I, BEGPG, ENDPG, SEGTAB, TOKREZ, 
*   STAATP, NEWSTR, TITLE, FILLS, RSYMB, KLAIDA, DOUBLE, BEGSTR, ENDSTR, 
*   GETSTR, NUSTA, I*DI*I
*   Смещения в *COMTIT*: 12
*   Смещения в *DAR*: 24
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *FORMA*: 10, 11
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *MKR*: 500
*   Смещения в *NDAB*: 1, 2
*   Смещения в *NRD*: 24
*   Смещения в *NUST*: 1, 2, 3, 4, 5, 6, 7, 9
*   Смещения в *PAGE*: 1, 2, 3, 4, 5
*   Смещения в *RAI*: 1
*   Смещения в *REGIM*: 1, 2, 4, 6, 7, 8, 9, 10, 11
*   Смещения в *SCANER*: 1, 2
*   Смещения в *STAND*: 1, 2, 4
*   Смещения в *STR*: 24, 25, 26
*   Смещения в *VIE*: 1
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
SPAUD   СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L2662                    ,переход на L2662
L0002   СЧ     9(М7)                    ,СМ := 9(М7)
L0003   СЧИМ                            ,СЧИ + магазин
L0004   МОДА   *FIN*                    ,мод.адрес +1: *FIN*
L0005   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0005                    ,если СМ≠0 → L0005
L0010   ПБ     L0010                    ,переход на L0010
L0011   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0012   СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *FIN*                    ,мод.адрес +1: *FIN*
L0014   ЗП     SPAUD                    ,SPAUD := СМ
L0015   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
L0021   СЧИМ                            ,СЧИ + магазин
L0022   МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0014                    ,если СМ=0 → L0014
        ПБ     L0015                    ,переход на L0015
L0027   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0100                    ,переход на L0100
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0021                    ,если СМ=0 → L0021
        ПБ     L0022                    ,переход на L0022
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0062                    ,переход на L0062
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *ARPI*                   ,мод.адрес +1: *ARPI*
        ЗП     SPAUD                    ,SPAUD := СМ
L0047   РЖА    '3'                      ,РЖ := '3'
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *STAND*+1                ,мод.адрес +1: *STAND*+1
        ЗП     SPAUD                    ,SPAUD := СМ
L0053   СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *STAND*+2                ,мод.адрес +1: *STAND*+2
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   СИМ113                   ,мод.адрес +1: СИМ113
        ЗП     SPAUD                    ,SPAUD := СМ
L0061   СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L0062   МОДА   *STAND*+4                ,мод.адрес +1: *STAND*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   СИМ114                   ,мод.адрес +1: СИМ114
L0066   ЗП     SPAUD                    ,SPAUD := СМ
L0067   СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L0070   МОДА   *DAR*+30                 ,мод.адрес +1: *DAR*+30
L0071   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     NUSTA(М15)               ,вызов через М15
        СЧ     9(М7)                    ,СМ := 9(М7)
L0075   МОДА   *NUST*                   ,мод.адрес +1: *NUST*
L0076   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
L0100   СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *ARPI*                   ,мод.адрес +1: *ARPI*
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     '127'(М7)                ,'127' := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0106   СЧ     SPAUD                    ,СМ := SPAUD
L0107   СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
L0113   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L0114   ПО     L0047                    ,если СМ=0 → L0047
        ПБ     L0053                    ,переход на L0053
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0117   СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
L0121   СЛ     L0001(М7)                ,СМ += L0001(М7)
L0122   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0123   ЗП     SPAUD                    ,SPAUD := СМ
L0124   РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0127   СЧ     SPAUD                    ,СМ := SPAUD
L0130   МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
L0131   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0136   ВЧ     SPAUD                    ,СМ -= SPAUD
L0137   РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0061                    ,если СМ≠0 → L0061
        ПБ     L0062                    ,переход на L0062
        ПБ     L0106                    ,переход на L0106
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*+6                ,мод.адрес +1: *REGIM*+6
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0066                    ,если СМ≠0 → L0066
        ПБ     L0067                    ,переход на L0067
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2370                    ,переход на L2370
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
L0164   МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0075                    ,если СМ≠0 → L0075
        ПБ     L0076                    ,переход на L0076
        ПВ     NUSTA(М15)               ,вызов через М15
L0173   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0174   МОД    L3040                    ,мод.адрес по коду: L3040
        УИА    SPAUD(М16)               ,М16 := SPAUD
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GETSTR(М15)              ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
L0201   ЗП     '127'(М7)                ,'127' := СМ
L0202   РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0206   ЗП     SPAUD                    ,SPAUD := СМ
L0207   МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
L0212   ЗП     SPAUD                    ,SPAUD := СМ
L0213   РЖА    '22'                     ,РЖ := '22'
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЛ     SPAUD                    ,СМ += SPAUD
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0113                    ,если СМ=0 → L0113
        ПБ     L0114                    ,переход на L0114
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0124                    ,переход на L0124
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0230   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
L0231   СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     30(М7)                   ,30 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0234   РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        СЧ     30(М7)                   ,СМ := 30(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L0242   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0123                    ,если СМ=0 → L0123
        ПБ     L0124                    ,переход на L0124
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0246   ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L0251   СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*+7                ,мод.адрес +1: *REGIM*+7
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0130                    ,если СМ=0 → L0130
L0256   ПБ     L0131                    ,переход на L0131
L0257   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L0267   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0136                    ,если СМ≠0 → L0136
        ПБ     L0137                    ,переход на L0137
L0273   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0274   ПБ     L0174                    ,переход на L0174
L0275   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОД    *SCANER*+1               ,мод.адрес по коду: *SCANER*+1
        ПБ     L0137                    ,переход на L0137
        ПБ     L0375                    ,переход на L0375
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0434                    ,переход на L0434
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0304   ПБ     L0441                    ,переход на L0441
L0305   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0555                    ,переход на L0555
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0611                    ,переход на L0611
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0652                    ,переход на L0652
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0677                    ,переход на L0677
L0315   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0731                    ,переход на L0731
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0735                    ,переход на L0735
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0322   ПБ     L0764                    ,переход на L0764
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0324   ПБ     L1014                    ,переход на L1014
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1027                    ,переход на L1027
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0330   ПБ     L1070                    ,переход на L1070
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0332   ПБ     L1227                    ,переход на L1227
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1267                    ,переход на L1267
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0336   ПБ     L1756                    ,переход на L1756
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0340   ПБ     L2201                    ,переход на L2201
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2242                    ,переход на L2242
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0344   ПБ     L2333                    ,переход на L2333
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0346   ПБ     L2347                    ,переход на L2347
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0350   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЛ     SPAUD                    ,СМ += SPAUD
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0173                    ,если СМ≠0 → L0173
        ПБ     L0174                    ,переход на L0174
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0267                    ,переход на L0267
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L0375   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0201                    ,если СМ=0 → L0201
        ПБ     L0202                    ,переход на L0202
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0275                    ,переход на L0275
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     17(М7)                   ,СМ := 17(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L0410   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0206                    ,если СМ≠0 → L0206
        ПБ     L0207                    ,переход на L0207
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0251                    ,переход на L0251
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0416   СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     31(М7)                   ,СМ := 31(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0212                    ,если СМ≠0 → L0212
        ПБ     L0213                    ,переход на L0213
        ПБ     L0251                    ,переход на L0251
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     32(М7)                   ,СМ := 32(М7)
L0427   РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     32(М7)                   ,32 := СМ
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
L0433   СЧ     SPAUD                    ,СМ := SPAUD
L0434   ЗП     33(М7)                   ,33 := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        ЗП     34(М7)                   ,34 := СМ
L0441   УИА    L2747(М16)               ,М16 := L2747
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2750(М16)               ,М16 := L2750
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
L0446   ПВ     DOUBLE(М15)              ,вызов через М15
L0447   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L0453   СЧИМ                            ,СЧИ + магазин
L0454   СЧ     32(М7)                   ,СМ := 32(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0230                    ,если СМ=0 → L0230
        ПБ     L0231                    ,переход на L0231
        ПБ     L0234                    ,переход на L0234
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     35(М7)                   ,СМ := 35(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
L0465   РЖА    '3'                      ,РЖ := '3'
L0466   РЖА    '22'                     ,РЖ := '22'
        ПБ     L0164                    ,переход на L0164
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     31(М7)                   ,31 := СМ
L0472   РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
L0476   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0477   СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0242                    ,если СМ=0 → L0242
        ПБ     L0246                    ,переход на L0246
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
L0510   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0511   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0514   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        ЗП     SPAUD                    ,SPAUD := СМ
L0520   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0522   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЛ     SPAUD                    ,СМ += SPAUD
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0256                    ,если СМ=0 → L0256
        ПБ     L0257                    ,переход на L0257
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0534   ПБ     L0174                    ,переход на L0174
L0535   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     34(М7)                   ,34 := СМ
        УИА    L2747(М16)               ,М16 := L2747
L0546   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2750(М16)               ,М16 := L2750
L0550   СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
L0552   ПВ     DOUBLE(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
L0555   РЖА    '22'                     ,РЖ := '22'
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *RAK*                    ,мод.адрес +1: *RAK*
L0561   СЧ     SPAUD                    ,СМ := SPAUD
L0562   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0273                    ,если СМ=0 → L0273
        ПБ     L0274                    ,переход на L0274
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1705                    ,переход на L1705
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2670                    ,переход на L2670
L0571   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0572   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     36(М7)                   ,36 := СМ
L0577   МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
L0600   СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        СЧ     36(М7)                   ,СМ := 36(М7)
        РЖА    '22'                     ,РЖ := '22'
L0604   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0304                    ,если СМ=0 → L0304
        ПБ     L0305                    ,переход на L0305
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0610   ПБ     L0315                    ,переход на L0315
L0611   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     36(М7)                   ,СМ := 36(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L0620   ЗП     34(М7)                   ,34 := СМ
L0621   УИА    L2747(М16)               ,М16 := L2747
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2750(М16)               ,М16 := L2750
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     DOUBLE(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0630   РЖА    '3'                      ,РЖ := '3'
L0631   РЖА    '22'                     ,РЖ := '22'
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     14(М7)                   ,СМ := 14(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L0640   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L0641   ПО     L0322                    ,если СМ=0 → L0322
        ПБ     L0324                    ,переход на L0324
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
L0645   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     15(М7)                   ,СМ := 15(М7)
L0651   СЧИМ                            ,СЧИ + магазин
L0652   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0330                    ,если СМ=0 → L0330
        ПБ     L0332                    ,переход на L0332
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
L0661   СЧИМ   М16                      ,стек := М16, СМ := М16
L0662   ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
L0666   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0336                    ,если СМ=0 → L0336
L0672   ПБ     L0340                    ,переход на L0340
L0673   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
L0677   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     17(М7)                   ,СМ := 17(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L0704   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0344                    ,если СМ=0 → L0344
L0706   ПБ     L0346                    ,переход на L0346
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0712   ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0714   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     '127'(М7)                ,'127' := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0720   МОД    *SCANER*+1               ,мод.адрес по коду: *SCANER*+1
        ПБ     L0350                    ,переход на L0350
L0722   ПБ     L0375                    ,переход на L0375
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0434                    ,переход на L0434
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0726   ПБ     L0441                    ,переход на L0441
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0730   ПБ     L0555                    ,переход на L0555
L0731   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0611                    ,переход на L0611
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0652                    ,переход на L0652
L0735   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0673                    ,переход на L0673
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0731                    ,переход на L0731
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0735                    ,переход на L0735
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0764                    ,переход на L0764
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1014                    ,переход на L1014
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1027                    ,переход на L1027
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1070                    ,переход на L1070
L0753   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1227                    ,переход на L1227
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1267                    ,переход на L1267
L0757   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1756                    ,переход на L1756
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2201                    ,переход на L2201
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L0764   ПБ     L2242                    ,переход на L2242
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2333                    ,переход на L2333
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2347                    ,переход на L2347
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *SCANER*(М16)            ,М16 := *SCANER*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3036(М16)               ,М16 := L3036
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2713(М16)               ,М16 := L2713
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L1007   СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
L1013   ЗП     SPAUD                    ,SPAUD := СМ
L1014   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     37(М7)                   ,37 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0416                    ,переход на L0416
        УИА    L3036(М16)               ,М16 := L3036
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     FILLS(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     37(М7)                   ,СМ := 37(М7)
L1027   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     37(М7)                   ,37 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ВЧОБ   '127'(М7)                ,СМ := (адрес) - СМ
        ПО     L0410                    ,если СМ=0 → L0410
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L1037   СЧ     SPAUD                    ,СМ := SPAUD
L1040   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
L1042   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
L1046   СЧИМ                            ,СЧИ + магазин
L1047   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
L1051   РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0427                    ,если СМ=0 → L0427
        ПБ     L0433                    ,переход на L0433
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L1057   СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L1063   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
L1067   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1070   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
L1075   РЖА    '22'                     ,РЖ := '22'
L1076   ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0267                    ,переход на L0267
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     TITLE(М15)               ,вызов через М15
L1103   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     2(М7)                    ,СМ := 2(М7)
L1105   СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0446                    ,если СМ=0 → L0446
        ПБ     L0447                    ,переход на L0447
L1113   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0477                    ,переход на L0477
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     15(М7)                   ,СМ := 15(М7)
L1117   СЧИМ                            ,СЧИ + магазин
L1120   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0453                    ,если СМ=0 → L0453
L1124   ПБ     L0454                    ,переход на L0454
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1126   ПБ     L0552                    ,переход на L0552
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
L1133   ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L1135   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     NEWSTR(М15)              ,вызов через М15
        СЧ     '127'(М7)                ,СМ := '127'(М7)
L1141   РЖА    '3'                      ,РЖ := '3'
L1142   ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     '127'(М7)                ,'127' := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
L1145   ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        СЛ     SPAUD(М7)                ,СМ += SPAUD(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0465                    ,если СМ≠0 → L0465
        ПБ     L0466                    ,переход на L0466
        ПБ     L0441                    ,переход на L0441
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0472                    ,если СМ=0 → L0472
L1163   ПБ     L0476                    ,переход на L0476
L1164   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L1165   СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     38(М7)                   ,38 := СМ
        РЖА    '3'                      ,РЖ := '3'
L1202   УИА    L3035(М16)               ,М16 := L3035
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     STAATP(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
L1213   СЧ     38(М7)                   ,СМ := 38(М7)
L1214   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0510                    ,если СМ≠0 → L0510
        ПБ     L0511                    ,переход на L0511
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1220   ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
L1226   РЖА    '22'                     ,РЖ := '22'
L1227   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0520                    ,если СМ=0 → L0520
        ПБ     L0522                    ,переход на L0522
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2733(М16)               ,М16 := L2733
        СЧИМ   М16                      ,стек := М16, СМ := М16
L1242   ПВ     KLAIDA(М15)              ,вызов через М15
L1243   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    *NRD*(М16)               ,М16 := *NRD*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2755(М16)               ,М16 := L2755
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     TOKREZ(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
L1253   РЖА    '22'                     ,РЖ := '22'
L1254   СЧ     39(М7)                   ,СМ := 39(М7)
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L1266   ПО     L0534                    ,если СМ=0 → L0534
L1267   ПБ     L0535                    ,переход на L0535
        ПБ     L0550                    ,переход на L0550
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     39(М7)                   ,СМ := 39(М7)
        УИА    L2710(М16)               ,М16 := L2710
L1274   ПВ     I*DI*I(М15)              ,вызов через М15
L1275   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     39(М7)                   ,СМ := 39(М7)
L1302   СЧИМ                            ,СЧИ + магазин
L1303   МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        СЧ     SPAUD                    ,СМ := SPAUD
        УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '22'                     ,РЖ := '22'
L1311   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L0546                    ,если СМ≠0 → L0546
        ПБ     L0550                    ,переход на L0550
        УИА    L2734(М16)               ,М16 := L2734
        СЧИМ   М16                      ,стек := М16, СМ := М16
L1316   ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1320   ПВ     SEGTAB(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0514                    ,переход на L0514
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L1340   ПО     L0561                    ,если СМ=0 → L0561
L1341   ПБ     L0562                    ,переход на L0562
        ПБ     L0572                    ,переход на L0572
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L1346   ЗП     30(М7)                   ,30 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        СЧ     30(М7)                   ,СМ := 30(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L1356   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0571                    ,если СМ=0 → L0571
L1360   ПБ     L0572                    ,переход на L0572
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     '127'(М7)                ,'127' := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        СЛ     SPAUD(М7)                ,СМ += SPAUD(М7)
        РЖА    '22'                     ,РЖ := '22'
L1374   ПЕ     L0577                    ,если СМ≠0 → L0577
        ПБ     L0600                    ,переход на L0600
        ПБ     L0562                    ,переход на L0562
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1400   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
L1403   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0604                    ,если СМ=0 → L0604
L1407   ПБ     L0610                    ,переход на L0610
L1410   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
L1417   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L1423   СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0127(М7)                ,СМ += L0127(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L1427   ЗП     40(М7)                   ,40 := СМ
        СЧ     40(М7)                   ,СМ := 40(М7)
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЛ     SPAUD                    ,СМ += SPAUD
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0620                    ,если СМ=0 → L0620
L1436   ПБ     L0621                    ,переход на L0621
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0641                    ,переход на L0641
L1441   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     40(М7)                   ,СМ := 40(М7)
        МОДА   *RAI*+1                  ,мод.адрес +1: *RAI*+1
        ЗП     SPAUD                    ,SPAUD := СМ
L1445   РЖА    '3'                      ,РЖ := '3'
        СЧ     40(М7)                   ,СМ := 40(М7)
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ЗП     SPAUD                    ,SPAUD := СМ
L1451   СЧ     40(М7)                   ,СМ := 40(М7)
L1452   ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЛ     SPAUD                    ,СМ += SPAUD
        РЖА    '22'                     ,РЖ := '22'
L1456   ПО     L0630                    ,если СМ=0 → L0630
        ПБ     L0631                    ,переход на L0631
L1460   ПБ     L0641                    ,переход на L0641
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L1464   ЗП     30(М7)                   ,30 := СМ
        РЖА    '3'                      ,РЖ := '3'
L1466   РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        СЧ     30(М7)                   ,СМ := 30(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L1475   ПО     L0640                    ,если СМ=0 → L0640
        ПБ     L0641                    ,переход на L0641
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     BEGSTR(М15)              ,вызов через М15
L1501   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L1503   СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L1510   ПО     L0645                    ,если СМ=0 → L0645
        ПБ     L0651                    ,переход на L0651
L1512   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
L1532   ВЧ     1(М7)                    ,СМ -= 1(М7)
L1533   ЗП     '127'(М7)                ,'127' := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
L1535   ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        СЛ     SPAUD(М7)                ,СМ += SPAUD(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0661                    ,если СМ≠0 → L0661
        ПБ     L0662                    ,переход на L0662
        ПБ     L0652                    ,переход на L0652
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0666                    ,если СМ=0 → L0666
        ПБ     L0672                    ,переход на L0672
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L1555   СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
L1557   СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1566   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     2(М7)                    ,СМ -= 2(М7)
L1572   МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
L1573   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0174                    ,переход на L0174
        ПВ     TITLE(М15)               ,вызов через М15
L1577   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1600   СЧ     14(М7)                   ,СМ := 14(М7)
L1601   СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L1605   ПО     L0704                    ,если СМ=0 → L0704
L1606   ПБ     L0706                    ,переход на L0706
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     15(М7)                   ,СМ := 15(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0712                    ,если СМ=0 → L0712
        ПБ     L0714                    ,переход на L0714
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1624   УИА    L2717(М16)               ,М16 := L2717
L1625   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
L1632   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0720                    ,если СМ=0 → L0720
L1636   ПБ     L0722                    ,переход на L0722
L1637   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
L1641   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     17(М7)                   ,СМ := 17(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0726                    ,если СМ=0 → L0726
        ПБ     L0730                    ,переход на L0730
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0137                    ,переход на L0137
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0164                    ,переход на L0164
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *SCANER*(М16)            ,М16 := *SCANER*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3036(М16)               ,М16 := L3036
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2713(М16)               ,М16 := L2713
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
L1705   РЖА    '22'                     ,РЖ := '22'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
L1714   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L0753                    ,если СМ=0 → L0753
        ПБ     L0757                    ,переход на L0757
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
L1731   СЛ     L0001(М7)                ,СМ += L0001(М7)
L1732   МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L1736   УИА    L3035(М16)               ,М16 := L3035
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3036(М16)               ,М16 := L3036
        СЧИМ   М16                      ,стек := М16, СМ := М16
L1742   ПВ     I*MU*I(М15)              ,вызов через М15
L1743   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *NUST*+4                 ,мод.адрес +1: *NUST*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     41(М7)                   ,41 := СМ
L1756   РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        СЛ     L0127(М7)                ,СМ += L0127(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L1763   ЗП     42(М7)                   ,42 := СМ
L1764   УИА    L2757(М16)               ,М16 := L2757
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2760(М16)               ,М16 := L2760
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     DOUBLE(М15)              ,вызов через М15
L1772   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *NUST*+4                 ,мод.адрес +1: *NUST*+4
L1776   ЗП     SPAUD                    ,SPAUD := СМ
L1777   СЧ     42(М7)                   ,СМ := 42(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L2003   ЗП     SPAUD                    ,SPAUD := СМ
L2004   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L2013   ПО     L1007                    ,если СМ=0 → L1007
        ПБ     L1013                    ,переход на L1013
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L2017   СЧ     SPAUD                    ,СМ := SPAUD
L2020   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
L2024   РЖА    '22'                     ,РЖ := '22'
L2025   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *NUST*+4                 ,мод.адрес +1: *NUST*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L2034   СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     41(М7)                   ,41 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L2040   СЧ     SPAUD                    ,СМ := SPAUD
L2041   ЗП     42(М7)                   ,42 := СМ
        УИА    L2757(М16)               ,М16 := L2757
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2760(М16)               ,М16 := L2760
L2045   СЧИМ   М16                      ,стек := М16, СМ := М16
L2046   РЖА    '22'                     ,РЖ := '22'
        ПВ     DOUBLE(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L2052   СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L2053   МОДА   *NUST*+4                 ,мод.адрес +1: *NUST*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        ПБ     L2670                    ,переход на L2670
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L2063   СЧ     SPAUD                    ,СМ := SPAUD
L2064   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1037                    ,если СМ=0 → L1037
L2066   СЧ     11(М7)                   ,СМ := 11(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1037                    ,если СМ=0 → L1037
        ПБ     L1040                    ,переход на L1040
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1042                    ,переход на L1042
L2077   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2100   ПВ     COMANN(М15)              ,вызов через М15
L2101   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1057                    ,переход на L1057
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     11(М7)                   ,СМ := 11(М7)
L2105   СЧИМ                            ,СЧИ + магазин
L2106   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1046                    ,если СМ≠0 → L1046
        ПБ     L1047                    ,переход на L1047
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1051                    ,переход на L1051
L2115   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L2117   МОДА   *REGIM*+4                ,мод.адрес +1: *REGIM*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        ПБ     L1057                    ,переход на L1057
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L2123   МОДА   *REGIM*+12               ,мод.адрес +1: *REGIM*+12
L2124   ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *NUST*+11                ,мод.адрес +1: *NUST*+11
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+4                ,мод.адрес +1: *REGIM*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L2142   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1063                    ,если СМ=0 → L1063
        ПБ     L1067                    ,переход на L1067
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L2153   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
L2157   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2160   ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     15(М7)                   ,СМ := 15(М7)
        СЧИМ                            ,СЧИ + магазин
L2164   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L2166   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1075                    ,если СМ≠0 → L1075
        ПБ     L1076                    ,переход на L1076
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1120                    ,переход на L1120
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2174   ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     12(М7)                   ,СМ := 12(М7)
        СЧИМ                            ,СЧИ + магазин
L2200   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L2201   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1103                    ,если СМ≠0 → L1103
        ПБ     L1105                    ,переход на L1105
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
L2207   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2212   СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *REGIM*+13               ,мод.адрес +1: *REGIM*+13
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L2216   СЧ     SPAUD                    ,СМ := SPAUD
L2217   СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1113                    ,если СМ=0 → L1113
        ПБ     L1117                    ,переход на L1117
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L2233   ЗП     SPAUD                    ,SPAUD := СМ
L2234   РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2236   ПБ     L0164                    ,переход на L0164
L2237   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     12(М7)                   ,СМ := 12(М7)
        СЧИМ                            ,СЧИ + магазин
L2242   МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1124                    ,если СМ≠0 → L1124
        ПБ     L1126                    ,переход на L1126
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
L2252   ПВ     KLAIDA(М15)              ,вызов через М15
L2253   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     16(М7)                   ,СМ := 16(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1133                    ,если СМ≠0 → L1133
        ПБ     L1135                    ,переход на L1135
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SPAUD                    ,СМ := SPAUD
L2276   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1141                    ,если СМ=0 → L1141
        ПБ     L1142                    ,переход на L1142
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     43(М7)                   ,43 := СМ
L2310   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4126'(М7)               ,СМ := '4126'(М7)
        МОД    L2761                    ,мод.адрес по коду: L2761
        УИА    SPAUD(М1)                ,М1 := SPAUD
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     43(М7)                   ,СМ := 43(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     43(М7)                   ,43 := СМ
        ВЧОБ   27(М7)                   ,СМ := (адрес) - СМ
L2325   РЖА    '22'                     ,РЖ := '22'
        ПО     L1145                    ,если СМ=0 → L1145
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
L2331   ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
L2333   МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     44(М7)                   ,44 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     NUSTA(М15)               ,вызов через М15
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     44(М7)                   ,СМ := 44(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1163                    ,если СМ=0 → L1163
        ПБ     L1164                    ,переход на L1164
        ПВ     BEGPG(М15)               ,вызов через М15
L2347   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '4126'(М7)               ,СМ := '4126'(М7)
        ЗП     45(М7)                   ,45 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     46(М7)                   ,46 := СМ
L2361   СЧ     '4126'(М7)               ,СМ := '4126'(М7)
L2362   ЗП     47(М7)                   ,47 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
L2365   УИА    *SCANER*(М16)            ,М16 := *SCANER*
        СЧИМ   М16                      ,стек := М16, СМ := М16
L2367   УИА    L2763(М16)               ,М16 := L2763
L2370   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2713(М16)               ,М16 := L2713
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
L2375   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2376   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L2400   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     48(М7)                   ,48 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    L3062(М16)               ,М16 := L3062
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2766(М16)               ,М16 := L2766
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2765(М16)               ,М16 := L2765
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2713(М16)               ,М16 := L2713
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     47(М7)                   ,СМ := 47(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     45(М7)                   ,СМ := 45(М7)
L2423   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L2424   ПЕ     L1213                    ,если СМ≠0 → L1213
        ПБ     L1214                    ,переход на L1214
        ПБ     L1220                    ,переход на L1220
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОД    L2766                    ,мод.адрес по коду: L2766
        УИА    SPAUD(М1)                ,М1 := SPAUD
        МОДА   L3041(М1)                ,мод.адрес +1: L3041(М1)
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   L3064(М1)                ,мод.адрес +1: L3064(М1)
        ЗП     SPAUD                    ,SPAUD := СМ
        ПБ     L1226                    ,переход на L1226
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2440   СЧ     48(М7)                   ,СМ := 48(М7)
        РЖА    '3'                      ,РЖ := '3'
L2442   СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     48(М7)                   ,48 := СМ
        ВЧОБ   11(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L1202                    ,если СМ=0 → L1202
        СЧ     26(М7)                   ,СМ := 26(М7)
        ЗП     49(М7)                   ,49 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L2656                    ,переход на L2656
        ПБ     L0164                    ,переход на L0164
L2455   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L2457   СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     35(М7)                   ,35 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     '127'(М7)                ,СМ := '127'(М7)
L2463   ЗП     32(М7)                   ,32 := СМ
        СЧ     9(М7)                    ,СМ := 9(М7)
L2465   ЗП     31(М7)                   ,31 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0164                    ,переход на L0164
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     50(М7)                   ,50 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L1165                    ,переход на L1165
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     50(М7)                   ,СМ := 50(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1242                    ,если СМ=0 → L1242
        ПБ     L1243                    ,переход на L1243
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1214                    ,переход на L1214
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОД    L2766                    ,мод.адрес по коду: L2766
        УИА    SPAUD(М1)                ,М1 := SPAUD
        МОДА   L3041(М1)                ,мод.адрес +1: L3041(М1)
L2513   СЛ     SPAUD                    ,СМ += SPAUD
        МОДА   L3064(М1)                ,мод.адрес +1: L3064(М1)
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
L2520   СЧ     48(М7)                   ,СМ := 48(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1253                    ,если СМ≠0 → L1253
        ПБ     L1254                    ,переход на L1254
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1266                    ,переход на L1266
L2527   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
L2532   РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ВЧ     SPAUD                    ,СМ -= SPAUD
        МОДА   *COMTIT*+14              ,мод.адрес +1: *COMTIT*+14
        ЗП     SPAUD                    ,SPAUD := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *SCANER*(М16)            ,М16 := *SCANER*
        СЧИМ   М16                      ,стек := М16, СМ := М16
L2543   УИА    *COMTIT*(М16)            ,М16 := *COMTIT*
L2544   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2707(М16)               ,М16 := L2707
        СЧИМ   М16                      ,стек := М16, СМ := М16
L2547   УИА    *COMTIT*+14(М16)         ,М16 := *COMTIT*+14
L2550   СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2670                    ,переход на L2670
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     8(М7)                    ,СМ := 8(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L2563   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1274                    ,если СМ≠0 → L1274
        ПБ     L1275                    ,переход на L1275
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1573                    ,переход на L1573
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     3(М7)                    ,СМ := 3(М7)
L2575   СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L2601   ПЕ     L1302                    ,если СМ≠0 → L1302
        ПБ     L1303                    ,переход на L1303
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1452                    ,переход на L1452
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
L2607   МОДА   *REGIM*+10               ,мод.адрес +1: *REGIM*+10
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        МОДА   *NUST*+2                 ,мод.адрес +1: *NUST*+2
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *NUST*+3                 ,мод.адрес +1: *NUST*+3
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     51(М7)                   ,51 := СМ
L2620   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     13(М7)                   ,СМ := 13(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L2631   ПЕ     L1316                    ,если СМ≠0 → L1316
L2632   ПБ     L1320                    ,переход на L1320
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2724(М16)               ,М16 := L2724
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     52(М7)                   ,52 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2772(М16)               ,М16 := L2772
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3035(М16)               ,М16 := L3035
L2652   СЧИМ   М16                      ,стек := М16, СМ := М16
L2653   РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2656   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     52(М7)                   ,СМ := 52(М7)
        РЖА    '3'                      ,РЖ := '3'
L2662   СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     51(М7)                   ,СМ := 51(М7)
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     51(М7)                   ,51 := СМ
L2670   СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     51(М7)                   ,СМ := 51(М7)
L2673   РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1340                    ,если СМ≠0 → L1340
L2676   ПБ     L1341                    ,переход на L1341
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1346                    ,переход на L1346
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЛ     SPAUD                    ,СМ += SPAUD
L2706   ВЧ     1(М7)                    ,СМ -= 1(М7)
L2707   МОДА   *FORMA*+12               ,мод.адрес +1: *FORMA*+12
L2710   ЗП     SPAUD                    ,SPAUD := СМ
L2711   РЖА    '22'                     ,РЖ := '22'
        ПБ     L1311                    ,переход на L1311
L2713   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2714   СЧ     '127'(М7)                ,СМ := '127'(М7)
L2715   МОДА   *FORMA*+13               ,мод.адрес +1: *FORMA*+13
        ЗП     SPAUD                    ,SPAUD := СМ
L2717   МОДА   *FORMA*+12               ,мод.адрес +1: *FORMA*+12
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        МОДА   *FORMA*+13               ,мод.адрес +1: *FORMA*+13
L2724   ВЧ     SPAUD                    ,СМ -= SPAUD
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЛ     SPAUD                    ,СМ += SPAUD
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЛ     SPAUD                    ,СМ += SPAUD
L2731   РЖА    '22'                     ,РЖ := '22'
L2732   ПЕ     L1356                    ,если СМ≠0 → L1356
L2733   ПБ     L1360                    ,переход на L1360
L2734   УИА    L2731(М16)               ,М16 := L2731
        СЧИМ   М16                      ,стек := М16, СМ := М16
L2736   ПВ     KLAIDA(М15)              ,вызов через М15
L2737   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     52(М7)                   ,СМ := 52(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
L2743   РЖА    '3'                      ,РЖ := '3'
        МОДА   *FORMA*+12               ,мод.адрес +1: *FORMA*+12
        СЧ     SPAUD                    ,СМ := SPAUD
        СЛ     L0001(М7)                ,СМ += L0001(М7)
L2747   ЗП     53(М7)                   ,53 := СМ
L2750   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        УИА    L2710(М16)               ,М16 := L2710
L2753   ПВ     I*DI*I(М15)              ,вызов через М15
L2754   ЗП     54(М7)                   ,54 := СМ
L2755   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
L2757   СЧИМ                            ,СЧИ + магазин
L2760   СЧ     54(М7)                   ,СМ := 54(М7)
L2761   УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*MU*I(М15)              ,вызов через М15
L2763   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L2764   РЖА    '22'                     ,РЖ := '22'
L2765   НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
L2766   ПО     L1374                    ,если СМ=0 → L1374
L2767   ПБ     L1403                    ,переход на L1403
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
L2772   МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1400                    ,если СМ=0 → L1400
        ПБ     L1403                    ,переход на L1403
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L3000   СЧ     53(М7)                   ,СМ := 53(М7)
L3001   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0027(М7)                ,СМ += L0027(М7)
        ЗП     53(М7)                   ,53 := СМ
        РЖА    '22'                     ,РЖ := '22'
L3005   МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L3006   МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
L3011   МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
L3012   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1407                    ,если СМ≠0 → L1407
        ПБ     L1410                    ,переход на L1410
L3016   ПБ     L1417                    ,переход на L1417
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L3020   СЧ     53(М7)                   ,СМ := 53(М7)
L3021   МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ЗП     SPAUD                    ,SPAUD := СМ
L3023   РЖА    '3'                      ,РЖ := '3'
L3024   СЧ     53(М7)                   ,СМ := 53(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *NUST*+2                 ,мод.адрес +1: *NUST*+2
        СЧ     SPAUD                    ,СМ := SPAUD
L3031   ВЧ     1(М7)                    ,СМ -= 1(М7)
L3032   МОДА   *NUST*+2                 ,мод.адрес +1: *NUST*+2
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
L3035   ПБ     L1427                    ,переход на L1427
L3036   МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
L3037   СЧ     SPAUD                    ,СМ := SPAUD
L3040   СЧИМ                            ,СЧИ + магазин
L3041   МОДА   *FORMA*+12               ,мод.адрес +1: *FORMA*+12
L3042   СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1423                    ,если СМ=0 → L1423
        ПБ     L1427                    ,переход на L1427
        МОДА   *NUST*+2                 ,мод.адрес +1: *NUST*+2
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *NUST*+2                 ,мод.адрес +1: *NUST*+2
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     53(М7)                   ,СМ := 53(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *FORMA*+13               ,мод.адрес +1: *FORMA*+13
        СЛ     SPAUD                    ,СМ += SPAUD
L3062   ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     55(М7)                   ,55 := СМ
L3064   МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        СЛ     L0067(М7)                ,СМ += L0067(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L1436                    ,если СМ=0 → L1436
        ПБ     L1441                    ,переход на L1441
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     55(М7)                   ,СМ := 55(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1445                    ,если СМ=0 → L1445
        ПБ     L1451                    ,переход на L1451
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
L3122   ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1456                    ,если СМ≠0 → L1456
        ПБ     L1460                    ,переход на L1460
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1464                    ,если СМ=0 → L1464
        ПБ     L1466                    ,переход на L1466
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2733(М16)               ,М16 := L2733
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *REGIM*+11               ,мод.адрес +1: *REGIM*+11
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        МОДА   *NUST*+7                 ,мод.адрес +1: *NUST*+7
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+7                 ,мод.адрес +1: *NUST*+7
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1475                    ,если СМ≠0 → L1475
        ПБ     L1501                    ,переход на L1501
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NUST*+7                 ,мод.адрес +1: *NUST*+7
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NUST*+7                 ,мод.адрес +1: *NUST*+7
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     51(М7)                   ,51 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     13(М7)                   ,СМ := 13(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1510                    ,если СМ≠0 → L1510
        ПБ     L1512                    ,переход на L1512
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2724(М16)               ,М16 := L2724
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     52(М7)                   ,52 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2772(М16)               ,М16 := L2772
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3035(М16)               ,М16 := L3035
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     52(М7)                   ,СМ := 52(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     51(М7)                   ,СМ := 51(М7)
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     51(М7)                   ,51 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     51(М7)                   ,СМ := 51(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1532                    ,если СМ≠0 → L1532
        ПБ     L1533                    ,переход на L1533
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1535                    ,переход на L1535
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        МОДА   *NUST*+5                 ,мод.адрес +1: *NUST*+5
        ЗП     SPAUD                    ,SPAUD := СМ
        ПБ     L1503                    ,переход на L1503
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        МОДА   *NUST*+6                 ,мод.адрес +1: *NUST*+6
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЛ     SPAUD                    ,СМ += SPAUD
        МОДА   *PAGE*+2                 ,мод.адрес +1: *PAGE*+2
        СЛ     SPAUD                    ,СМ += SPAUD
        ЗП     56(М7)                   ,56 := СМ
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     SPAUD                    ,СМ += SPAUD
        МОДА   *PAGE*+5                 ,мод.адрес +1: *PAGE*+5
        СЛ     SPAUD                    ,СМ += SPAUD
        ЗП     57(М7)                   ,57 := СМ
        МОДА   *NUST*+5                 ,мод.адрес +1: *NUST*+5
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        СЛ     L0070(М7)                ,СМ += L0070(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L1555                    ,если СМ≠0 → L1555
        МОДА   *NUST*+6                 ,мод.адрес +1: *NUST*+6
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        СЛ     L0071(М7)                ,СМ += L0071(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L1555                    ,если СМ≠0 → L1555
        ПБ     L1557                    ,переход на L1557
        УИА    L2732(М16)               ,М16 := L2732
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     52(М7)                   ,СМ := 52(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1566                    ,если СМ=0 → L1566
        ПБ     L1572                    ,переход на L1572
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1577                    ,если СМ≠0 → L1577
        ПБ     L1600                    ,переход на L1600
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1601                    ,переход на L1601
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2347                    ,переход на L2347
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     10(М7)                   ,СМ := 10(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1605                    ,если СМ=0 → L1605
        ПБ     L1606                    ,переход на L1606
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1743                    ,переход на L1743
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        МОДА   *NRM*                    ,мод.адрес +1: *NRM*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     '4126'(М7)               ,СМ := '4126'(М7)
        ЗП     58(М7)                   ,58 := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     29(М7)                   ,29 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2743(М16)               ,М16 := L2743
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3000(М16)               ,М16 := L3000
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2713(М16)               ,М16 := L2713
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     28(М7)                   ,СМ := 28(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     58(М7)                   ,СМ := 58(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1624                    ,если СМ≠0 → L1624
        ПБ     L1625                    ,переход на L1625
        ПБ     L1637                    ,переход на L1637
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     READMK(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1632                    ,если СМ=0 → L1632
        ПБ     L1636                    ,переход на L1636
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     59(М7)                   ,59 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОД    L3001                    ,мод.адрес по коду: L3001
        УИА    SPAUD(М1)                ,М1 := SPAUD
        МОДА   *INS*+77777(М1)          ,мод.адрес +1: *INS*+77777(
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   L3122(М1)                ,мод.адрес +1: L3122(М1)
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     '4126'(М7)               ,СМ := '4126'(М7)
        МОД    L3001                    ,мод.адрес по коду: L3001
        УИА    SPAUD(М1)                ,М1 := SPAUD
        МОДА   *INS*+77777(М1)          ,мод.адрес +1: *INS*+77777(
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     59(М7)                   ,СМ := 59(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     59(М7)                   ,59 := СМ
        ВЧОБ   18(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L1641                    ,если СМ=0 → L1641
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     60(М7)                   ,60 := СМ
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     61(М7)                   ,61 := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     62(М7)                   ,62 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     WRIMAK(М15)              ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *VIE*+1                  ,мод.адрес +1: *VIE*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *VIE*                    ,мод.адрес +1: *VIE*
        ВЧ     SPAUD                    ,СМ -= SPAUD
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        ВЧ     SPAUD                    ,СМ -= SPAUD
        ЗП     63(М7)                   ,63 := СМ
        УИА    *MKR*(М16)               ,М16 := *MKR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *VIE*(М16)               ,М16 := *VIE*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *INS*+31(М16)            ,М16 := *INS*+31
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3005(М16)               ,М16 := L3005
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *RAK*                    ,мод.адрес +1: *RAK*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0164                    ,переход на L0164
        СЧ     60(М7)                   ,СМ := 60(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     61(М7)                   ,СМ := 61(М7)
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     62(М7)                   ,СМ := 62(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     '100'(М7)                ,'100' := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОД    L3006                    ,мод.адрес по коду: L3006
        УИА    SPAUD(М1)                ,М1 := SPAUD
        МОДА   L3122(М1)                ,мод.адрес +1: L3122(М1)
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+77777(М1)          ,мод.адрес +1: *INS*+77777(
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     '100'(М7)                ,СМ := '100'(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     '100'(М7)                ,'100' := СМ
        ВЧОБ   18(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L1714                    ,если СМ=0 → L1714
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *RAK*                    ,мод.адрес +1: *RAK*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NUST*+1                 ,мод.адрес +1: *NUST*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1731                    ,если СМ=0 → L1731
        ПБ     L1732                    ,переход на L1732
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2670                    ,переход на L2670
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1736                    ,если СМ=0 → L1736
        ПБ     L1742                    ,переход на L1742
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *MEDIUM*                 ,мод.адрес +1: *MEDIUM*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     TITLE(М15)               ,вызов через М15
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *MEDIUM*                 ,мод.адрес +1: *MEDIUM*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0267                    ,переход на L0267
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     TITLE(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L1763                    ,если СМ≠0 → L1763
        ПБ     L1764                    ,переход на L1764
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L1777                    ,переход на L1777
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *REGIM*+7                ,мод.адрес +1: *REGIM*+7
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L1772                    ,если СМ=0 → L1772
        ПБ     L1776                    ,переход на L1776
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     8(М7)                    ,СМ := 8(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2003                    ,если СМ≠0 → L2003
        ПБ     L2004                    ,переход на L2004
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2020                    ,переход на L2020
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *REGIM*+2                ,мод.адрес +1: *REGIM*+2
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2013                    ,если СМ=0 → L2013
        ПБ     L2017                    ,переход на L2017
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     15(М7)                   ,СМ := 15(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2024                    ,если СМ≠0 → L2024
        ПБ     L2025                    ,переход на L2025
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2041                    ,переход на L2041
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *REGIM*+1                ,мод.адрес +1: *REGIM*+1
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2034                    ,если СМ=0 → L2034
        ПБ     L2040                    ,переход на L2040
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     16(М7)                   ,СМ := 16(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2045                    ,если СМ≠0 → L2045
        ПБ     L2046                    ,переход на L2046
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2101                    ,переход на L2101
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2052                    ,если СМ=0 → L2052
        ПБ     L2053                    ,переход на L2053
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     '101'(М7)                ,'101' := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        СЧ     '101'(М7)                ,СМ := '101'(М7)
        УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2063                    ,если СМ=0 → L2063
        ПБ     L2064                    ,переход на L2064
        ПБ     L2066                    ,переход на L2066
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     '102'(М7)                ,'102' := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     NUSTA(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '102'(М7)                ,СМ := '102'(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2077                    ,если СМ=0 → L2077
        ПБ     L2100                    ,переход на L2100
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2105                    ,если СМ≠0 → L2105
        ПБ     L2106                    ,переход на L2106
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2160                    ,переход на L2160
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЛ     SPAUD                    ,СМ += SPAUD
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     '127'(М7)                ,'127' := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЛ     SPAUD                    ,СМ += SPAUD
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L2115                    ,если СМ≠0 → L2115
        ПБ     L2117                    ,переход на L2117
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2737(М16)               ,М16 := L2737
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ВЧ     SPAUD                    ,СМ -= SPAUD
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L2123                    ,если СМ≠0 → L2123
        ПБ     L2124                    ,переход на L2124
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2142                    ,переход на L2142
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ВЧ     SPAUD                    ,СМ -= SPAUD
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     '103'(М7)                ,'103' := СМ
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     '104'(М7)                ,'104' := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *SCANER*(М16)            ,М16 := *SCANER*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3012(М16)               ,М16 := L3012
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2713(М16)               ,М16 := L2713
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    L3011(М16)               ,М16 := L3011
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3012(М16)               ,М16 := L3012
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2153                    ,если СМ=0 → L2153
        ПБ     L2157                    ,переход на L2157
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2164                    ,если СМ≠0 → L2164
        ПБ     L2166                    ,переход на L2166
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2717(М16)               ,М16 := L2717
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+13               ,мод.адрес +1: *REGIM*+13
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2174                    ,если СМ=0 → L2174
        ПБ     L2200                    ,переход на L2200
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2207                    ,если СМ=0 → L2207
        ПБ     L2212                    ,переход на L2212
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *FIN*                    ,мод.адрес +1: *FIN*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FIN*                    ,мод.адрес +1: *FIN*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2216                    ,если СМ≠0 → L2216
        ПБ     L2217                    ,переход на L2217
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2237                    ,переход на L2237
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     '105'(М7)                ,'105' := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        СЧ     '105'(М7)                ,СМ := '105'(М7)
        УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2233                    ,если СМ=0 → L2233
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2233                    ,если СМ=0 → L2233
        ПБ     L2234                    ,переход на L2234
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2236                    ,переход на L2236
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *FIN*                    ,мод.адрес +1: *FIN*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L2670                    ,переход на L2670
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *NUST*+4                 ,мод.адрес +1: *NUST*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        ЗП     '131'(М7)                ,'131' := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     TITLE(М15)               ,вызов через М15
        СЧ     13(М7)                   ,СМ := 13(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2252                    ,если СМ≠0 → L2252
        ПБ     L2253                    ,переход на L2253
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L0164                    ,переход на L0164
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     52(М7)                   ,52 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2772(М16)               ,М16 := L2772
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3035(М16)               ,М16 := L3035
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     52(М7)                   ,СМ := 52(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        УИА    L3037(М16)               ,М16 := L3037
        ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ЗП     '106'(М7)                ,'106' := СМ
        СЧ     '106'(М7)                ,СМ := '106'(М7)
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        УИА    L3037(М16)               ,М16 := L3037
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЛ     L0127(М7)                ,СМ += L0127(М7)
        ЗП     '107'(М7)                ,'107' := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        СЛ     L0131(М7)                ,СМ += L0131(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     '110'(М7)                ,'110' := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '106'(М7)                ,СМ := '106'(М7)
        СДА    64-7                     ,сдвиг СМ влево на 7
        ПО     L2310                    ,если СМ=0 → L2310
        СЛЦ    SPAUD                    ,СМ += SPAUD [цикли.]
        ПО     L2310                    ,если СМ=0 → L2310
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    *SCANER*(М16)            ,М16 := *SCANER*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3016(М16)               ,М16 := L3016
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     DOUBLE(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '106'(М7)                ,СМ := '106'(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     '106'(М7)                ,'106' := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L2276                    ,переход на L2276
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0107(М7)                ,СМ += L0107(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     29(М7)                   ,29 := СМ
        УИА    *SCANER*(М16)            ,М16 := *SCANER*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2743(М16)               ,М16 := L2743
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     DOUBLE(М15)              ,вызов через М15
        СЧ     '110'(М7)                ,СМ := '110'(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2325                    ,если СМ=0 → L2325
        ПБ     L2331                    ,переход на L2331
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *NUST*+4                 ,мод.адрес +1: *NUST*+4
        ЗП     SPAUD                    ,SPAUD := СМ
        ПБ     L0164                    ,переход на L0164
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     52(М7)                   ,52 := СМ
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     46(М7)                   ,46 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2764(М16)               ,М16 := L2764
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3035(М16)               ,М16 := L3035
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     46(М7)                   ,СМ := 46(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     TITLE(М15)               ,вызов через М15
        ПБ     L0137                    ,переход на L0137
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     '111'(М7)                ,'111' := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        МОДА   *REGIM*+6                ,мод.адрес +1: *REGIM*+6
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     30(М7)                   ,30 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     30(М7)                   ,СМ := 30(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2361                    ,если СМ=0 → L2361
        ПБ     L2362                    ,переход на L2362
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2365                    ,если СМ≠0 → L2365
        ПБ     L2367                    ,переход на L2367
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     '127'(М7)                ,'127' := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L2670                    ,переход на L2670
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        ВЧ     SPAUD                    ,СМ -= SPAUD
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        ВЧ     SPAUD                    ,СМ -= SPAUD
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L2375                    ,если СМ≠0 → L2375
        ПБ     L2376                    ,переход на L2376
        ПБ     L2400                    ,переход на L2400
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L3020(М16)               ,М16 := L3020
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GETSTR(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '4126'(М7)               ,СМ := '4126'(М7)
        ЗП     '113'(М7)                ,'113' := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2707(М16)               ,М16 := L2707
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3021(М16)               ,М16 := L3021
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2707(М16)               ,М16 := L2707
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2711(М16)               ,М16 := L2711
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4144'(М7)               ,СМ := '4144'(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '113'(М7)                ,СМ := '113'(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2423                    ,если СМ=0 → L2423
        ПБ     L2424                    ,переход на L2424
        ПБ     L2653                    ,переход на L2653
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     '114'(М7)                ,'114' := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2714(М16)               ,М16 := L2714
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3021(М16)               ,М16 := L3021
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2707(М16)               ,М16 := L2707
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2711(М16)               ,М16 := L2711
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4145'(М7)               ,СМ := '4145'(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '113'(М7)                ,СМ := '113'(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2440                    ,если СМ=0 → L2440
        ПБ     L2442                    ,переход на L2442
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     '114'(М7)                ,'114' := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     '115'(М7)                ,'115' := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     '116'(М7)                ,'116' := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ЗП     54(М7)                   ,54 := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SPAUD                    ,СМ := SPAUD
        СЧИМ                            ,СЧИ + магазин
        СЧ     54(М7)                   ,СМ := 54(М7)
        УИА    L2710(М16)               ,М16 := L2710
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2455                    ,если СМ=0 → L2455
        ПБ     L2457                    ,переход на L2457
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     '115'(М7)                ,'115' := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SPAUD                    ,СМ := SPAUD
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2463                    ,если СМ≠0 → L2463
        ПБ     L2465                    ,переход на L2465
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     '116'(М7)                ,'116' := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     23(М7)                   ,СМ := 23(М7)
        УИА    L3023(М16)               ,М16 := L3023
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L3024(М16)               ,М16 := L3024
        ПВ     I*MU*I(М15)              ,вызов через М15
        ЗП     '117'(М7)                ,'117' := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     SPAUD                    ,СМ := SPAUD
        СЛ     L0004(М7)                ,СМ += L0004(М7)
        СЛ     L0117(М7)                ,СМ += L0117(М7)
        ЗП     '120'(М7)                ,'120' := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ВЧ     '127'(М7)                ,СМ -= '127'(М7)
        ЗП     29(М7)                   ,29 := СМ
        СЧ     9(М7)                    ,СМ := 9(М7)
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        УИА    L2743(М16)               ,М16 := L2743
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЛ     SPAUD                    ,СМ += SPAUD
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЛ     SPAUD                    ,СМ += SPAUD
        СЛ     L0117(М7)                ,СМ += L0117(М7)
        ЗП     '121'(М7)                ,'121' := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        ВЧ     SPAUD                    ,СМ -= SPAUD
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     '122'(М7)                ,'122' := СМ
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     '123'(М7)                ,'123' := СМ
        СЧ     '120'(М7)                ,СМ := '120'(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧ     6(М7)                    ,СМ -= 6(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L2513                    ,если СМ≠0 → L2513
        ПБ     L2520                    ,переход на L2520
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЛ     SPAUD                    ,СМ += SPAUD
        СЛ     L0117(М7)                ,СМ += L0117(М7)
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0122(М7)                ,СМ += L0122(М7)
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        ЗП     SPAUD                    ,SPAUD := СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        СЛ     L0121(М7)                ,СМ += L0121(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L2527                    ,если СМ≠0 → L2527
        ПБ     L2532                    ,переход на L2532
        СЧ     '121'(М7)                ,СМ := '121'(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ВЧ     SPAUD                    ,СМ -= SPAUD
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     '124'(М7)                ,'124' := СМ
        СЧ     '122'(М7)                ,СМ := '122'(М7)
        ВЧ     '124'(М7)                ,СМ -= '124'(М7)
        ЗП     '125'(М7)                ,'125' := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '127'(М7)                ,СМ := '127'(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2543                    ,если СМ=0 → L2543
        ПБ     L2544                    ,переход на L2544
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2563                    ,переход на L2563
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '125'(М7)                ,СМ := '125'(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПЕ     L2547                    ,если СМ≠0 → L2547
        ПБ     L2550                    ,переход на L2550
        ПБ     L2563                    ,переход на L2563
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '121'(М7)                ,СМ := '121'(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        ЗП     29(М7)                   ,29 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2736(М16)               ,М16 := L2736
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2743(М16)               ,М16 := L2743
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2715(М16)               ,М16 := L2715
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        СЧ     '121'(М7)                ,СМ := '121'(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0011(М7)                ,СМ += L0011(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3031(М16)               ,М16 := L3031
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*+31(М16)            ,М16 := *STR*+31
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L3032(М16)               ,М16 := L3032
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RNSYMB(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '126'(М7)                ,СМ := '126'(М7)
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2575                    ,если СМ=0 → L2575
        ПБ     L2601                    ,переход на L2601
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        ЗП     '126'(М7)                ,'126' := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     TOPAGE(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SPAUD                    ,СМ := SPAUD
        ЗП     37(М7)                   ,37 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L2620                    ,переход на L2620
        УИА    L2676(М16)               ,М16 := L2676
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2713(М16)               ,М16 := L2713
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2753(М16)               ,М16 := L2753
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     37(М7)                   ,СМ := 37(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     37(М7)                   ,37 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        ВЧОБ   SPAUD                    ,СМ := (адрес) - СМ
        ПО     L2607                    ,если СМ=0 → L2607
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     SPAUD                    ,СМ := SPAUD
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0114(М7)                ,СМ += L0114(М7)
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     SPAUD(М7)                ,СМ := SPAUD(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '125'(М7)                ,СМ := '125'(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SPAUD(М17)               ,СМ ^= SPAUD(М17)
        ПО     L2631                    ,если СМ=0 → L2631
        ПБ     L2632                    ,переход на L2632
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2652                    ,переход на L2652
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     '120'(М7)                ,СМ := '120'(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     '122'(М7)                ,СМ := '122'(М7)
        ВЧ     '124'(М7)                ,СМ -= '124'(М7)
        ЗП     '122'(М7)                ,'122' := СМ
        УИА    L2673(М16)               ,М16 := L2673
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L2707(М16)               ,М16 := L2707
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*+31(М16)            ,М16 := *STR*+31
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '123'(М7)                ,СМ := '123'(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0124(М7)                ,СМ += L0124(М7)
        ЗП     '123'(М7)                ,'123' := СМ
        СЧ     '120'(М7)                ,СМ := '120'(М7)
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ЗП     SPAUD                    ,SPAUD := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     '126'(М7)                ,'126' := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L2520                    ,переход на L2520
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        ПБ     L2670                    ,переход на L2670
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+6                ,мод.адрес +1: *REGIM*+6
        ЗП     SPAUD                    ,SPAUD := СМ
        ПВ     BEGSTR(М15)              ,вызов через М15
        ПБ     L0267                    ,переход на L0267
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        УИА    L2767(М16)               ,М16 := L2767
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L2670                    ,переход на L2670
        ПБ     L2670                    ,переход на L2670
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L2706(М7)                ,М7 := L2706
        ЗПМ    '133'(М7)                ,ЗП + магазин: '133'(М7)
        ЗПМ    '132'(М7)                ,ЗП + магазин: '132'(М7)
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SPAUD(М12)               ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SPAUD(М10)               ,переход через М10
        МОДА   SPAUD                    ,мод.адрес +1: SPAUD

