***************************************************
* STANDA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 21472 образа SIPROD.BIN
*   Длина при загрузке: 90 слов, 146 команд
*   Вход: STANDA
*   Внешние: *STAND*, *FORMA*, *PAGE*, *REGIM*, *LOL*, *NUST*, *NDAB*, 
*   *ARPI*, BEGPG, ENDPG, I*DI*I, I*MU*I
*   Смещения в *FORMA*: 7
*   Смещения в *LOL*: 7
*   Смещения в *NDAB*: 1, 2
*   Смещения в *STAND*: 1, 2
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
STANDA  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0101                    ,переход на L0101
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *ARPI*                   ,мод.адрес +1: *ARPI*
L0005   СЧ     STANDA                   ,СМ := STANDA
L0006   НТЖ    STANDA(М17)              ,СМ ^= STANDA(М17)
        ПО     L0005                    ,если СМ=0 → L0005
L0010   ПБ     L0006                    ,переход на L0006
        МОДА   STANDA                   ,мод.адрес +1: STANDA
L0012   ПБ     L0035                    ,переход на L0035
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        МОДА   *STAND*+1                ,мод.адрес +1: *STAND*+1
        СЧ     STANDA                   ,СМ := STANDA
        ЗП     6(М7)                    ,6 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     STANDA(М7)               ,СМ := STANDA(М7)
        МОДА   *STAND*+1                ,мод.адрес +1: *STAND*+1
        ЗП     STANDA                   ,STANDA := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     STANDA                   ,СМ := STANDA
        УИА    L0113(М16)               ,М16 := L0113
L0026   ПВ     I*DI*I(М15)              ,вызов через М15
L0027   МОДА   STANDA                   ,мод.адрес +1: STANDA
        ЗП     7(М7)                    ,7 := СМ
L0031   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     STANDA                   ,СМ := STANDA
        СЧИМ                            ,СЧИ + магазин
        СЧ     7(М7)                    ,СМ := 7(М7)
L0035   УИА    L0113(М16)               ,М16 := L0113
        ПВ     I*MU*I(М15)              ,вызов через М15
L0037   МОДА   STANDA                   ,мод.адрес +1: STANDA
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    STANDA(М17)              ,СМ ^= STANDA(М17)
        ПО     L0026                    ,если СМ=0 → L0026
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     STANDA                   ,СМ := STANDA
L0050   НТЖ    STANDA(М17)              ,СМ ^= STANDA(М17)
        ПО     L0026                    ,если СМ=0 → L0026
        ПБ     L0027                    ,переход на L0027
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        ПБ     L0031                    ,переход на L0031
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *STAND*+1                ,мод.адрес +1: *STAND*+1
        ЗП     STANDA                   ,STANDA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОД    L0121                    ,мод.адрес по коду: L0121
L0077   УИА    STANDA(М1)               ,М1 := STANDA
L0100   МОДА   L0123(М1)                ,мод.адрес +1: L0123(М1)
L0101   СЧ     STANDA                   ,СМ := STANDA
        МОДА   *PAGE*+77777(М1)         ,мод.адрес +1: *PAGE*+77777
        ЗП     STANDA                   ,STANDA := СМ
        СЧ     8(М7)                    ,СМ := 8(М7)
        РЖА    '3'                      ,РЖ := '3'
L0106   СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     8(М7)                    ,8 := СМ
        ВЧОБ   3(М7)                    ,СМ := (адрес) - СМ
L0111   РЖА    '22'                     ,РЖ := '22'
        ПО     L0037                    ,если СМ=0 → L0037
L0113   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
L0117   МОДА   STANDA                   ,мод.адрес +1: STANDA
        МОД    L0121                    ,мод.адрес по коду: L0121
L0121   УИА    STANDA(М1)               ,М1 := STANDA
L0122   МОДА   L0121(М1)                ,мод.адрес +1: L0121(М1)
L0123   СЧ     STANDA                   ,СМ := STANDA
        МОДА   *LOL*+77777(М1)          ,мод.адрес +1: *LOL*+77777(
        ЗП     STANDA                   ,STANDA := СМ
        МОД    L0121                    ,мод.адрес по коду: L0121
        УИА    STANDA(М1)               ,М1 := STANDA
        МОДА   L0121(М1)                ,мод.адрес +1: L0121(М1)
        СЧ     STANDA                   ,СМ := STANDA
        МОДА   *FORMA*+77777(М1)        ,мод.адрес +1: *FORMA*+7777
        ЗП     STANDA                   ,STANDA := СМ
        МОДА   L0121(М1)                ,мод.адрес +1: L0121(М1)
        СЧ     STANDA                   ,СМ := STANDA
        МОДА   *LOL*+7(М1)              ,мод.адрес +1: *LOL*+7(М1)
        ЗП     STANDA                   ,STANDA := СМ
        МОДА   L0121(М1)                ,мод.адрес +1: L0121(М1)
        СЧ     STANDA                   ,СМ := STANDA
        МОДА   *FORMA*+7(М1)            ,мод.адрес +1: *FORMA*+7(М1
        ЗП     STANDA                   ,STANDA := СМ
        СЧ     8(М7)                    ,СМ := 8(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     8(М7)                    ,8 := СМ
        ВЧОБ   4(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0050                    ,если СМ=0 → L0050
        СЧ     5(М7)                    ,СМ := 5(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        ЗП     STANDA                   ,STANDA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     5(М7)                    ,СМ := 5(М7)
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        ЗП     STANDA                   ,STANDA := СМ
        СЧ     5(М7)                    ,СМ := 5(М7)
        МОДА   *STAND*                  ,мод.адрес +1: *STAND*
        ЗП     STANDA                   ,STANDA := СМ
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *ARPI*                   ,мод.адрес +1: *ARPI*
        СЧ     STANDA                   ,СМ := STANDA
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    STANDA(М17)              ,СМ ^= STANDA(М17)
        ПЕ     L0077                    ,если СМ≠0 → L0077
        ПБ     L0100                    ,переход на L0100
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        ПБ     L0106                    ,переход на L0106
        МОДА   STANDA                   ,мод.адрес +1: STANDA
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0111(М7)                ,М7 := L0111
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     STANDA(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     STANDA(М10)              ,переход через М10
        МОДА   STANDA                   ,мод.адрес +1: STANDA

