***************************************************
* TARNYB - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 8960 образа SIPROD.BIN
*   Длина при загрузке: 248 слов, 470 команд
*   Вход: TARNYB
*   Внешние: *PAGE*, *TYPE*, *KORT*, *NOTF*, *WHO*, *SAL*, HOWSMB, RASPS, 
*   WHATYP, GOTOPO, WRIKOR, CSTRIN, ENDKOR
*   Смещения в *KORT*: 14
*   Смещения в *NOTF*: 1, 2
*   Смещения в *PAGE*: 1
*   Смещения в *TYPE*: 1, 11, 12, 13
*   Смещения в *WHO*: 1
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
TARNYB  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0344                    ,переход на L0344
L0002   МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
L0003   СЧ     TARNYB                   ,СМ := TARNYB
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDKOR(М15)              ,вызов через М15
L0010   УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0012   УИА    L0364(М16)               ,М16 := L0364
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0014   ПВ     CSTRIN(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОД    *TYPE*                   ,мод.адрес по коду: *TYPE*
        ПБ     L0010                    ,переход на L0010
        ПБ     L0014                    ,переход на L0014
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0143                    ,переход на L0143
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0225                    ,переход на L0225
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *TYPE*+15                ,мод.адрес +1: *TYPE*+15
        СЛ     TARNYB                   ,СМ += TARNYB
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЧ     TARNYB                   ,СМ := TARNYB
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ВЧ     TARNYB                   ,СМ -= TARNYB
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NOTF*+2                 ,мод.адрес +1: *NOTF*+2
L0051   ЗП     TARNYB                   ,TARNYB := СМ
L0052   РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDKOR(М15)              ,вызов через М15
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0356(М16)               ,М16 := L0356
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
L0063   МОДА   TARNYB                   ,мод.адрес +1: TARNYB
L0064   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        ЗП     TARNYB                   ,TARNYB := СМ
        УИА    L0353(М16)               ,М16 := L0353
L0075   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0356(М16)               ,М16 := L0356
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     WRIKOR(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    *NOTF*(М16)              ,М16 := *NOTF*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GOTOPO(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        СЧ     1(М7)                    ,СМ := 1(М7)
L0113   СЧИМ                            ,СЧИ + магазин
L0114   МОДА   *TYPE*+13                ,мод.адрес +1: *TYPE*+13
        СЧ     TARNYB                   ,СМ := TARNYB
        НТЖ    TARNYB(М17)              ,СМ ^= TARNYB(М17)
        ПЕ     L0051                    ,если СМ≠0 → L0051
        ПБ     L0052                    ,переход на L0052
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0124                    ,переход на L0124
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
L0124   МОДА   *TYPE*+1                 ,мод.адрес +1: *TYPE*+1
        СЧ     TARNYB                   ,СМ := TARNYB
        ЗП     9(М7)                    ,9 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *TYPE*+15                ,мод.адрес +1: *TYPE*+15
        СЧ     TARNYB                   ,СМ := TARNYB
        ЗП     10(М7)                   ,10 := СМ
        РЖА    '22'                     ,РЖ := '22'
L0134   ПВ     WHATYP(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TYPE*+14                ,мод.адрес +1: *TYPE*+14
        СЧ     TARNYB                   ,СМ := TARNYB
        НТЖ    TARNYB(М17)              ,СМ ^= TARNYB(М17)
L0143   ПО     L0063                    ,если СМ=0 → L0063
        ПБ     L0064                    ,переход на L0064
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0075                    ,переход на L0075
L0147   МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        СЧ     TARNYB                   ,СМ := TARNYB
L0152   РЖА    '3'                      ,РЖ := '3'
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        СЧ     TARNYB                   ,СМ := TARNYB
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *NOTF*+2                 ,мод.адрес +1: *NOTF*+2
        СЧ     TARNYB                   ,СМ := TARNYB
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        МОДА   *NOTF*+2                 ,мод.адрес +1: *NOTF*+2
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *SAL*                    ,мод.адрес +1: *SAL*
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    L0365(М16)               ,М16 := L0365
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0366(М16)               ,М16 := L0366
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     WRIKOR(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        ЗП     TARNYB                   ,TARNYB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TYPE*+14                ,мод.адрес +1: *TYPE*+14
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    TARNYB(М17)              ,СМ ^= TARNYB(М17)
        ПЕ     L0113                    ,если СМ≠0 → L0113
L0225   ПБ     L0114                    ,переход на L0114
        ПБ     L0343                    ,переход на L0343
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
L0231   СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *TYPE*+15                ,мод.адрес +1: *TYPE*+15
L0234   СЛ     TARNYB                   ,СМ += TARNYB
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЧ     TARNYB                   ,СМ := TARNYB
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ВЧ     TARNYB                   ,СМ -= TARNYB
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NOTF*+2                 ,мод.адрес +1: *NOTF*+2
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '22'                     ,РЖ := '22'
        УИА    *TYPE*+1(М16)            ,М16 := *TYPE*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *TYPE*+15(М16)           ,М16 := *TYPE*+15
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИА    *NOTF*+1(М16)            ,М16 := *NOTF*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GOTOPO(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПВ     ENDKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИА    *NOTF*+1(М16)            ,М16 := *NOTF*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *NOTF*+2(М16)            ,М16 := *NOTF*+2
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     CSTRIN(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0343                    ,переход на L0343
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   TARNYB                   ,СМ := (адрес) - СМ
        СЛ     TARNYB(М7)               ,СМ += TARNYB(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0147                    ,если СМ=0 → L0147
        ПБ     L0152                    ,переход на L0152
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0360(М16)               ,М16 := L0360
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
L0333   МОДА   TARNYB                   ,мод.адрес +1: TARNYB
L0334   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    *NOTF*(М16)              ,М16 := *NOTF*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0363(М16)               ,М16 := L0363
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0342   УИА    L0363(М16)               ,М16 := L0363
L0343   СЧИМ   М16                      ,стек := М16, СМ := М16
L0344   УИА    L0367(М16)               ,М16 := L0367
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0361(М16)               ,М16 := L0361
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0356(М16)               ,М16 := L0356
L0351   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RASPS(М15)               ,вызов через М15
L0353   МОДА   TARNYB                   ,мод.адрес +1: TARNYB
L0354   РЖА    '3'                      ,РЖ := '3'
L0355   РЖА    '22'                     ,РЖ := '22'
L0356   УИА    L0367(М16)               ,М16 := L0367
L0357   СЧИМ   М16                      ,стек := М16, СМ := М16
L0360   ПВ     HOWSMB(М15)              ,вызов через М15
L0361   МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
L0363   РЖА    '22'                     ,РЖ := '22'
L0364   УИА    L0367(М16)               ,М16 := L0367
L0365   СЧИМ   М16                      ,стек := М16, СМ := М16
L0366   УИА    *WHO*(М16)               ,М16 := *WHO*
L0367   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *WHO*+1(М16)             ,М16 := *WHO*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0357(М16)               ,М16 := L0357
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    *TYPE*+1(М16)            ,М16 := *TYPE*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *TYPE*+15(М16)           ,М16 := *TYPE*+15
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0356(М16)               ,М16 := L0356
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЧ     TARNYB                   ,СМ := TARNYB
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ВЧ     TARNYB                   ,СМ -= TARNYB
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NOTF*+2                 ,мод.адрес +1: *NOTF*+2
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0134                    ,переход на L0134
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   TARNYB                   ,СМ := (адрес) - СМ
        СЛ     TARNYB(М7)               ,СМ += TARNYB(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0231                    ,если СМ=0 → L0231
        ПБ     L0234                    ,переход на L0234
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0360(М16)               ,М16 := L0360
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    *NOTF*(М16)              ,М16 := *NOTF*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0363(М16)               ,М16 := L0363
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0363(М16)               ,М16 := L0363
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0367(М16)               ,М16 := L0367
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0361(М16)               ,М16 := L0361
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0356(М16)               ,М16 := L0356
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RASPS(М15)               ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    L0367(М16)               ,М16 := L0367
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     HOWSMB(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    L0367(М16)               ,М16 := L0367
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *WHO*(М16)               ,М16 := *WHO*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *WHO*+1(М16)             ,М16 := *WHO*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0357(М16)               ,М16 := L0357
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    *TYPE*+1(М16)            ,М16 := *TYPE*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *TYPE*+15(М16)           ,М16 := *TYPE*+15
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        ЗП     TARNYB                   ,TARNYB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     WHATYP(М15)              ,вызов через М15
        УИА    *TYPE*+1(М16)            ,М16 := *TYPE*+1
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *TYPE*+15(М16)           ,М16 := *TYPE*+15
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0356(М16)               ,М16 := L0356
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *KORT*+16                ,мод.адрес +1: *KORT*+16
        ЗП     TARNYB                   ,TARNYB := СМ
        УИА    L0353(М16)               ,М16 := L0353
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0356(М16)               ,М16 := L0356
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     WRIKOR(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        СЧ     TARNYB                   ,СМ := TARNYB
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        ЗП     TARNYB                   ,TARNYB := СМ
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *PAGE*+1                 ,мод.адрес +1: *PAGE*+1
        СЧ     TARNYB                   ,СМ := TARNYB
        МОДА   *NOTF*+1                 ,мод.адрес +1: *NOTF*+1
        ВЧ     TARNYB                   ,СМ -= TARNYB
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *NOTF*+2                 ,мод.адрес +1: *NOTF*+2
        ЗП     TARNYB                   ,TARNYB := СМ
        МОДА   *NOTF*                   ,мод.адрес +1: *NOTF*
        СЧ     TARNYB                   ,СМ := TARNYB
        ВЧОБ   TARNYB                   ,СМ := (адрес) - СМ
        СЛ     TARNYB(М7)               ,СМ += TARNYB(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0333                    ,если СМ≠0 → L0333
        ПБ     L0334                    ,переход на L0334
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0342                    ,переход на L0342
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПВ     ENDKOR(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИА    L0355(М16)               ,М16 := L0355
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0364(М16)               ,М16 := L0364
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     CSTRIN(М15)              ,вызов через М15
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0343                    ,переход на L0343
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0134                    ,переход на L0134
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        ПБ     L0351                    ,переход на L0351
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0354(М7)                ,М7 := L0354
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     TARNYB(М12)              ,переход через М12
        МОДА   TARNYB                   ,мод.адрес +1: TARNYB
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     TARNYB(М10)              ,переход через М10

