***************************************************
* TITLE - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 15872 образа SIPROD.BIN
*   Длина при загрузке: 178 слов, 316 команд
*   Вход: TITLE
*   Внешние: *PAGE*, *NDAB*, *STR*, *INS*, *MEDIUM*, RNSYMB, RSYMB, BEGSTR, 
*   ENDSTR, BEGPG, ENDPG, I*DI*I
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *NDAB*: 1
*   Смещения в *PAGE*: 3, 4, 5
*   Смещения в *STR*: 24, 25, 26
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
TITLE   СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0227                    ,переход на L0227
L0002   СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *MEDIUM*                 ,мод.адрес +1: *MEDIUM*
L0005   СЧ     TITLE                    ,СМ := TITLE
L0006   НТЖ    TITLE(М17)               ,СМ ^= TITLE(М17)
        ПЕ     L0005                    ,если СМ≠0 → L0005
L0010   ПБ     L0006                    ,переход на L0006
        МОДА   TITLE                    ,мод.адрес +1: TITLE
L0012   ПБ     L0014                    ,переход на L0014
L0013   МОДА   TITLE                    ,мод.адрес +1: TITLE
L0014   МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     TITLE                    ,СМ := TITLE
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     TITLE                    ,СМ := TITLE
        НТЖ    TITLE(М17)               ,СМ ^= TITLE(М17)
L0022   ПО     L0012                    ,если СМ=0 → L0012
L0023   ПБ     L0013                    ,переход на L0013
        ПБ     L0027                    ,переход на L0027
L0025   МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПБ     L0025                    ,переход на L0025
L0027   МОДА   TITLE                    ,мод.адрес +1: TITLE
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     TITLE                    ,СМ := TITLE
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        ВЧ     TITLE                    ,СМ -= TITLE
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        ВЧ     TITLE                    ,СМ -= TITLE
L0037   СЛ     L0002(М7)                ,СМ += L0002(М7)
        РЖА    '22'                     ,РЖ := '22'
L0041   ПЕ     L0022                    ,если СМ≠0 → L0022
        ПБ     L0023                    ,переход на L0023
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПБ     L0025                    ,переход на L0025
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
L0052   ПВ     ENDSTR(М15)              ,вызов через М15
L0053   МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     TITLE                    ,СМ := TITLE
L0060   РЖА    '3'                      ,РЖ := '3'
L0061   МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0062   ВЧ     TITLE                    ,СМ -= TITLE
        СЛ     TITLE(М7)                ,СМ += TITLE(М7)
        ЗП     6(М7)                    ,6 := СМ
        МОДА   *INS*+30                 ,мод.адрес +1: *INS*+30
        СЧ     TITLE                    ,СМ := TITLE
        ЗП     7(М7)                    ,7 := СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     TITLE                    ,СМ := TITLE
        ВЧ     TITLE(М7)                ,СМ -= TITLE(М7)
L0073   ЗП     8(М7)                    ,8 := СМ
        РЖА    '22'                     ,РЖ := '22'
L0075   МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     '4026'(М7)               ,СМ := '4026'(М7)
        ЗП     9(М7)                    ,9 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0101   РЖА    '22'                     ,РЖ := '22'
L0102   УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0247(М16)               ,М16 := L0247
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0251(М16)               ,М16 := L0251
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0243(М16)               ,М16 := L0243
L0111   СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4027'(М7)               ,СМ := '4027'(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     9(М7)                    ,СМ := 9(М7)
        НТЖ    TITLE(М17)               ,СМ ^= TITLE(М17)
        ПЕ     L0052                    ,если СМ≠0 → L0052
        ПБ     L0053                    ,переход на L0053
L0124   ПБ     L0062                    ,переход на L0062
L0125   МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     7(М7)                    ,СМ := 7(М7)
        РЖА    '3'                      ,РЖ := '3'
L0130   СЛ     TITLE(М7)                ,СМ += TITLE(М7)
        ЗП     7(М7)                    ,7 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        ВЧОБ   TITLE                    ,СМ := (адрес) - СМ
L0134   СЛ     L0010(М7)                ,СМ += L0010(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0060                    ,если СМ≠0 → L0060
        ПБ     L0061                    ,переход на L0061
L0140   ПБ     L0226                    ,переход на L0226
L0141   МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПБ     L0041                    ,переход на L0041
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     8(М7)                    ,СМ := 8(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     7(М7)                    ,СМ -= 7(М7)
        СЛ     TITLE(М7)                ,СМ += TITLE(М7)
        ЗП     10(М7)                   ,10 := СМ
        ЗП     11(М7)                   ,11 := СМ
L0152   СЧ     6(М7)                    ,СМ := 6(М7)
L0153   ВЧ     3(М7)                    ,СМ -= 3(М7)
        ЗП     12(М7)                   ,12 := СМ
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
L0157   МОДА   *MEDIUM*                 ,мод.адрес +1: *MEDIUM*
        СЧ     TITLE                    ,СМ := TITLE
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    TITLE(М17)               ,СМ ^= TITLE(М17)
L0163   ПО     L0073                    ,если СМ=0 → L0073
        ПБ     L0075                    ,переход на L0075
L0165   МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     6(М7)                    ,СМ := 6(М7)
        ЗП     12(М7)                   ,12 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     10(М7)                   ,СМ := 10(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   TITLE                    ,СМ := (адрес) - СМ
        СЛ     L0014(М7)                ,СМ += L0014(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0101                    ,если СМ=0 → L0101
        ПБ     L0102                    ,переход на L0102
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПБ     L0157                    ,переход на L0157
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     12(М7)                   ,СМ := 12(М7)
        ЗП     13(М7)                   ,13 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     7(М7)                    ,СМ := 7(М7)
L0210   СЛ     L0014(М7)                ,СМ += L0014(М7)
L0211   СЛ     TITLE(М7)                ,СМ += TITLE(М7)
        ЗП     14(М7)                   ,14 := СМ
        СЧ     '4026'(М7)               ,СМ := '4026'(М7)
        ЗП     9(М7)                    ,9 := СМ
L0215   СЧ     TITLE(М7)                ,СМ := TITLE(М7)
L0216   ЗП     15(М7)                   ,15 := СМ
        РЖА    '22'                     ,РЖ := '22'
L0220   ПБ     L0130                    ,переход на L0130
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     14(М7)                   ,СМ := 14(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     TITLE(М7)                ,СМ -= TITLE(М7)
        ЗП     14(М7)                   ,14 := СМ
L0226   УИА    *INS*(М16)               ,М16 := *INS*
L0227   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0256(М16)               ,М16 := L0256
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0251(М16)               ,М16 := L0251
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0234   УИА    L0243(М16)               ,М16 := L0243
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
L0240   РЖА    '3'                      ,РЖ := '3'
L0241   РЖА    '22'                     ,РЖ := '22'
        СЧ     '4027'(М7)               ,СМ := '4027'(М7)
L0243   СЧИМ                            ,СЧИ + магазин
        СЧ     9(М7)                    ,СМ := 9(М7)
        НТЖ    TITLE(М17)               ,СМ ^= TITLE(М17)
        ПО     L0124                    ,если СМ=0 → L0124
L0247   ПБ     L0125                    ,переход на L0125
        ПБ     L0134                    ,переход на L0134
L0251   МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     15(М7)                   ,СМ := 15(М7)
        РЖА    '3'                      ,РЖ := '3'
L0254   СЛ     TITLE(М7)                ,СМ += TITLE(М7)
        ЗП     15(М7)                   ,15 := СМ
L0256   РЖА    '22'                     ,РЖ := '22'
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ВЧОБ   13(М7)                   ,СМ := (адрес) - СМ
L0261   ПО     L0111                    ,если СМ=0 → L0111
        СЧ     7(М7)                    ,СМ := 7(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0014(М7)                ,СМ += L0014(М7)
        ЗП     14(М7)                   ,14 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     14(М7)                   ,СМ := 14(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     TITLE(М7)                ,СМ -= TITLE(М7)
        ЗП     14(М7)                   ,14 := СМ
        ВЧ     7(М7)                    ,СМ -= 7(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0140                    ,если СМ≠0 → L0140
        ПБ     L0141                    ,переход на L0141
        ПБ     L0226                    ,переход на L0226
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0256(М16)               ,М16 := L0256
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0251(М16)               ,М16 := L0251
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0243(М16)               ,М16 := L0243
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4027'(М7)               ,СМ := '4027'(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     9(М7)                    ,СМ := 9(М7)
        НТЖ    TITLE(М17)               ,СМ ^= TITLE(М17)
        ПО     L0152                    ,если СМ=0 → L0152
        ПБ     L0153                    ,переход на L0153
        ПБ     L0134                    ,переход на L0134
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     14(М7)                   ,СМ := 14(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     7(М7)                    ,СМ -= 7(М7)
        СЛ     TITLE(М7)                ,СМ += TITLE(М7)
        ЗП     12(М7)                   ,12 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0165                    ,переход на L0165
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     12(М7)                   ,СМ := 12(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   TITLE                    ,СМ := (адрес) - СМ
        СЛ     L0012(М7)                ,СМ += L0012(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0163                    ,если СМ≠0 → L0163
        ПБ     L0165                    ,переход на L0165
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     10(М7)                   ,СМ := 10(М7)
        ЗП     12(М7)                   ,12 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     6(М7)                    ,СМ := 6(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     12(М7)                   ,СМ -= 12(М7)
        УИА    L0241(М16)               ,М16 := L0241
        ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ЗП     16(М7)                   ,16 := СМ
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЛ     TITLE                    ,СМ += TITLE
        ЗП     17(М7)                   ,17 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0247(М16)               ,М16 := L0247
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0261(М16)               ,М16 := L0261
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0254(М16)               ,М16 := L0254
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     7(М7)                    ,СМ := 7(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0014(М7)                ,СМ += L0014(М7)
        ЗП     7(М7)                    ,7 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        ВЧОБ   TITLE                    ,СМ := (адрес) - СМ
        СЛ     L0010(М7)                ,СМ += L0010(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0210                    ,если СМ=0 → L0210
        ПБ     L0211                    ,переход на L0211
        ПБ     L0037                    ,переход на L0037
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *MEDIUM*                 ,мод.адрес +1: *MEDIUM*
        СЧ     TITLE                    ,СМ := TITLE
        НТЖ    TITLE(М17)               ,СМ ^= TITLE(М17)
        ПО     L0215                    ,если СМ=0 → L0215
        ПБ     L0216                    ,переход на L0216
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПБ     L0226                    ,переход на L0226
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     TITLE(М7)                ,СМ := TITLE(М7)
        ЗП     15(М7)                   ,15 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        СЧ     15(М7)                   ,СМ := 15(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     TITLE(М7)                ,СМ += TITLE(М7)
        ЗП     15(М7)                   ,15 := СМ
        ВЧОБ   1(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0220                    ,если СМ=0 → L0220
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        ПБ     L0234                    ,переход на L0234
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0240(М7)                ,М7 := L0240
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     TITLE(М12)               ,переход через М12
        МОДА   TITLE                    ,мод.адрес +1: TITLE
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     TITLE(М10)               ,переход через М10

