***************************************************
* ADRSEK - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 18656 образа SIPROD.BIN
*   Длина при загрузке: 68 слов, 118 команд
*   Вход: ADRSEK
*   Внешние: *LYG*, *ADR*, *TAB*, *NRD*, *PAGE*, *NDAB*, *REGIM*, *NDABL*, 
*   RSYMB, I*MU*I
*   Смещения в *ADR*: 1, 2, 3
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1
*   Смещения в *NDABL*: 1
*   Смещения в *NRD*: 24
*   Смещения в *PAGE*: 1
*   Смещения в *TAB*: 1, 2, 3, 4
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
ADRSEK  СТАРТ  0
        УИА    ADR2(М16)                ,М16 := ADR2
ADR2    ПБ     L0064                    ,переход на L0064
        СЧ     ADRSEK(М7)               ,СМ := ADRSEK(М7)
        МОДА   *ADR*+2                  ,мод.адрес +1: *ADR*+2
        ЗП     ADRSEK                   ,ADRSEK := СМ
ADR3    РЖА    '3'                      ,РЖ := '3'
        СЧ     ADRSEK(М7)               ,СМ := ADRSEK(М7)
        МОДА   *ADR*+3                  ,мод.адрес +1: *ADR*+3
TAB     ЗП     ADRSEK                   ,ADRSEK := СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
RSYMB   СЧ     ADRSEK                   ,СМ := ADRSEK
        СЛ     ADR2(М7)                 ,СМ += ADR2(М7)
        ЗП     6(М7)                    ,6 := СМ
        УИА    *NRD*(М16)               ,М16 := *NRD*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *TAB*(М16)               ,М16 := *TAB*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *ADR*+2(М16)             ,М16 := *ADR*+2
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    СИМ27(М16)               ,М16 := СИМ27
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
        УИА    *NRD*(М16)               ,М16 := *NRD*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0101(М16)               ,М16 := L0101
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *ADR*+3(М16)             ,М16 := *ADR*+3
L0035   СЧИМ   М16                      ,стек := М16, СМ := М16
RSYMB2  УИА    СИМ27(М16)               ,М16 := СИМ27
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
L0042   РЖА    '3'                      ,РЖ := '3'
ADR22   РЖА    '22'                     ,РЖ := '22'
        МОДА   *ADR*+2                  ,мод.адрес +1: *ADR*+2
        СЧ     ADRSEK                   ,СМ := ADRSEK
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЛ     ADRSEK                   ,СМ += ADRSEK
ADR23   МОДА   *ADR*+2                  ,мод.адрес +1: *ADR*+2
        ЗП     ADRSEK                   ,ADRSEK := СМ
        МОДА   *ADR*+3                  ,мод.адрес +1: *ADR*+3
        СЧ     ADRSEK                   ,СМ := ADRSEK
        МОДА   *PAGE*                   ,мод.адрес +1: *PAGE*
        СЛ     ADRSEK                   ,СМ += ADRSEK
        МОДА   *ADR*+3                  ,мод.адрес +1: *ADR*+3
        ЗП     ADRSEK                   ,ADRSEK := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
L0064   СЧ     ADRSEK                   ,СМ := ADRSEK
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    ADRSEK(М17)              ,СМ ^= ADRSEK(М17)
        ПЕ     L0035                    ,если СМ≠0 → L0035
        ПБ     RSYMB2                   ,переход на RSYMB2
V1      МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
        ПБ     ADR23                    ,переход на ADR23
V12     МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
        СЧ     ADRSEK(М7)               ,СМ := ADRSEK(М7)
СИМ27   СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ27                    ,мод.адрес +1: СИМ27
        СЧ     ADRSEK                   ,СМ := ADRSEK
        НТЖ    ADRSEK(М17)              ,СМ ^= ADRSEK(М17)
L0101   ПО     L0042                    ,если СМ=0 → L0042
L0102   ПБ     ADR22                    ,переход на ADR22
IMUI    МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
        ПБ     ADR23                    ,переход на ADR23
        МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
        МОДА   *ADR*+2                  ,мод.адрес +1: *ADR*+2
        СЧ     ADRSEK                   ,СМ := ADRSEK
        РЖА    '3'                      ,РЖ := '3'
        СЛ     ADR3(М7)                 ,СМ += ADR3(М7)
        МОДА   *ADR*+2                  ,мод.адрес +1: *ADR*+2
        ЗП     ADRSEK                   ,ADRSEK := СМ
        МОДА   *ADR*+3                  ,мод.адрес +1: *ADR*+3
        СЧ     ADRSEK                   ,СМ := ADRSEK
        СЛ     ADR3(М7)                 ,СМ += ADR3(М7)
        МОДА   *ADR*+3                  ,мод.адрес +1: *ADR*+3
        ЗП     ADRSEK                   ,ADRSEK := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        СЧ     ADRSEK                   ,СМ := ADRSEK
        ЗП     7(М7)                    ,7 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     ADRSEK                   ,СМ := ADRSEK
        ЗП     8(М7)                    ,8 := СМ
        СЧ     4(М7)                    ,СМ := 4(М7)
        УИА    L0102(М16)               ,М16 := L0102
        ПВ     I*MU*I(М15)              ,вызов через М15
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        МОДА   *ADR*                    ,мод.адрес +1: *ADR*
        ЗП     ADRSEK                   ,ADRSEK := СМ
        СЧ     4(М7)                    ,СМ := 4(М7)
        УИА    IMUI(М16)                ,М16 := IMUI
        ПВ     I*MU*I(М15)              ,вызов через М15
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        МОДА   *ADR*+1                  ,мод.адрес +1: *ADR*+1
        ЗП     ADRSEK                   ,ADRSEK := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V1                       ,переход на V1
        МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    V12(М7)                  ,М7 := V12
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     ADRSEK(М12)              ,переход через М12
        МОДА   ADRSEK                   ,мод.адрес +1: ADRSEK
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     ADRSEK(М10)              ,переход через М10

