***************************************************
* AIRB - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5824 образа SIPROD.BIN
*   Длина при загрузке: 75 слов, 150 команд
*   Вход: AIRB
*   Внешние: KONSTA
*   Регистры: М1, М2, М3, М4, М5, М6, М7, М10, М11, М12, М13, М14, М15, 
*   М16, М17
***************************************************
AIRB    СТАРТ  0
        СЧИМ   М15                      ,стек := М15, СМ := М15
        ПВ     KONSTA(М15)              ,вызов через М15
        ЗПМ    9(М12)                   ,ЗП + магазин: 9(М12)
        УИМ    М16                      ,М16 := СМ + стек
L0004   УИМ    М13                      ,М13 := СМ + стек
        УИМ    М11                      ,М11 := СМ + стек
        УИ     М14                      ,М14 := СМ
L0007   СЧ     AIRB                     ,СМ := AIRB
        СЧМ    AIRB(М13)                ,магазин + СЧ: AIRB(М13)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   3(М10)                   ,СМ := (адрес) - СМ
        УИМ    М13                      ,М13 := СМ + стек
        СЛИА   1(М13)                   ,М13 += 1
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        СЧМ    AIRB(М14)                ,магазин + СЧ: AIRB(М14)
        И      AIRB(М11)                ,СМ &= AIRB(М11)
        СЛИА   1(М14)                   ,М14 += 1
        ЧЕД    AIRB(М17)                ,СМ := кол-во единиц в AIRB(М17)
        СЛИА   1(М11)                   ,М11 += 1
        ЦИКЛ   L0007(М13)               ,М13-- и если ≠0 → повтор
KONSTA  ИЛИ    3(М10)                   ,СМ |= 3(М10)
        ЗПМ    AIRB(М16)                ,ЗП + магазин: AIRB(М16)
        РЖА    '6'                      ,РЖ := '6'
        МОД    9(М12)                   ,мод.адрес по коду: 9(М12)
        ПБ     AIRB                     ,переход на AIRB
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        СЧИМ   М15                      ,стек := М15, СМ := М15
        ПВ     KONSTA(М15)              ,вызов через М15
        ЗПМ    9(М12)                   ,ЗП + магазин: 9(М12)
        УИМ    М16                      ,М16 := СМ + стек
        УИ     М13                      ,М13 := СМ
        СЧ     AIRB(М13)                ,СМ := AIRB(М13)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   3(М10)                   ,СМ := (адрес) - СМ
        УИМ    М13                      ,М13 := СМ + стек
        УИМ    М15                      ,М15 := СМ + стек
L0044   СЛИА   1(М13)                   ,М13 += 1
        УИМ    М11                      ,М11 := СМ + стек
        УИ     М14                      ,М14 := СМ
        СЧ     AIRB                     ,СМ := AIRB
        СЧМ    AIRB(М14)                ,магазин + СЧ: AIRB(М14)
        И      AIRB(М11)                ,СМ &= AIRB(М11)
L0052   СЛИА   1(М14)                   ,М14 += 1
L0053   ЗП     AIRB(М15)                ,AIRB := СМ
        СЛИА   1(М11)                   ,М11 += 1
        ЧЕД    AIRB(М17)                ,СМ := кол-во единиц в AIRB(М17)
L0056   СЛИА   1(М15)                   ,М15 += 1
        ЦИКЛ   KONSTA(М13)              ,М13-- и если ≠0 → повтор
L0060   ИЛИ    3(М10)                   ,СМ |= 3(М10)
L9      ЗПМ    AIRB(М16)                ,ЗП + магазин: AIRB(М16)
        РЖА    '6'                      ,РЖ := '6'
        МОД    9(М12)                   ,мод.адрес по коду: 9(М12)
        ПБ     AIRB                     ,переход на AIRB
        МОДА   AIRB                     ,мод.адрес +1: AIRB
L0066   СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М7                       ,стек := М7, СМ := М7
        СЧИМ   М15                      ,стек := М15, СМ := М15
KONSTB  ПВ     KONSTA(М15)              ,вызов через М15
        ЗПМ    9(М12)                   ,ЗП + магазин: 9(М12)
        ЗПМ    12(М12)                  ,ЗП + магазин: 12(М12)
        ЗПМ    20(М12)                  ,ЗП + магазин: 20(М12)
L0075   УИМ    М2                       ,М2 := СМ + стек
L0076   УИМ    М1                       ,М1 := СМ + стек
L0077   УИМ    М11                      ,М11 := СМ + стек
        УИ     М13                      ,М13 := СМ
L0101   РЖА    '3'                      ,РЖ := '3'
        СЧ     AIRB(М13)                ,СМ := AIRB(М13)
L0103   ВЧОБ   3(М10)                   ,СМ := (адрес) - СМ
        УИМ    М13                      ,М13 := СМ + стек
        УИМ    М14                      ,М14 := СМ + стек
L0071   УИА    СИМ2(М7)                 ,М7 := СИМ2
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        СЧИМ   М6(М7)                   ,стек := М6, СМ := М6
        ЦИКЛ   L0044(М7)                ,М7-- и если ≠0 → повтор
        СЛИА   1(М13)                   ,М13 += 1
        УИА    48(М7)                   ,М7 := 48
        УИА    AIRB(М16)                ,М16 := AIRB
        СЧМ    AIRB(М11)                ,магазин + СЧ: AIRB(М11)
        УИА    AIRB(М5)                 ,М5 := AIRB
        СЛИА   1(М11)                   ,М11 += 1
        СЛИА   1(М17)                   ,М17 += 1
        СДА    64+32                    ,сдвиг СМ вправо на 32
        ПЕ     L0052                    ,если СМ≠0 → L0052
        ПБ     L0077                    ,переход на L0077
        ПВ     KONSTB(М15)              ,вызов через М15
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        УИА    СИМ3(М6)                 ,М6 := СИМ3
        СЧ     AIRB(М14)                ,СМ := AIRB(М14)
        СЛИА   1(М14)                   ,М14 += 1
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        СЧМ    AIRB                     ,магазин + СЧ: AIRB
        ЗП     '4004'(М17)              ,'4004' := СМ
        СЛИА   СИМ5(М5)                 ,М5 += СИМ5
        УИИ    М4(М5)                   ,М4 := М5
        СЛИ    М4(М3)                   ,М4 += М3
        ПИО    L9(М4)                   ,если ИР=0 → L9(М4)
        ЦИКЛ   L0056(М6)                ,М6-- и если ≠0 → повтор
        ПБ     L0066                    ,переход на L0066
        СЧ     AIRB(М10)                ,СМ := AIRB(М10)
        ПВ     KONSTB(М15)              ,вызов через М15
        СДА    64(М6)                   ,сдвиг СМ на 64(М6)
        И      '4005'(М17)              ,СМ &= '4005'(М17)
        ПО     L0060                    ,если СМ=0 → L0060
        ИЛИ    '4004'(М17)              ,СМ |= '4004'(М17)
        ЗП     '4004'(М17)              ,'4004' := СМ
        СЛИА   1(М16)                   ,М16 += 1
        ПБ     L0060                    ,переход на L0060
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        СЧ     '4004'(М17)              ,СМ := '4004'(М17)
        СЛИА   1(М1)                    ,М1 += 1
        ЗП     '4005'(М1)               ,'4005' := СМ
        СЛИА   СИМ5(М17)                ,М17 += СИМ5
        ЦИКЛ   L0053(М13)               ,М13-- и если ≠0 → повтор
        ПБ     L0103                    ,переход на L0103
        СЛИА   СИМ6(М7)                 ,М7 += СИМ6
        СЧМ    AIRB(М11)                ,магазин + СЧ: AIRB(М11)
        СДА    64(М7)                   ,сдвиг СМ на 64(М7)
        УИМ    М3                       ,М3 := СМ + стек
        ПИНО   L0075(М7)                ,если ИР≠0 → L0075(М7)
        СЛИА   1(М11)                   ,М11 += 1
        УИА    48(М7)                   ,М7 := 48
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        ПИО    L0076(М3)                ,если ИР=0 → L0076(М3)
        ПБ     AIRB(М15)                ,переход через М15
        СЧ     '4004'(М17)              ,СМ := '4004'(М17)
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        ЗП     AIRB(М1)                 ,AIRB := СМ
        СЛИА   СИМ5(М17)                ,М17 += СИМ5
        ПИО    L0103(М13)               ,если ИР=0 → L0103(М13)
        СЧ     AIRB                     ,СМ := AIRB
        СЛИА   1(М1)                    ,М1 += 1
        ЗП     AIRB(М1)                 ,AIRB := СМ
        ЦИКЛ   L0101(М13)               ,М13-- и если ≠0 → повтор
        МОДА   AIRB                     ,мод.адрес +1: AIRB
        СЧИ    М16                      ,СМ := М16
        ИЛИ    3(М10)                   ,СМ |= 3(М10)
        ЗП     AIRB(М2)                 ,AIRB := СМ
        СЛИА   СИМ5(М17)                ,М17 += СИМ5
        СЧ     AIRB(М17)                ,СМ := AIRB(М17)
        УИА    6(М15)                   ,М15 := 6
        УИМ    (М15)                    ,М15 := СМ + стек
        СЛИА   СИМ5(М15)                ,М15 += СИМ5
        ПИНО   L0071(М15)               ,если ИР≠0 → L0071(М15)
        МОД    12(М12)                  ,мод.адрес по коду: 12(М12)
        УИА    AIRB(М7)                 ,М7 := AIRB
        МОД    20(М12)                  ,мод.адрес по коду: 20(М12)
        УИА    AIRB(М1)                 ,М1 := AIRB
        РЖА    '6'                      ,РЖ := '6'
        МОД    9(М12)                   ,мод.адрес по коду: 9(М12)
        ПБ     AIRB                     ,переход на AIRB

