***************************************************
* BEGPG - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 13792 образа SIPROD.BIN
*   Длина при загрузке: 438 слов, 780 команд
*   Вход: BEGPG
*   Выход: ENDSTR:FRAMEA, HEADIN:TITLEA, HEADIN:REGIMA, HEADIN:INS26B+1, 
*   NUSTA:REGIMJ+1, RASTXT:TXTB+1, RASTXT:TXTB+1, RASTXT:TXTB+1, 
*   SEGTAB:NDABD, SEKLYG:LYG4F+1, SPAUD:V30A, SPAUD:V44, SPAUD:SCAN90+1, 
*   SPAUD:SCAN90+1, SPAUD:SCAN90+1, SPAUD:SCAN90+1, STANDA:STANDB, 
*   STANDA:STANDK+1, TITLE:ENDSTA, V13A (возврат через М12), 
*   V13A (возврат через М10)
*   НАЧАЛО СТРАНИЦЫ (РАЗМЕТКА).
*   Внешние: NDAB, STR, COMTIT, NUST, DYD, PUFOR, STAND, LYG, SEK, PUS, 
*   APJ, EGO, PAGE, REGIM, FT571, FT003, WTBACK, RASPS, RSYMB, BEGSTR, 
*   ENDSTR, RNSYMB, IDII, IMUI
*   Смещения в COMTIT: 12
*   Смещения в DYD: 1, 2
*   Смещения в EGO: 2400, 4800, 7200
*   Смещения в LYG: 1, 2
*   Смещения в NDAB: 1, 2, 3
*   Смещения в NUST: 1
*   Смещения в PAGE: 1, 2, 3, 4, 5
*   Смещения в PUFOR: 1, 2, 3, 4, 5, 6
*   Смещения в REGIM: 3, 4, 5, 7
*   Смещения в SEK: 2, 3
*   Смещения в STAND: 1
*   Смещения в STR: 24, 25, 26
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 NDAB
*   002 NDAB1
*   003 NDAB2
*   004 NDAB3
*   005 STR
*   006 STR24
*   007 STR25
*   008 STR26
*   009 COMTIT
*   010 COMTIT12
*   011 NUST
*   012 DYD
*   013 DYD1
*   014 DYD2
*   015 PUFOR
*   016 STAND
*   017 STAND1
*   018 LYG
*   019 LYG1
*   020 LYG2
*   021 SEK
*   022 PUS
*   023 APJ
*   024 EGO
*   025 EGO2400
*   026 EGO4800
*   027 EGO7200
*   028 PAGE
*   029 PAGE1
*   030 PAGE2
*   031 PAGE3
*   032 PAGE4
*   033 PAGE5
*   034 REGIM
*   035 FT571
*   036 FT003
*   037 WTBACK
*   038 RASPS
*   039 RSYMB
*   040 BEGSTR
*   041 ENDSTR
*   042 RNSYMB
*   043 IDII
*   044 PUFOR1
*   045 PUFOR2
*   046 PUFOR3
*   047 PUFOR4
*   048 PUFOR5
*   049 NUST1
*   050 IMUI
*   051 REGIM3
*   052 REGIM5
*   053 REGIM4
*   055 EGO32767
*   056 PUFOR6
*   057 SEK3
*   058 REGIM7
*   059 SEK2
*
*** КОД МОДУЛЯ
*
BEGPG    СТАРТ  0
         УИА    NDABA(М16)              ,М16 := NDABA
NDABA    ПБ     STANDD                  ,переход на STANDD
*
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         УИА    V7A(М16)                ,М16 := V7A
         ПВ     IDII(М15)               ,вызов через М15
         ЗП     16(М7)                  ,16 := СМ
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         МОДА   PAGE                    ,мод.адрес +1: PAGE
         СЧ     0                       ,СМ := 0
         МОДА   PUFOR                   ,мод.адрес +1: PUFOR
         ЗП     0                       ,0 := СМ
         МОДА   PAGE1                   ,мод.адрес +1: PAGE1
         СЧ     0                       ,СМ := 0
         МОДА   PUFOR1                  ,мод.адрес +1: PUFOR1
         ЗП     0                       ,0 := СМ
         МОДА   PAGE2                   ,мод.адрес +1: PAGE2
         СЧ     0                       ,СМ := 0
         МОДА   PUFOR2                  ,мод.адрес +1: PUFOR2
         ЗП     0                       ,0 := СМ
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
NDAB1A   СЧ     0                       ,СМ := 0
         МОДА   PUFOR3                  ,мод.адрес +1: PUFOR3
         ЗП     0                       ,0 := СМ
         МОДА   PAGE4                   ,мод.адрес +1: PAGE4
NDAB1B   СЧ     0                       ,СМ := 0
         МОДА   PUFOR4                  ,мод.адрес +1: PUFOR4
         ЗП     0                       ,0 := СМ
NDAB1C   МОДА   PAGE5                   ,мод.адрес +1: PAGE5
         СЧ     0                       ,СМ := 0
         МОДА   PUFOR5                  ,мод.адрес +1: PUFOR5
         ЗП     0                       ,0 := СМ
NDAB1D   СЧ     12(М7)                  ,СМ := 12(М7)
NDAB1E   ЗП     17(М7)                  ,17 := СМ
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         УИА    V7A(М16)                ,М16 := V7A
         ПВ     IDII(М15)               ,вызов через М15
         ЗП     18(М7)                  ,18 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
NDAB1F   ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   DYD1                    ,мод.адрес +1: DYD1
NDAB1G   СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     NDAB1A                  ,если СМ≠0 → NDAB1A
         ПБ     NDAB1C                  ,переход на NDAB1C
*
NUST1A   МОДА   0                       ,мод.адрес +1: 0
NUST1B   СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
NUST1C   НТЖ    0(М17)                  ,СМ ^= 0(М17)
NUST1D   ПО     NDAB1B                  ,если СМ=0 → NDAB1B
         ПБ     NDAB1C                  ,переход на NDAB1C
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
NDAB1H   СЧ     0                       ,СМ := 0
NDAB1I   МОДА   DYD1                    ,мод.адрес +1: DYD1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
NDAB1J   РЖА    '22'                    ,РЖ := '22'
NDAB1K   СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NDAB1D                  ,если СМ=0 → NDAB1D
         ПБ     NDAB1E                  ,переход на NDAB1E
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NDAB1L                  ,переход на NDAB1L
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    STANDI(М16)             ,М16 := STANDI
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     FT571(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     FT003(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
NDAB1L   ЗП     19(М7)                  ,19 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         СЧ     18(М7)                  ,СМ := 18(М7)
         УИА    V7A(М16)                ,М16 := V7A
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NDAB1F                  ,если СМ≠0 → NDAB1F
         ПБ     NDAB1G                  ,переход на NDAB1G
*
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     19(М7)                  ,19 := СМ
REGIMA   РЖА    '3'                     ,РЖ := '3'
REGIMB   РЖА    '22'                    ,РЖ := '22'
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM3                  ,мод.адрес +1: REGIM3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST1A                  ,если СМ=0 → NUST1A
REGIMC   ПБ     NUST1B                  ,переход на NUST1B
*
V1       МОДА   0                       ,мод.адрес +1: 0
REGIMD   ПБ     NUST1B                  ,переход на NUST1B
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
REGIME   МОДА   REGIM5                  ,мод.адрес +1: REGIM5
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
REGIMF   ПО     NUST1C                  ,если СМ=0 → NUST1C
         ПБ     NUST1D                  ,переход на NUST1D
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NDAB1L                  ,переход на NDAB1L
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
REGIMG   МОДА   REGIM4                  ,мод.адрес +1: REGIM4
REGIMH   СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NDAB1H                  ,если СМ≠0 → NDAB1H
REGIMI   ПБ     NDAB1I                  ,переход на NDAB1I
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STANDB                  ,переход на STANDB
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
V19      СЧ     19(М7)                  ,СМ := 19(М7)
V19A     НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NDAB1J                  ,если СМ=0 → NDAB1J
         ПБ     NDAB1K                  ,переход на NDAB1K
*
         ПБ     NUST1B                  ,переход на NUST1B
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR26                   ,мод.адрес +1: STR26
STR26A   СЧ     0                       ,СМ := 0
STR26B   РЖА    '3'                     ,РЖ := '3'
         МОДА   STR25                   ,мод.адрес +1: STR25
         ВЧ     0                       ,СМ -= 0
         МОДА   COMTIT12                ,мод.адрес +1: COMTIT12
STR26C   ВЧ     0                       ,СМ -= 0
STR26D   УИА    V7A(М16)                ,М16 := V7A
         ПВ     IDII(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
STR25A   СЛ     0                       ,СМ += 0
STR25B   ЗП     20(М7)                  ,20 := СМ
STR25C   УИА    COMTIT(М16)             ,М16 := COMTIT
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STANDK(М16)             ,М16 := STANDK
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V13(М16)                ,М16 := V13
         СЧИМ   М16                     ,стек := М16, СМ := М16
STR25D   УИА    COMTIT12(М16)           ,М16 := COMTIT12
STR25E   СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RNSYMB(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STANDB                  ,переход на STANDB
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
STR25F   СЧ     0                       ,СМ := 0
STR25G   ЗП     21(М7)                  ,21 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         ЗП     22(М7)                  ,22 := СМ
         МОДА   PAGE                    ,мод.адрес +1: PAGE
         СЧ     0                       ,СМ := 0
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   STR25                   ,мод.адрес +1: STR25
         ЗП     0                       ,0 := СМ
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
STR25H   СЧИМ                           ,СЧИ + магазин
         СЧ     18(М7)                  ,СМ := 18(М7)
         УИА    V7A(М16)                ,М16 := V7A
         ПВ     IMUI(М15)               ,вызов через М15
         РЖА    '22'                    ,РЖ := '22'
REGIMJ   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     REGIMA                  ,если СМ≠0 → REGIMA
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
REGIMK   СЧИМ                           ,СЧИ + магазин
REGIML   МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     REGIMA                  ,если СМ=0 → REGIMA
         ПБ     REGIMB                  ,переход на REGIMB
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     REGIMD                  ,переход на REGIMD
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     11(М7)                  ,СМ += 11(М7)
         МОДА   STR25                   ,мод.адрес +1: STR25
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND                   ,мод.адрес +1: STAND
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
STR25I   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     REGIMC                  ,если СМ=0 → REGIMC
         ПБ     V1                      ,переход на V1
*
         ПБ     REGIMD                  ,переход на REGIMD
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V19A                    ,переход на V19A
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND                   ,мод.адрес +1: STAND
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     REGIME                  ,если СМ=0 → REGIME
         ПБ     REGIMF                  ,переход на REGIMF
*
STANDA   МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   STAND                   ,мод.адрес +1: STAND
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   APJ                     ,мод.адрес +1: APJ
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     REGIMG                  ,если СМ=0 → REGIMG
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     REGIMG                  ,если СМ=0 → REGIMG
         ПБ     REGIMH                  ,переход на REGIMH
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V19A                    ,переход на V19A
*
         МОДА   0                       ,мод.адрес +1: 0
V1A      СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     23(М7)                  ,23 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V19                     ,переход на V19
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     '4066'(М7)              ,СМ := '4066'(М7)
         МОД    ADDR                    ,мод.адрес по коду: ADDR
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
EGO327   ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     23(М7)                  ,СМ := 23(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     23(М7)                  ,23 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ВЧОБ   17(М7)                  ,СМ := (адрес) - СМ
EGO32A   ПО     REGIMI                  ,если СМ=0 → REGIMI
         МОДА   STR25                   ,мод.адрес +1: STR25
EGO32B   СЧ     0                       ,СМ := 0
         МОДА   PUFOR6                  ,мод.адрес +1: PUFOR6
         ЗП     0                       ,0 := СМ
EGO32C   СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR26A                  ,если СМ≠0 → STR26A
         ПБ     STR26B                  ,переход на STR26B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR25C                  ,переход на STR25C
*
         МОДА   0                       ,мод.адрес +1: 0
SEK3A    СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
SEK3B    ПО     STR26C                  ,если СМ=0 → STR26C
         ПБ     STR26D                  ,переход на STR26D
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR25C                  ,переход на STR25C
*
APJA     МОДА   0                       ,мод.адрес +1: 0
APJB     СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   APJ                     ,мод.адрес +1: APJ
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     STR25A                  ,если СМ=0 → STR25A
         ПБ     STR25B                  ,переход на STR25B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR25C                  ,переход на STR25C
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STANDB                  ,переход на STANDB
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
STR25J   СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
STR25K   МОДА   PAGE1                   ,мод.адрес +1: PAGE1
         СЛ     0                       ,СМ += 0
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         МОДА   STR26                   ,мод.адрес +1: STR26
         ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM7                  ,мод.адрес +1: REGIM7
STR25L   СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR25D                  ,если СМ≠0 → STR25D
         ПБ     STR25E                  ,переход на STR25E
*
         ПБ     SEK3B                   ,переход на SEK3B
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     3(М7)                   ,СМ -= 3(М7)
         ЗП     24(М7)                  ,24 := СМ
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     25(М7)                  ,25 := СМ
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         МОДА   PAGE4                   ,мод.адрес +1: PAGE4
         СЛ     0                       ,СМ += 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         УИА    PAGE3B(М16)             ,М16 := PAGE3B
         ПВ     IMUI(М15)               ,вызов через М15
         ЗП     26(М7)                  ,26 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND                   ,мод.адрес +1: STAND
STANDB   СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR25F                  ,если СМ≠0 → STR25F
STANDC   ПБ     STR25G                  ,переход на STR25G
*
V7       МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR25H                  ,переход на STR25H
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
STR25M   СЧ     0                       ,СМ := 0
STR25N   РЖА    '3'                     ,РЖ := '3'
         МОДА   PAGE                    ,мод.адрес +1: PAGE
         ВЧ     0                       ,СМ -= 0
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     24(М7)                  ,24 := СМ
STR25O   МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         МОДА   PAGE2                   ,мод.адрес +1: PAGE2
         СЛ     0                       ,СМ += 0
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     25(М7)                  ,25 := СМ
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         МОДА   PAGE4                   ,мод.адрес +1: PAGE4
         СЛ     0                       ,СМ += 0
         МОДА   PAGE5                   ,мод.адрес +1: PAGE5
         СЛ     0                       ,СМ += 0
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         УИА    PAGE3B(М16)             ,М16 := PAGE3B
IMUIA    ПВ     IMUI(М15)               ,вызов через М15
STANDD   ЗП     26(М7)                  ,26 := СМ
         РЖА    '22'                    ,РЖ := '22'
         СЧ     26(М7)                  ,СМ := 26(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     8(М7)                   ,СМ -= 8(М7)
STANDE   ЗП     27(М7)                  ,27 := СМ
         СЧ     24(М7)                  ,СМ := 24(М7)
         ВЧ     1(М7)                   ,СМ -= 1(М7)
STANDF   ЗП     28(М7)                  ,28 := СМ
STANDG   СЧ     1(М7)                   ,СМ := 1(М7)
STANDH   ЗП     23(М7)                  ,23 := СМ
         РЖА    '22'                    ,РЖ := '22'
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND                   ,мод.адрес +1: STAND
         СЧ     0                       ,СМ := 0
STANDI   НТЖ    0(М17)                  ,СМ ^= 0(М17)
STANDJ   ПО     REGIMK                  ,если СМ=0 → REGIMK
STANDK   ПБ     REGIML                  ,переход на REGIML
*
V7A      МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR25I                  ,переход на STR25I
*
         МОДА   0                       ,мод.адрес +1: 0
PAGE3A   СЧ     23(М7)                  ,СМ := 23(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     13(М7)                  ,13 := СМ
PAGE3B   МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         ВЧ     3(М7)                   ,СМ -= 3(М7)
         ЗП     14(М7)                  ,14 := СМ
PAGE3C   СЧ     2(М7)                   ,СМ := 2(М7)
PAGE3D   ВЧ     23(М7)                  ,СМ -= 23(М7)
PAGE3E   ЗП     15(М7)                  ,15 := СМ
         СЧ     26(М7)                  ,СМ := 26(М7)
         УИА    PAGE3C(М16)             ,М16 := PAGE3C
         ПВ     IMUI(М15)               ,вызов через М15
         ЗП     13(М7)                  ,13 := СМ
V13      СЧ     14(М7)                  ,СМ := 14(М7)
         УИА    PAGE3E(М16)             ,М16 := PAGE3E
         ПВ     IMUI(М15)               ,вызов через М15
ADDR     УИА    PAGE3B(М16)             ,М16 := PAGE3B
         ПВ     IMUI(М15)               ,вызов через М15
         СЛ     13(М7)                  ,СМ += 13(М7)
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     29(М7)                  ,29 := СМ
PAGE1A   МОДА   PAGE1                   ,мод.адрес +1: PAGE1
PAGE1B   СЧ     0                       ,СМ := 0
PAGE1C   СЛ     5(М7)                   ,СМ += 5(М7)
         ЗП     13(М7)                  ,13 := СМ
PAGE1D   СЧ     23(М7)                  ,СМ := 23(М7)
PAGE1E   ВЧ     1(М7)                   ,СМ -= 1(М7)
PAGE1F   ЗП     14(М7)                  ,14 := СМ
PAGE1G   СЧ     13(М7)                  ,СМ := 13(М7)
         УИА    PAGE3D(М16)             ,М16 := PAGE3D
IMUIB    ПВ     IMUI(М15)               ,вызов через М15
V13A     МОДА   0                       ,мод.адрес +1: 0
         СЛ     28(М7)                  ,СМ += 28(М7)
         ЗП     28(М7)                  ,28 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     STANDA                  ,переход на STANDA
*
         СЧ     23(М7)                  ,СМ := 23(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     13(М7)                  ,13 := СМ
         СЧ     26(М7)                  ,СМ := 26(М7)
         УИА    PAGE3C(М16)             ,М16 := PAGE3C
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     29(М7)                  ,29 := СМ
         МОДА   PAGE                    ,мод.адрес +1: PAGE
         СЧ     0                       ,СМ := 0
         МОДА   PAGE1                   ,мод.адрес +1: PAGE1
         СЛ     0                       ,СМ += 0
         МОДА   PAGE2                   ,мод.адрес +1: PAGE2
         СЛ     0                       ,СМ += 0
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     13(М7)                  ,13 := СМ
         СЧ     23(М7)                  ,СМ := 23(М7)
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     14(М7)                  ,14 := СМ
         СЧ     13(М7)                  ,СМ := 13(М7)
         УИА    PAGE3D(М16)             ,М16 := PAGE3D
         ПВ     IMUI(М15)               ,вызов через М15
         СЛ     28(М7)                  ,СМ += 28(М7)
         ЗП     28(М7)                  ,28 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     24(М7)                  ,СМ := 24(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     13(М7)                  ,13 := СМ
         УИА    STANDH(М16)             ,М16 := STANDH
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE3A(М16)             ,М16 := PAGE3A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    PAGE1B                  ,мод.адрес по коду: PAGE1B
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE3C(М16)             ,М16 := PAGE3C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     25(М7)                  ,СМ := 25(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     13(М7)                  ,13 := СМ
         УИА    STANDH(М16)             ,М16 := STANDH
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE3A(М16)             ,М16 := PAGE3A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    PAGE1B                  ,мод.адрес по коду: PAGE1B
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE3C(М16)             ,М16 := PAGE3C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     24(М7)                  ,СМ := 24(М7)
         ЗП     30(М7)                  ,30 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     EGO327                  ,переход на EGO327
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    STANDF(М16)             ,М16 := STANDF
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE3A(М16)             ,М16 := PAGE3A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    PAGE1B                  ,мод.адрес по коду: PAGE1B
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE1C(М16)             ,М16 := PAGE1C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     30(М7)                  ,СМ := 30(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     30(М7)                  ,30 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ВЧОБ   25(М7)                  ,СМ := (адрес) - СМ
         ПО     V1A                     ,если СМ=0 → V1A
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         УИА    PAGE3B(М16)             ,М16 := PAGE3B
         ПВ     IMUI(М15)               ,вызов через М15
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     31(М7)                  ,31 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND                   ,мод.адрес +1: STAND
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     EGO32A                  ,если СМ=0 → EGO32A
         ПБ     EGO32B                  ,переход на EGO32B
*
         СЧ     10(М7)                  ,СМ := 10(М7)
         ЗП     31(М7)                  ,31 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     31(М7)                  ,СМ := 31(М7)
         ЗП     32(М7)                  ,32 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     SEK3A                   ,переход на SEK3A
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    STANDG(М16)             ,М16 := STANDG
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE3A(М16)             ,М16 := PAGE3A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    PAGE1D                  ,мод.адрес по коду: PAGE1D
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE1A(М16)             ,М16 := PAGE1A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     32(М7)                  ,СМ := 32(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     9(М7)                   ,СМ += 9(М7)
         ЗП     32(М7)                  ,32 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ВЧОБ   27(М7)                  ,СМ := (адрес) - СМ
         ПО     EGO32C                  ,если СМ=0 → EGO32C
         СЧ     23(М7)                  ,СМ := 23(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     23(М7)                  ,23 := СМ
         ВЧОБ   2(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     REGIMJ                  ,если СМ=0 → REGIMJ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM4                  ,мод.адрес +1: REGIM4
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     APJA                    ,если СМ≠0 → APJA
         ПБ     APJB                    ,переход на APJB
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STANDB                  ,переход на STANDB
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   STR25                   ,мод.адрес +1: STR25
         ВЧ     0                       ,СМ -= 0
         УИА    V7A(М16)                ,М16 := V7A
         ПВ     IDII(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         ЗП     17(М7)                  ,17 := СМ
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         УИА    PAGE3B(М16)             ,М16 := PAGE3B
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     33(М7)                  ,33 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND                   ,мод.адрес +1: STAND
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     STR25J                  ,если СМ=0 → STR25J
         ПБ     STR25K                  ,переход на STR25K
*
         СЧ     10(М7)                  ,СМ := 10(М7)
         ЗП     33(М7)                  ,33 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     5(М7)                   ,СМ := 5(М7)
         ЗП     34(М7)                  ,34 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   PAGE1                   ,мод.адрес +1: PAGE1
         СЧ     0                       ,СМ := 0
         УИА    V7A(М16)                ,М16 := V7A
         ПВ     IDII(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЛ     0                       ,СМ += 0
         ВЧ     3(М7)                   ,СМ -= 3(М7)
         ЗП     35(М7)                  ,35 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     36(М7)                  ,36 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         УИА    STANDF(М16)             ,М16 := STANDF
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE1F(М16)             ,М16 := PAGE1F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    PAGE1E                  ,мод.адрес по коду: PAGE1E
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE1G(М16)             ,М16 := PAGE1G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     35(М7)                  ,СМ := 35(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     4(М7)                   ,СМ += 4(М7)
         ЗП     35(М7)                  ,35 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     36(М7)                  ,СМ := 36(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     36(М7)                  ,36 := СМ
         ВЧОБ   2(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     STR25L                  ,если СМ=0 → STR25L
         СЧ     35(М7)                  ,СМ := 35(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     6(М7)                   ,СМ -= 6(М7)
         ЗП     35(М7)                  ,35 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         ЗП     37(М7)                  ,37 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         ЗП     38(М7)                  ,38 := СМ
         УИА    NDAB1(М16)              ,М16 := NDAB1
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V13A(М16)               ,М16 := V13A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V13A(М16)               ,М16 := V13A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    PAGE1E                  ,мод.адрес по коду: PAGE1E
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PAGE1G(М16)             ,М16 := PAGE1G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    IMUIB(М16)              ,М16 := IMUIB
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RASPS(М15)              ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   APJ                     ,мод.адрес +1: APJ
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     STANDC                  ,если СМ=0 → STANDC
         ПБ     V7                      ,переход на V7
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     IMUIA                   ,переход на IMUIA
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     STR25M                  ,если СМ=0 → STR25M
         ПБ     STR25N                  ,переход на STR25N
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR25O                  ,переход на STR25O
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     IMUIA                   ,переход на IMUIA
*
         СЧ     21(М7)                  ,СМ := 21(М7)
         МОДА   STR25                   ,мод.адрес +1: STR25
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     22(М7)                  ,СМ := 22(М7)
         МОДА   STR26                   ,мод.адрес +1: STR26
         ЗП     0                       ,0 := СМ
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         МОДА   STR24                   ,мод.адрес +1: STR24
         ЗП     0                       ,0 := СМ
         МОДА   SEK2                    ,мод.адрес +1: SEK2
         СЧ     0                       ,СМ := 0
         МОДА   PUS                     ,мод.адрес +1: PUS
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     WTBACK(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STANDE                  ,переход на STANDE
*
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    STANDJ(М7)              ,М7 := STANDJ
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*
         МОДА   0                       ,мод.адрес +1: 0

