***************************************************
* BEGSTR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 15520 образа SIPROD.BIN
*   Длина при загрузке: 110 слов, 202 команд
*   Вход: BEGSTR
*   Выход: BEGPG:STR25F, BEGPG:V13A+1, BEGPG:V13A+1, DOUBLE:STR24J+1, 
*   DOUBLE:STR24J+1, FILL:STR24J+1, HEADIN:NDABA, HEADIN:INS26B+1, 
*   NEWSTR:V1+1, RASTXT:TAB3B, RASTXT:TXTB+1, SEGTAB:V3, SEGTAB:V26A+1, 
*   SPAUD:REGIMA, SPAUD:V30, SPAUD:INS26L, SPAUD:SCAN90+1, SPAUD:SCAN90+1, 
*   TITLE:STR26A, TITLE:V15B+1, TITLE:V15B+1, STR25E (возврат через М12), 
*   STR25E (возврат через М10)
*   НАЧАЛО ТЕКСТОВОЙ СТРОКИ.
*   Внешние: REGIM, FORMA, NUST, STR, DAR, RAI, NDAB, RNSYMB, KLAIDA, IDII, 
*   IMUI
*   Смещения в DAR: 24
*   Смещения в FORMA: 2, 3, 10, 11
*   Смещения в NDAB: 1, 2, 3
*   Смещения в NUST: 1, 2, 3, 4
*   Смещения в RAI: 1
*   Смещения в REGIM: 2, 8
*   Смещения в STR: 24, 25, 26
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 REGIM
*   002 FORMA
*   003 NUST
*   004 STR
*   005 STR24
*   006 STR25
*   007 STR26
*   008 DAR
*   009 DAR24
*   010 RAI
*   011 RAI1
*   012 NDAB
*   013 NDAB1
*   014 NDAB2
*   015 NDAB3
*   016 RNSYMB
*   017 KLAIDA
*   018 NUST1
*   019 NUST2
*   020 REGIM8
*   021 NUST3
*   022 FORMA2
*   023 FORMA10
*   024 FORMA3
*   025 FORMA11
*   026 IDII
*   027 IMUI
*   028 REGIM2
*   029 NUST4
*
*** КОД МОДУЛЯ
*
BEGSTR   СТАРТ  0
         УИА    NUST1A(М16)             ,М16 := NUST1A
NUST1A   ПБ     NDAB1A                  ,переход на NDAB1A
*
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
NUST1B   СЧ     0                       ,СМ := 0
NUST1C   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST1B                  ,если СМ=0 → NUST1B
         ПБ     NUST1C                  ,переход на NUST1C
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     FORMAE                  ,переход на FORMAE
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST2                   ,мод.адрес +1: NUST2
NUST2A   СЧ     0                       ,СМ := 0
NUST2B   РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         МОДА   NUST2                   ,мод.адрес +1: NUST2
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM8                  ,мод.адрес +1: REGIM8
NUST2C   СЧ     0                       ,СМ := 0
NUST2D   РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST2A                  ,если СМ=0 → NUST2A
         ПБ     NUST2B                  ,переход на NUST2B
*
         ПБ     NUST2E                  ,переход на NUST2E
*
         МОДА   0                       ,мод.адрес +1: 0
NUST2E   МОДА   NUST2                   ,мод.адрес +1: NUST2
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     0(М7)                   ,СМ -= 0(М7)
NUST2F   РЖА    '22'                    ,РЖ := '22'
         ПО     NUST2C                  ,если СМ=0 → NUST2C
NUST2G   СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST3                   ,мод.адрес +1: NUST3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST2C                  ,если СМ=0 → NUST2C
         ПБ     NUST2D                  ,переход на NUST2D
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST2E                  ,переход на NUST2E
*
         МОДА   0                       ,мод.адрес +1: 0
FORMAA   МОДА   FORMA2                  ,мод.адрес +1: FORMA2
FORMAB   СЧ     0                       ,СМ := 0
         МОДА   FORMA10                 ,мод.адрес +1: FORMA10
         ЗП     0                       ,0 := СМ
         МОДА   FORMA3                  ,мод.адрес +1: FORMA3
         СЧ     0                       ,СМ := 0
FORMAC   МОДА   FORMA11                 ,мод.адрес +1: FORMA11
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   REGIM8                  ,мод.адрес +1: REGIM8
FORMAD   ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   FORMA10                 ,мод.адрес +1: FORMA10
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
FORMAE   МОДА   FORMA2                  ,мод.адрес +1: FORMA2
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     NUST2F                  ,если СМ≠0 → NUST2F
         ПБ     NUST2G                  ,переход на NUST2G
*
         УИА    STR25E(М16)             ,М16 := STR25E
         СЧИМ   М16                     ,стек := М16, СМ := М16
KLAIDB   ПВ     KLAIDA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         УИА    STR25D(М16)             ,М16 := STR25D
         ПВ     IDII(М15)               ,вызов через М15
FORMA1   ЗП     7(М7)                   ,7 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   FORMA10                 ,мод.адрес +1: FORMA10
         СЧ     0                       ,СМ := 0
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   STR25                   ,мод.адрес +1: STR25
FORMAF   ЗП     0                       ,0 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
FORMAG   СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
FORMAH   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     FORMAA                  ,если СМ=0 → FORMAA
FORMAI   ПБ     FORMAB                  ,переход на FORMAB
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     FORMAD                  ,переход на FORMAD
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         СЧ     7(М7)                   ,СМ := 7(М7)
NDAB1A   УИА    STR25D(М16)             ,М16 := STR25D
         ПВ     IMUI(М15)               ,вызов через М15
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     FORMAC                  ,если СМ=0 → FORMAC
         ПБ     FORMAD                  ,переход на FORMAD
*
STR25A   МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
STR25B   СЧ     0                       ,СМ := 0
STR25C   РЖА    '3'                     ,РЖ := '3'
STR25D   СЛ     5(М7)                   ,СМ += 5(М7)
         МОДА   STR25                   ,мод.адрес +1: STR25
STR25E   ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   FORMA11                 ,мод.адрес +1: FORMA11
         СЛ     0                       ,СМ += 0
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         МОДА   STR26                   ,мод.адрес +1: STR26
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   DAR24                   ,мод.адрес +1: DAR24
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     KLAIDB                  ,если СМ≠0 → KLAIDB
         ПБ     FORMA1                  ,переход на FORMA1
*
         УИА    DAR(М16)                ,М16 := DAR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25C(М16)             ,М16 := STR25C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25(М16)              ,М16 := STR25
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    DAR24(М16)              ,М16 := DAR24
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RNSYMB(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   REGIM2                  ,мод.адрес +1: REGIM2
         СЧ     0                       ,СМ := 0
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     3(М7)                   ,СМ := 3(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST4                   ,мод.адрес +1: NUST4
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     FORMAF                  ,если СМ=0 → FORMAF
         ПБ     FORMAG                  ,переход на FORMAG
*
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   DAR24                   ,мод.адрес +1: DAR24
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     FORMAH                  ,если СМ=0 → FORMAH
         ПБ     FORMAI                  ,переход на FORMAI
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   DAR24                   ,мод.адрес +1: DAR24
         СЛ     0                       ,СМ += 0
         СЛ     8(М7)                   ,СМ += 8(М7)
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         МОДА   STR24                   ,мод.адрес +1: STR24
         ЗП     0                       ,0 := СМ
         МОДА   RAI1                    ,мод.адрес +1: RAI1
         ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   DAR24                   ,мод.адрес +1: DAR24
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     STR25A                  ,переход на STR25A
*
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    STR25B(М7)              ,М7 := STR25B
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*

