***************************************************
* ENDKOR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 6400 образа SIPROD.BIN
*   Длина при загрузке: 54 слов, 90 команд
*   Вход: ENDKOR
*   Выход: смещение 122, через М12, смещение 131, через М10
*   ЗАКРЫТИЕ БУФЕРА ВЫВОДА.
*   Внешние: EGO, KORT, KLAIDA, IMUI
*   Смещения в EGO: 7200, 8600, 8601
*   Смещения в KORT: 14
*   Регистры: М1, М2, М7, М10, М12, М15, М16, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 EGO
*   002 EGO7200
*   003 EGO8600
*   004 EGO8601
*   005 KORT
*   006 KORT14
*   007 KLAIDA
*   008 IMUI
*   009 KORT32767
*   010 EGO39967
*
ENDKOR   СТАРТ  0
         УИА    KORT1A(М16)             ,М16 := KORT1A
KORT1A   ПБ     KORT3A                  ,переход на KORT3A
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   KORT14                  ,мод.адрес +1: KORT14
KORT1B   СЧ     0                       ,СМ := 0
KORT1C   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     KORT1B                  ,если СМ=0 → KORT1B
         ПБ     KORT1C                  ,переход на KORT1C
         МОДА   0                       ,мод.адрес +1: 0
EGO860   ПБ     KORT32                  ,переход на KORT32
         МОДА   0                       ,мод.адрес +1: 0
EGO86A   МОДА   EGO8600                 ,мод.адрес +1: EGO8600
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         РЖА    '22'                    ,РЖ := '22'
EGO86B   ПО     EGO860                  ,если СМ=0 → EGO860
         ПБ     EGO86A                  ,переход на EGO86A
         МОДА   0                       ,мод.адрес +1: 0
         УИА    KORT3E(М16)             ,М16 := KORT3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     KLAIDA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   EGO8600                 ,мод.адрес +1: EGO8600
         СЧ     0                       ,СМ := 0
         УИА    KORT3D(М16)             ,М16 := KORT3D
         ПВ     IMUI(М15)               ,вызов через М15
         ЗП     5(М7)                   ,5 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     6(М7)                   ,6 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     5(М7)                   ,СМ := 5(М7)
KORT32   РЖА    '3'                     ,РЖ := '3'
KORT3A   СЛ     6(М7)                   ,СМ += 6(М7)
         ЗП     7(М7)                   ,7 := СМ
         МОД    KORT3F                  ,мод.адрес по коду: KORT3F
         УИА    0(М1)                   ,М1 := 0
         МОДА   KORT32767(М1)           ,мод.адрес +1: KORT32767(М1
         СЧ     0                       ,СМ := 0
KORT3B   МОД    KORT3G                  ,мод.адрес по коду: KORT3G
         УИА    0(М2)                   ,М2 := 0
         МОДА   EGO39967(М2)            ,мод.адрес +1: EGO39967(М2)
         ЗП     0                       ,0 := СМ
KORT3C   СЧ     '4013'(М7)              ,СМ := '4013'(М7)
KORT3D   МОД    KORT3F                  ,мод.адрес по коду: KORT3F
         УИА    0(М1)                   ,М1 := 0
KORT3E   МОДА   KORT32767(М1)           ,мод.адрес +1: KORT32767(М1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
KORT3F   СЧ     6(М7)                   ,СМ := 6(М7)
KORT3G   РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     6(М7)                   ,6 := СМ
         ВЧОБ   1(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     EGO86B                  ,если СМ=0 → EGO86B
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   KORT14                  ,мод.адрес +1: KORT14
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   EGO8600                 ,мод.адрес +1: EGO8600
         СЧ     0                       ,СМ := 0
         СЛ     0(М7)                   ,СМ += 0(М7)
         МОДА   EGO8600                 ,мод.адрес +1: EGO8600
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     KORT3B                  ,переход на KORT3B
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    KORT3C(М7)              ,М7 := KORT3C
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М2                      ,стек := М2, СМ := М2
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М2                      ,М2 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10

