***************************************************
* ENDPG - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 11680 образа SIPROD.BIN
*   Длина при загрузке: 260 слов, 466 команд
*   Вход: ENDPG
*   Выход: смещение 713, через М12, смещение 720, через М10
*   КОНЕЦ СТРАНИЦЫ: ВЫВОД ФОРМАТИРОВАННОГО ТЕКСТА.
*   Внешние: EGO, PAGE, REGIM, NDAB, LYG, DYD, TXT, STAND, PLN, RPT, SEK, 
*   NUST, FT571, FT003, FT002, NUSTA, NEWMAX, KLAIDA, TOPAGE, VIAPUZ, IDII, 
*   IMUI
*   Смещения в DYD: 1, 2
*   Смещения в EGO: 2400, 4800, 7200
*   Смещения в LYG: 1, 2
*   Смещения в NDAB: 1, 2, 3
*   Смещения в NUST: 1, 5, 6, 7, 8, 9
*   Смещения в PAGE: 1, 2, 3
*   Смещения в REGIM: 9, 10
*   Смещения в SEK: 2, 3
*   Смещения в STAND: 1, 2, 4
*   Смещения в TXT: 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 EGO
*   002 EGO2400
*   003 EGO4800
*   004 EGO7200
*   005 PAGE
*   006 PAGE1
*   007 PAGE2
*   008 PAGE3
*   009 REGIM
*   010 NDAB
*   011 NDAB1
*   012 NDAB2
*   013 NDAB3
*   014 LYG
*   015 LYG1
*   016 LYG2
*   017 DYD
*   018 DYD1
*   019 DYD2
*   020 TXT
*   021 TXT3
*   022 STAND
*   023 STAND1
*   024 STAND2
*   025 STAND4
*   026 PLN
*   027 RPT
*   028 SEK
*   029 NUST
*   030 FT571
*   031 FT003
*   032 FT002
*   033 NUSTA
*   034 NEWMAX
*   035 KLAIDA
*   036 TOPAGE
*   037 VIAPUZ
*   038 PAGE4
*   039 STAND3
*   040 NUST1
*   041 NUST8
*   042 IDII
*   043 SEK2
*   044 IMUI
*   045 REGIM10
*   046 NUST9
*   047 PAGE5
*   048 SEK3
*   049 EGO32767
*   050 REGIM9
*   051 NUST7
*   052 NUST5
*   053 NUST6
*
ENDPG    СТАРТ  0
         УИА    PAGE3A(М16)             ,М16 := PAGE3A
PAGE3A   ПБ     SEK3D                   ,переход на SEK3D
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   PAGE4                   ,мод.адрес +1: PAGE4
         СЛ     0                       ,СМ += 0
         ЗП     12(М7)                  ,12 := СМ
PAGE3B   СЧ     4(М7)                   ,СМ := 4(М7)
PAGE3C   СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     PAGE3B                  ,если СМ≠0 → PAGE3B
         ПБ     PAGE3C                  ,переход на PAGE3C
STANDA   ПБ     STANDC                  ,переход на STANDC
STANDB   МОДА   0                       ,мод.адрес +1: 0
STANDC   СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND2                  ,мод.адрес +1: STAND2
         СЧ     0                       ,СМ := 0
STANDD   НТЖ    0(М17)                  ,СМ ^= 0(М17)
STANDE   ПЕ     STANDA                  ,если СМ≠0 → STANDA
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND3                  ,мод.адрес +1: STAND3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STANDA                  ,если СМ≠0 → STANDA
STANDF   ПБ     STANDB                  ,переход на STANDB
V0       МОДА   0                       ,мод.адрес +1: 0
         ПВ     VIAPUZ(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8I                  ,переход на NUST8I
NDABA    МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
NDABB    ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     12(М7)                  ,СМ += 12(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     STANDD                  ,если СМ=0 → STANDD
         ПБ     STANDE                  ,переход на STANDE
TOPAGA   ПВ     TOPAGE(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
STANDG   СЧИМ                           ,СЧИ + магазин
         МОДА   STAND2                  ,мод.адрес +1: STAND2
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
STANDH   ПЕ     STANDF                  ,если СМ≠0 → STANDF
STANDI   СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND3                  ,мод.адрес +1: STAND3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STANDF                  ,если СМ≠0 → STANDF
         ПБ     V0                      ,переход на V0
V0A      МОДА   0                       ,мод.адрес +1: 0
         ПВ     VIAPUZ(М15)             ,вызов через М15
NUST1A   МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
NUST1B   НТЖ    0(М17)                  ,СМ ^= 0(М17)
NUST1C   ПО     NDABA                   ,если СМ=0 → NDABA
         ПБ     NDABB                   ,переход на NDABB
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST8                   ,мод.адрес +1: NUST8
NUST8A   СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
NUST8B   СЛ     1(М7)                   ,СМ += 1(М7)
NUST8C   МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
NUST8D   МОДА   NUST8                   ,мод.адрес +1: NUST8
NUST8E   СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   DYD2                    ,мод.адрес +1: DYD2
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     TOPAGA                  ,если СМ≠0 → TOPAGA
         ПБ     STANDG                  ,переход на STANDG
NUST8F   МОДА   0                       ,мод.адрес +1: 0
NUST8G   МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЧ     0                       ,СМ := 0
         МОДА   DYD2                    ,мод.адрес +1: DYD2
NUST8H   ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
NUST8I   МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STANDH                  ,если СМ≠0 → STANDH
         ПБ     STANDI                  ,переход на STANDI
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8I                  ,переход на NUST8I
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         УИА    RPTA(М16)               ,М16 := RPTA
         ПВ     IDII(М15)               ,вызов через М15
NUST1D   ЗП     13(М7)                  ,13 := СМ
NUST1E   РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
NUST1F   РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
NUST1G   ПО     V0A                     ,если СМ=0 → V0A
         ПБ     NUST1A                  ,переход на NUST1A
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   SEK2                    ,мод.адрес +1: SEK2
SEK2A    ЗП     0                       ,0 := СМ
SEK2B    МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
SEK2C    СЧ     13(М7)                  ,СМ := 13(М7)
         УИА    RPTA(М16)               ,М16 := RPTA
         ПВ     IMUI(М15)               ,вызов через М15
XOR      НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NUST1B                  ,если СМ≠0 → NUST1B
         ПБ     NUST1C                  ,переход на NUST1C
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8C                  ,переход на NUST8C
         МОДА   0                       ,мод.адрес +1: 0
NUST1H   СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST8A                  ,если СМ=0 → NUST8A
         ПБ     NUST8B                  ,переход на NUST8B
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   SEK2                    ,мод.адрес +1: SEK2
SEK2D    ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8H                  ,переход на NUST8H
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
REGIM1   МОДА   REGIM10                 ,мод.адрес +1: REGIM10
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NUST8D                  ,если СМ≠0 → NUST8D
         ПБ     NUST8E                  ,переход на NUST8E
V0B      МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST9D                  ,переход на NUST9D
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST9                   ,мод.адрес +1: NUST9
         СЧ     0                       ,СМ := 0
NUST9A   УИА    RPTA(М16)               ,М16 := RPTA
IDIIA    ПВ     IDII(М15)               ,вызов через М15
         ЗП     14(М7)                  ,14 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   NUST9                   ,мод.адрес +1: NUST9
NUST9B   СЧ     0                       ,СМ := 0
NUST9C   СЧИМ                           ,СЧИ + магазин
NUST9D   СЧ     14(М7)                  ,СМ := 14(М7)
         УИА    RPTA(М16)               ,М16 := RPTA
         ПВ     IMUI(М15)               ,вызов через М15
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
CMP      ПЕ     NUST8F                  ,если СМ≠0 → NUST8F
         ПБ     NUST8G                  ,переход на NUST8G
         ПБ     NUST9D                  ,переход на NUST9D
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     8(М7)                   ,СМ := 8(М7)
         РЖА    '3'                     ,РЖ := '3'
         МОДА   PAGE                    ,мод.адрес +1: PAGE
PAGEA    СЛ     0                       ,СМ += 0
PAGEB    ЗП     15(М7)                  ,15 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   PAGE                    ,мод.адрес +1: PAGE
         СЧ     0                       ,СМ := 0
PAGEC    РЖА    '3'                     ,РЖ := '3'
PAGED    СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     15(М7)                  ,15 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   PAGE2                   ,мод.адрес +1: PAGE2
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
PAGEE    СЧ     0                       ,СМ := 0
PAGEF    РЖА    '3'                     ,РЖ := '3'
         МОДА   PAGE4                   ,мод.адрес +1: PAGE4
         СЛ     0                       ,СМ += 0
         МОДА   PAGE5                   ,мод.адрес +1: PAGE5
PAGEG    СЛ     0                       ,СМ += 0
         ЗП     16(М7)                  ,16 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
PAGEH    СЧИМ                           ,СЧИ + магазин
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NUST1D                  ,если СМ≠0 → NUST1D
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         СЧИМ                           ,СЧИ + магазин
PAGEI    МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
PAGEJ    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST1D                  ,если СМ=0 → NUST1D
         ПБ     NUST1E                  ,переход на NUST1E
         МОДА   0                       ,мод.адрес +1: 0
SEK3A    ПБ     SEK2B                   ,переход на SEK2B
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
SEK3B    РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   SEK3                    ,мод.адрес +1: SEK3
SEK3C    ЗП     0                       ,0 := СМ
         ВЧ     3(М7)                   ,СМ -= 3(М7)
SEK3D    РЖА    '22'                    ,РЖ := '22'
         ПО     NUST1F                  ,если СМ=0 → NUST1F
         ПБ     NUST1G                  ,переход на NUST1G
         УИА    RPTC(М16)               ,М16 := RPTC
         СЧИМ   М16                     ,стек := М16, СМ := М16
KLAIDB   ПВ     KLAIDA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
SEK3E    РЖА    '3'                     ,РЖ := '3'
SEK3F    ВЧ     1(М7)                   ,СМ -= 1(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     SEK2A                   ,если СМ=0 → SEK2A
SEK3G    ПБ     SEK2B                   ,переход на SEK2B
         МОДА   0                       ,мод.адрес +1: 0
RPTA     ПБ     NUST9D                  ,переход на NUST9D
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     17(М7)                  ,17 := СМ
RPTB     РЖА    '3'                     ,РЖ := '3'
         МОДА   RPT                     ,мод.адрес +1: RPT
RPTC     ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     SEK2C                   ,если СМ≠0 → SEK2C
         ПБ     XOR                     ,переход на XOR
         МОДА   RPT                     ,мод.адрес +1: RPT
         СЧ     0                       ,СМ := 0
         ЗП     17(М7)                  ,17 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         УИА    SEK3E(М16)              ,М16 := SEK3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     FT571(М15)              ,вызов через М15
V1       МОДА   0                       ,мод.адрес +1: 0
         ПВ     FT003(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     18(М7)                  ,18 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V0B                     ,переход на V0B
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         УИА    RPTB(М16)               ,М16 := RPTB
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     19(М7)                  ,19 := СМ
         СЛ     5(М7)                   ,СМ += 5(М7)
         ЗП     20(М7)                  ,20 := СМ
         УИА    SEK3F(М16)              ,М16 := SEK3F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     FT571(М15)              ,вызов через М15
         СЧ     19(М7)                  ,СМ := 19(М7)
         ЗП     21(М7)                  ,21 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     REGIM1                  ,переход на REGIM1
         МОДА   0                       ,мод.адрес +1: 0
         МОД    V1                      ,мод.адрес по коду: V1
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     FT002(М15)              ,вызов через М15
         СЧ     21(М7)                  ,СМ := 21(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     21(М7)                  ,21 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ВЧОБ   20(М7)                  ,СМ := (адрес) - СМ
         ПО     SEK2D                   ,если СМ=0 → SEK2D
         ПВ     FT003(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     18(М7)                  ,18 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ВЧОБ   16(М7)                  ,СМ := (адрес) - СМ
         ПО     NUST1H                  ,если СМ=0 → NUST1H
         СЧ     17(М7)                  ,СМ := 17(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     17(М7)                  ,17 := СМ
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     NUST9A                  ,если СМ=0 → NUST9A
         ПБ     IDIIA                   ,переход на IDIIA
         ПБ     XOR                     ,переход на XOR
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST9B                  ,если СМ=0 → NUST9B
         ПБ     NUST9C                  ,переход на NUST9C
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SEK3A                   ,переход на SEK3A
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     CMP                     ,переход на CMP
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   PLN                     ,мод.адрес +1: PLN
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   PLN                     ,мод.адрес +1: PLN
         ЗП     0                       ,0 := СМ
         УИА    RPTA(М16)               ,М16 := RPTA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     NEWMAX(М15)             ,вызов через М15
         МОДА   STAND1                  ,мод.адрес +1: STAND1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         МОДА   STAND1                  ,мод.адрес +1: STAND1
         ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND1                  ,мод.адрес +1: STAND1
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     PAGEA                   ,если СМ=0 → PAGEA
         ПБ     PAGEB                   ,переход на PAGEB
         ПБ     PAGEF                   ,переход на PAGEF
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM9                  ,мод.адрес +1: REGIM9
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     PAGEC                   ,если СМ=0 → PAGEC
         ПБ     PAGED                   ,переход на PAGED
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SEK3A                   ,переход на SEK3A
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST7                   ,мод.адрес +1: NUST7
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         МОДА   NUST7                   ,мод.адрес +1: NUST7
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     NUSTA(М15)              ,вызов через М15
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST7                   ,мод.адрес +1: NUST7
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     PAGEE                   ,если СМ≠0 → PAGEE
         ПБ     PAGEF                   ,переход на PAGEF
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SEK3A                   ,переход на SEK3A
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   STAND                   ,мод.адрес +1: STAND
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     PAGEG                   ,если СМ≠0 → PAGEG
         ПБ     PAGEH                   ,переход на PAGEH
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   STAND                   ,мод.адрес +1: STAND
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     4(М7)                   ,СМ := 4(М7)
         МОДА   REGIM9                  ,мод.адрес +1: REGIM9
         ЗП     0                       ,0 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         МОДА   NUST5                   ,мод.адрес +1: NUST5
         ЗП     0                       ,0 := СМ
         СЧ     4(М7)                   ,СМ := 4(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     PAGEI                   ,если СМ=0 → PAGEI
         ПБ     PAGEJ                   ,переход на PAGEJ
         СЧ     10(М7)                  ,СМ := 10(М7)
         МОДА   NUST5                   ,мод.адрес +1: NUST5
         ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     9(М7)                   ,СМ := 9(М7)
         МОДА   NUST6                   ,мод.адрес +1: NUST6
         ЗП     0                       ,0 := СМ
         ПВ     NUSTA(М15)              ,вызов через М15
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   REGIM9                  ,мод.адрес +1: REGIM9
         ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM10                 ,мод.адрес +1: REGIM10
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SEK3B                   ,если СМ=0 → SEK3B
         ПБ     SEK3C                   ,переход на SEK3C
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST9                   ,мод.адрес +1: NUST9
         СЧ     0                       ,СМ := 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   REGIM10                 ,мод.адрес +1: REGIM10
         ЗП     0                       ,0 := СМ
         ПБ     KLAIDB                  ,переход на KLAIDB
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    SEK3G(М7)               ,М7 := SEK3G
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

