***************************************************
* ENDSTR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 12032 образа SIPROD.BIN
*   Длина при загрузке: 22 слов, 42 команд
*   Вход: ENDSTR
*   Внешние: *NDAB*, *PAGE*, *REGIM*, TOPAGE, BEGPG, ENDPG
*   Смещения в *NDAB*: 1
*   Смещения в *PAGE*: 1, 2, 3, 4, 5
*   Смещения в *REGIM*: 1
*   Регистры: М7, М10, М12, М15, М16
***************************************************
ENDSTR  СТАРТ  0
        УИА    NDAB(М16)                ,М16 := NDAB
NDAB    ПБ     ENDPG                    ,переход на ENDPG
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     ENDSTR                   ,СМ := ENDSTR
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        ВЧ     ENDSTR                   ,СМ -= ENDSTR
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
L0010   ВЧ     ENDSTR                   ,СМ -= ENDSTR
REGIM1  МОДА   *REGIM*+1                ,мод.адрес +1: *REGIM*+1
L0012   СЛ     ENDSTR                   ,СМ += ENDSTR
        ВЧ     ENDSTR(М7)               ,СМ -= ENDSTR(М7)
L0014   РЖА    '22'                     ,РЖ := '22'
L0015   ПЕ     L0010                    ,если СМ≠0 → L0010
ENDPG   ПБ     REGIM1                   ,переход на REGIM1
        МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        ПБ     L0014                    ,переход на L0014
        МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        ПВ     ENDPG(М15)               ,вызов через М15
BEGPG   МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        ПВ     BEGPG(М15)               ,вызов через М15
TOPAGE  МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        ПБ     L0015                    ,переход на L0015
        МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        ПВ     TOPAGE(М15)              ,вызов через М15
        МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        ПБ     BEGPG                    ,переход на BEGPG
        МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    TOPAGE(М7)               ,М7 := TOPAGE
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     ENDSTR(М12)              ,переход через М12
        МОДА   ENDSTR                   ,мод.адрес +1: ENDSTR
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     ENDSTR(М10)              ,переход через М10

