***************************************************
* ENDTUR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 20256 образа SIPROD.BIN
*   Длина при загрузке: 77 слов, 128 команд
*   Вход: ENDTUR
*   Выход: EGO413 (возврат через М12), EGO413 (возврат через М10)
*   Внешние: EGO, FOR, JAU, FT571, FT002, FT003, IDII, IMUI
*   Смещения в EGO: 8601
*   Смещения в FOR: 1
*   Смещения в JAU: 1
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 EGO
*   002 EGO8601
*   003 FOR
*   004 FOR1
*   005 JAU
*   006 JAU1
*   007 FT571
*   008 FT002
*   009 FT003
*   010 IDII
*   011 IMUI
*   012 FOR3
*   013 FOR4
*   014 FOR7
*   015 EGO41368
*
*** КОД МОДУЛЯ
*
ENDTUR   СТАРТ  0
         УИА    FORA(М16)               ,М16 := FORA
FORA     ПБ     V8B                     ,переход на V8B
*
         МОДА   FOR                     ,мод.адрес +1: FOR
         СЧ     0                       ,СМ := 0
         ЗП     5(М7)                   ,5 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     0(М7)                   ,СМ := 0(М7)
FORB     СЧИМ                           ,СЧИ + магазин
FORC     МОДА   JAU1                    ,мод.адрес +1: JAU1
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     FORB                    ,если СМ≠0 → FORB
         ПБ     FORC                    ,переход на FORC
*
         ПБ     V5                      ,переход на V5
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   FOR                     ,мод.адрес +1: FOR
FORD     СЧ     0                       ,СМ := 0
         УИА    V3C(М16)                ,М16 := V3C
         ПВ     IDII(М15)               ,вызов через М15
V5       ЗП     5(М7)                   ,5 := СМ
         РЖА    '3'                     ,РЖ := '3'
         УИА    V3C(М16)                ,М16 := V3C
         ПВ     IMUI(М15)               ,вызов через М15
         ЗП     6(М7)                   ,6 := СМ
         МОДА   FOR                     ,мод.адрес +1: FOR
         СЧ     0                       ,СМ := 0
FORE     СЧИМ                           ,СЧИ + магазин
         СЧ     6(М7)                   ,СМ := 6(М7)
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     FORD                    ,если СМ≠0 → FORD
         ПБ     V5                      ,переход на V5
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     5(М7)                   ,СМ := 5(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     5(М7)                   ,5 := СМ
         РЖА    '22'                    ,РЖ := '22'
FOR3A    МОДА   0                       ,мод.адрес +1: 0
         МОДА   FOR3                    ,мод.адрес +1: FOR3
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   FOR4                    ,мод.адрес +1: FOR4
         СЛ     0                       ,СМ += 0
FOR3B    МОДА   FOR7                    ,мод.адрес +1: FOR7
         СЛ     0                       ,СМ += 0
         УИА    V3D(М16)                ,М16 := V3D
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ЗП     7(М7)                   ,7 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '22'                    ,РЖ := '22'
V8       СЧ     8(М7)                   ,СМ := 8(М7)
V8A      РЖА    '3'                     ,РЖ := '3'
V8B      ВЧ     0(М7)                   ,СМ -= 0(М7)
         ЗП     4(М7)                   ,4 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         УИА    V3E(М16)                ,М16 := V3E
         ПВ     IMUI(М15)               ,вызов через М15
V3       МОДА   0                       ,мод.адрес +1: 0
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     9(М7)                   ,9 := СМ
V3A      СЛ     7(М7)                   ,СМ += 7(М7)
V3B      ВЧ     0(М7)                   ,СМ -= 0(М7)
V3C      ЗП     10(М7)                  ,10 := СМ
V3D      УИА    V3A(М16)                ,М16 := V3A
         СЧИМ   М16                     ,стек := М16, СМ := М16
V3E      РЖА    '22'                    ,РЖ := '22'
         ПВ     FT571(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     9(М7)                   ,СМ := 9(М7)
         ЗП     11(М7)                  ,11 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
EGO413   ПБ     FOR3B                   ,переход на FOR3B
*
         МОДА   0                       ,мод.адрес +1: 0
         МОД    EGO413                  ,мод.адрес по коду: EGO413
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO41368(М1)            ,мод.адрес +1: EGO41368(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     FT002(М15)              ,вызов через М15
         СЧ     11(М7)                  ,СМ := 11(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     11(М7)                  ,11 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ВЧОБ   10(М7)                  ,СМ := (адрес) - СМ
         ПО     FOR3A                   ,если СМ=0 → FOR3A
         ПВ     FT003(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     8(М7)                   ,СМ := 8(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     8(М7)                   ,8 := СМ
         СЧ     5(М7)                   ,СМ := 5(М7)
         ВЧ     0(М7)                   ,СМ -= 0(М7)
         ЗП     5(М7)                   ,5 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     5(М7)                   ,СМ := 5(М7)
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V8                      ,если СМ=0 → V8
         ПБ     V8A                     ,переход на V8A
*
         ПБ     FORE                    ,переход на FORE
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V3                      ,переход на V3
*
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    V3B(М7)                 ,М7 := V3B
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*
         МОДА   0                       ,мод.адрес +1: 0

