***************************************************
* FILL - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 14976 образа SIPROD.BIN
*   Длина при загрузке: 75 слов, 128 команд
*   Вход: FILL
*   Внешние: *STR*, *NDAB*, BEGSTR, ENDSTR, RSYMB
*   Смещения в *NDAB*: 1, 2
*   Смещения в *STR*: 24, 25, 26
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
FILL    СТАРТ  0
        УИА    L0111(М16)               ,М16 := L0111
L0111   ПБ     V7                       ,переход на V7
        МОД    STR305                   ,мод.адрес по коду: STR305
        СЧ     FILL                     ,СМ := FILL
L0004   ЗП     3(М7)                    ,3 := СМ
L0005   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   FILL                     ,мод.адрес +1: FILL
STR32   МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЧ     FILL                     ,СМ := FILL
STR30   РЖА    '3'                      ,РЖ := '3'
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
L0014   ВЧ     FILL                     ,СМ -= FILL
        СЛ     L0111(М7)                ,СМ += L0111(М7)
L0016   ЗП     4(М7)                    ,4 := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        ЗП     5(М7)                    ,5 := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        ВЧОБ   FILL                     ,СМ := (адрес) - СМ
STR302  СЛ     L0004(М7)                ,СМ += L0004(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0014                    ,если СМ≠0 → L0014
        ПБ     L0016                    ,переход на L0016
        МОДА   FILL                     ,мод.адрес +1: FILL
        СЧ     4(М7)                    ,СМ := 4(М7)
        ЗП     5(М7)                    ,5 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     FILL                     ,СМ := FILL
        РЖА    '3'                      ,РЖ := '3'
V4      ВЧ     1(М7)                    ,СМ -= 1(М7)
        ЗП     6(М7)                    ,6 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     7(М7)                    ,7 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V4                       ,переход на V4
        МОДА   FILL                     ,мод.адрес +1: FILL
        СЧ     6(М7)                    ,СМ := 6(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0111(М7)                ,СМ += L0111(М7)
L0051   ЗП     6(М7)                    ,6 := СМ
L0112   МОД    ENDSTR                   ,мод.адрес по коду: ENDSTR
        УИА    FILL(М16)                ,М16 := FILL
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    STR304(М16)              ,М16 := STR304
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    *STR*(М16)               ,М16 := *STR*
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0061   УИА    L0106(М16)               ,М16 := L0106
RSYMB   СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   FILL                     ,мод.адрес +1: FILL
L0066   РЖА    '3'                      ,РЖ := '3'
L0067   РЖА    '22'                     ,РЖ := '22'
V7      СЧ     7(М7)                    ,СМ := 7(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0111(М7)                ,СМ += L0111(М7)
        ЗП     7(М7)                    ,7 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   FILL                     ,мод.адрес +1: FILL
L0076   ВЧОБ   5(М7)                    ,СМ := (адрес) - СМ
        ПО     STR302                   ,если СМ=0 → STR302
STR303  МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     FILL                     ,СМ := FILL
STR304  РЖА    '3'                      ,РЖ := '3'
        СЛ     L0005(М7)                ,СМ += L0005(М7)
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ЗП     FILL                     ,FILL := СМ
L0106   СЧ     3(М7)                    ,СМ := 3(М7)
        ВЧ     5(М7)                    ,СМ -= 5(М7)
        ЗП     3(М7)                    ,3 := СМ
STR305  МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
ENDSTR  СЧ     FILL                     ,СМ := FILL
        ВЧОБ   FILL                     ,СМ := (адрес) - СМ
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЛ     FILL                     ,СМ += FILL
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0051                    ,если СМ=0 → L0051
        ПБ     L0112                    ,переход на L0112
        МОДА   FILL                     ,мод.адрес +1: FILL
        ПБ     RSYMB                    ,переход на RSYMB
        МОДА   FILL                     ,мод.адрес +1: FILL
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     FILL                     ,СМ := FILL
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        СЧ     8(М7)                    ,СМ := 8(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     FILL                     ,СМ := FILL
        НТЖ    FILL(М17)                ,СМ ^= FILL(М17)
        ПО     L0061                    ,если СМ=0 → L0061
        ПБ     RSYMB                    ,переход на RSYMB
        МОДА   FILL                     ,мод.адрес +1: FILL
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   FILL                     ,мод.адрес +1: FILL
        СЧ     3(М7)                    ,СМ := 3(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   FILL                     ,СМ := (адрес) - СМ
        СЛ     FILL(М7)                 ,СМ += FILL(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0066                    ,если СМ≠0 → L0066
        ПБ     L0067                    ,переход на L0067
        МОДА   FILL                     ,мод.адрес +1: FILL
        ПБ     L0004                    ,переход на L0004
        МОДА   FILL                     ,мод.адрес +1: FILL
        ПБ     L0076                    ,переход на L0076
        МОДА   FILL                     ,мод.адрес +1: FILL
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    STR303(М7)               ,М7 := STR303
        ЗПМ    10(М7)                   ,ЗП + магазин: 10(М7)
        ЗПМ    9(М7)                    ,ЗП + магазин: 9(М7)
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     FILL(М12)                ,переход через М12
        МОДА   FILL                     ,мод.адрес +1: FILL
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     FILL(М10)                ,переход через М10

