***************************************************
* FILL - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 14976 образа SIPROD.BIN
*   Длина при загрузке: 75 слов, 128 команд
*   Вход: FILL
*   Выход: STR24J (возврат через М12), STR24J (возврат через М10)
*   ЗАПОЛНЕНИЕ СТРОКИ СИМВОЛОМ ПО ШИРИНЕ ПОЛЯ.
*   Внешние: STR, NDAB, BEGSTR, ENDSTR, RSYMB
*   Смещения в NDAB: 1, 2
*   Смещения в STR: 24, 25, 26
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 STR
*   002 STR24
*   003 STR25
*   004 STR26
*   005 NDAB
*   006 NDAB1
*   007 NDAB2
*   008 BEGSTR
*   009 ENDSTR
*   010 RSYMB
*
*** КОД МОДУЛЯ
*
FILL     СТАРТ  0
         УИА    STR26A(М16)             ,М16 := STR26A
STR26A   ПБ     STR24D                  ,переход на STR24D
*
         МОД    STR24I                  ,мод.адрес по коду: STR24I
         СЧ     0                       ,СМ := 0
STR26B   ЗП     3(М7)                   ,3 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   STR24                   ,мод.адрес +1: STR24
STR26C   ВЧ     0                       ,СМ -= 0
         СЛ     1(М7)                   ,СМ += 1(М7)
STR26D   ЗП     4(М7)                   ,4 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         ЗП     5(М7)                   ,5 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
STR26E   СЛ     4(М7)                   ,СМ += 4(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     STR26C                  ,если СМ≠0 → STR26C
         ПБ     STR26D                  ,переход на STR26D
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         ЗП     5(М7)                   ,5 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   STR24                   ,мод.адрес +1: STR24
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
STR24A   ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     6(М7)                   ,6 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     7(М7)                   ,7 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     STR24A                  ,переход на STR24A
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     6(М7)                   ,СМ := 6(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
V6       ЗП     6(М7)                   ,6 := СМ
V6A      МОД    STR24J                  ,мод.адрес по коду: STR24J
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR24G(М16)             ,М16 := STR24G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
V6B      УИА    STR24H(М16)             ,М16 := STR24H
V6C      СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
STR24B   РЖА    '3'                     ,РЖ := '3'
STR24C   РЖА    '22'                    ,РЖ := '22'
STR24D   СЧ     7(М7)                   ,СМ := 7(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     7(М7)                   ,7 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
STR24E   ВЧОБ   5(М7)                   ,СМ := (адрес) - СМ
         ПО     STR26E                  ,если СМ=0 → STR26E
STR24F   МОДА   STR24                   ,мод.адрес +1: STR24
         СЧ     0                       ,СМ := 0
STR24G   РЖА    '3'                     ,РЖ := '3'
         СЛ     5(М7)                   ,СМ += 5(М7)
         МОДА   STR24                   ,мод.адрес +1: STR24
         ЗП     0                       ,0 := СМ
STR24H   СЧ     3(М7)                   ,СМ := 3(М7)
         ВЧ     5(М7)                   ,СМ -= 5(М7)
         ЗП     3(М7)                   ,3 := СМ
STR24I   МОДА   STR24                   ,мод.адрес +1: STR24
STR24J   СЧ     0                       ,СМ := 0
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПО     V6                      ,если СМ=0 → V6
         ПБ     V6A                     ,переход на V6A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V6C                     ,переход на V6C
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDSTR(М15)             ,вызов через М15
         СЧ     8(М7)                   ,СМ := 8(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V6B                     ,если СМ=0 → V6B
         ПБ     V6C                     ,переход на V6C
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     0(М7)                   ,СМ += 0(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     STR24B                  ,если СМ≠0 → STR24B
         ПБ     STR24C                  ,переход на STR24C
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR26B                  ,переход на STR26B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR24E                  ,переход на STR24E
*
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    STR24F(М7)              ,М7 := STR24F
         ЗПМ    10(М7)                  ,ЗП + магазин: 10(М7)
         ЗПМ    9(М7)                   ,ЗП + магазин: 9(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*

