***************************************************
* FILL - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 14976 образа SIPROD.BIN
*   Длина при загрузке: 75 слов, 128 команд
*   Вход: FILL
*   Внешние: STR, NDAB, BEGSTR, ENDSTR, RSYMB
*   Смещения в NDAB: 1, 2
*   Смещения в STR: 24, 25, 26
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 STR
*   002 STR24
*   003 STR25
*   004 STR26
*   005 NDAB
*   006 NDAB1
*   007 NDAB2
*   008 BEGSTR
*   009 ENDSTR
*   010 RSYMB
*
FILL     СТАРТ  0
         УИА    L0111(М16)              ,М16 := L0111
L0111    ПБ     V7                      ,переход на V7
         МОД    STR24D                  ,мод.адрес по коду: STR24D
         СЧ     0                       ,СМ := 0
STR26A   ЗП     3(М7)                   ,3 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   STR24                   ,мод.адрес +1: STR24
L0014    ВЧ     0                       ,СМ -= 0
         СЛ     1(М7)                   ,СМ += 1(М7)
L0016    ЗП     4(М7)                   ,4 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         ЗП     5(М7)                   ,5 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
STR24A   СЛ     4(М7)                   ,СМ += 4(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     L0014                   ,если СМ≠0 → L0014
         ПБ     L0016                   ,переход на L0016
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         ЗП     5(М7)                   ,5 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   STR24                   ,мод.адрес +1: STR24
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
V4       ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     6(М7)                   ,6 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     7(М7)                   ,7 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V4                      ,переход на V4
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     6(М7)                   ,СМ := 6(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
L0051    ЗП     6(М7)                   ,6 := СМ
L0112    МОД    ENDSTA                  ,мод.адрес по коду: ENDSTA
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR24C(М16)             ,М16 := STR24C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
L0061    УИА    L0106(М16)              ,М16 := L0106
RSYMBA   СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
L0066    РЖА    '3'                     ,РЖ := '3'
L0067    РЖА    '22'                    ,РЖ := '22'
V7       СЧ     7(М7)                   ,СМ := 7(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     7(М7)                   ,7 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
L0076    ВЧОБ   5(М7)                   ,СМ := (адрес) - СМ
         ПО     STR24A                  ,если СМ=0 → STR24A
STR24B   МОДА   STR24                   ,мод.адрес +1: STR24
         СЧ     0                       ,СМ := 0
STR24C   РЖА    '3'                     ,РЖ := '3'
         СЛ     5(М7)                   ,СМ += 5(М7)
         МОДА   STR24                   ,мод.адрес +1: STR24
         ЗП     0                       ,0 := СМ
L0106    СЧ     3(М7)                   ,СМ := 3(М7)
         ВЧ     5(М7)                   ,СМ -= 5(М7)
         ЗП     3(М7)                   ,3 := СМ
STR24D   МОДА   STR24                   ,мод.адрес +1: STR24
ENDSTA   СЧ     0                       ,СМ := 0
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПО     L0051                   ,если СМ=0 → L0051
         ПБ     L0112                   ,переход на L0112
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     RSYMBA                  ,переход на RSYMBA
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDSTR(М15)             ,вызов через М15
         СЧ     8(М7)                   ,СМ := 8(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0061                   ,если СМ=0 → L0061
         ПБ     RSYMBA                  ,переход на RSYMBA
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     0(М7)                   ,СМ += 0(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     L0066                   ,если СМ≠0 → L0066
         ПБ     L0067                   ,переход на L0067
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR26A                  ,переход на STR26A
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     L0076                   ,переход на L0076
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    STR24B(М7)              ,М7 := STR24B
         ЗПМ    10(М7)                  ,ЗП + магазин: 10(М7)
         ЗПМ    9(М7)                   ,ЗП + магазин: 9(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10

