***************************************************
* GOSTAS - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 21024 образа SIPROD.BIN
*   Длина при загрузке: 32 слов, 42 команд
*   Вход: GOSTAS
*   Выход: смещение 43, через М12, смещение 50, через М10
*   ПРИВЕДЕНИЕ ТЕКСТА К КОДИРОВКЕ ГОСТ.
*   Внешние: LOL
*   Смещения в LOL: 7
*   Регистры: М1, М7, М10, М12, М15, М16
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 LOL
*   002 LOL32767
*   003 LOL7
*
GOSTAS   СТАРТ  0
         УИА    LOL327(М16)             ,М16 := LOL327
LOL327   ПБ     LOL32B                  ,переход на LOL32B
         СЧ     0(М7)                   ,СМ := 0(М7)
LOL32A   ЗП     2(М7)                   ,2 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОД    LOL32E                  ,мод.адрес по коду: LOL32E
         УИА    0(М1)                   ,М1 := 0
         МОДА   LOL32E(М1)              ,мод.адрес +1: LOL32E(М1)
         СЧ     0                       ,СМ := 0
         МОДА   LOL32767(М1)            ,мод.адрес +1: LOL32767(М1)
         ЗП     0                       ,0 := СМ
         МОД    LOL32E                  ,мод.адрес по коду: LOL32E
LOL32B   УИА    0(М1)                   ,М1 := 0
         МОДА   LOL32E(М1)              ,мод.адрес +1: LOL32E(М1)
         СЧ     0                       ,СМ := 0
         МОДА   LOL7(М1)                ,мод.адрес +1: LOL7(М1)
         ЗП     0                       ,0 := СМ
LOL32C   СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
LOL32D   ЗП     2(М7)                   ,2 := СМ
         ВЧОБ   1(М7)                   ,СМ := (адрес) - СМ
LOL32E   РЖА    '22'                    ,РЖ := '22'
LOL32F   ПО     LOL32A                  ,если СМ=0 → LOL32A
         ПБ     LOL32C                  ,переход на LOL32C
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    LOL32D(М7)              ,М7 := LOL32D
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

