***************************************************
* GOSTAS - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 21024 образа SIPROD.BIN
*   Длина при загрузке: 32 слов, 42 команд
*   Вход: GOSTAS
*   Внешние: LOL
*   Смещения в LOL: 7
*   Регистры: М1, М7, М10, М12, М15, М16
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 LOL
*   002 LOL32767
*   003 LOL7
*
GOSTAS   СТАРТ  0
         УИА    L0001(М16)              ,М16 := L0001
L0001    ПБ     L0027A                  ,переход на L0027A
         СЧ     0(М7)                   ,СМ := 0(М7)
L0027    ЗП     2(М7)                   ,2 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОД    L0027B                  ,мод.адрес по коду: L0027B
         УИА    0(М1)                   ,М1 := 0
         МОДА   L0027B(М1)              ,мод.адрес +1: L0027B(М1)
         СЧ     0                       ,СМ := 0
         МОДА   LOL32767(М1)            ,мод.адрес +1: LOL32767(М1)
         ЗП     0                       ,0 := СМ
         МОД    L0027B                  ,мод.адрес по коду: L0027B
L0027A   УИА    0(М1)                   ,М1 := 0
         МОДА   L0027B(М1)              ,мод.адрес +1: L0027B(М1)
         СЧ     0                       ,СМ := 0
         МОДА   LOL7(М1)                ,мод.адрес +1: LOL7(М1)
         ЗП     0                       ,0 := СМ
L0022    СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
L0025    ЗП     2(М7)                   ,2 := СМ
         ВЧОБ   1(М7)                   ,СМ := (адрес) - СМ
L0027B   РЖА    '22'                    ,РЖ := '22'
V2       ПО     L0027                   ,если СМ=0 → L0027
         ПБ     L0022                   ,переход на L0022
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    L0025(М7)               ,М7 := L0025
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

