***************************************************
* IBIT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5792 образа SIPROD.BIN
*   Длина при загрузке: 8 слов, 12 команд
*   Вход: IBIT
*   Регистры: М13, М14, М15
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*
IBIT     СТАРТ  0
         УИМ    М14                     ,М14 := СМ + стек
         УИ     М13                     ,М13 := СМ
         СЧ     0(М13)                  ,СМ := 0(М13)
         СЧМ    0(М14)                  ,магазин + СЧ: 0(М14)
         УИМ    М14                     ,М14 := СМ + стек
         СДА    64-1(М14)               ,сдвиг СМ влево на 1(М1
L0006    МОДА   L0006                   ,мод.адрес +1: L0006
L0007    И      0                       ,СМ &= 0
         МОДА   L0007                   ,мод.адрес +1: L0007
         ИЛИ    0                       ,СМ |= 0
         ПБ     0(М15)                  ,переход через М15
         МОДА   0                       ,мод.адрес +1: 0

