***************************************************
* KCOUNT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 6144 образа SIPROD.BIN
*   Длина при загрузке: 10 слов, 18 команд
*   Вход: KCOUNT
*   Регистры: М11, М13, М15, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*
KCOUNT   СТАРТ  0
         УИ     М11                     ,М11 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     0(М11)                  ,СМ := 0(М11)
         МОДА   L0011                   ,мод.адрес +1: L0011
         ВЧОБ   0                       ,СМ := (адрес) - СМ
L0005    УИМ    М11                     ,М11 := СМ + стек
         УИ     М13                     ,М13 := СМ
         СЛИА   1(М11)                  ,М11 += 1
         СЧ     0                       ,СМ := 0
L0011    МОДА   0                       ,мод.адрес +1: 0
         СЧМ    0(М13)                  ,магазин + СЧ: 0(М13)
         ЧЕД    0(М17)                  ,СМ := кол-во единиц в 0(М17)
         СЛИА   1(М13)                  ,М13 += 1
         ЦИКЛ   L0005(М11)              ,М11-- и если ≠0 → повтор
         МОДА   L0011                   ,мод.адрес +1: L0011
         ИЛИ    0                       ,СМ |= 0
         ПБ     0(М15)                  ,переход через М15
         МОДА   0                       ,мод.адрес +1: 0

