***************************************************
* KCOUNT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 6144 образа SIPROD.BIN
*   Длина при загрузке: 10 слов, 18 команд
*   Вход: KCOUNT
*   Регистры: М11, М13, М15, М17
***************************************************
KCOUNT  СТАРТ  0
        УИ     М11                      ,М11 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     KCOUNT(М11)              ,СМ := KCOUNT(М11)
        МОДА   L0011                    ,мод.адрес +1: L0011
        ВЧОБ   KCOUNT                   ,СМ := (адрес) - СМ
L0005   УИМ    М11                      ,М11 := СМ + стек
        УИ     М13                      ,М13 := СМ
        СЛИА   1(М11)                   ,М11 += 1
        СЧ     KCOUNT                   ,СМ := KCOUNT
L0011   МОДА   KCOUNT                   ,мод.адрес +1: KCOUNT
        СЧМ    KCOUNT(М13)              ,магазин + СЧ: KCOUNT(М13)
        ЧЕД    KCOUNT(М17)              ,СМ := кол-во единиц в KCOUNT(М17)
        СЛИА   1(М13)                   ,М13 += 1
        ЦИКЛ   L0005(М11)               ,М11-- и если ≠0 → повтор
        МОДА   L0011                    ,мод.адрес +1: L0011
        ИЛИ    KCOUNT                   ,СМ |= KCOUNT
        ПБ     KCOUNT(М15)              ,переход через М15
        МОДА   KCOUNT                   ,мод.адрес +1: KCOUNT

