***************************************************
* KONSTA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5184 образа SIPROD.BIN
*   Длина при загрузке: 132 слов, 4 команд
*   Вход: KONSTA
*   Выход: JMP смещение 2, через М15
*   Регистры: М10, М12, М15
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*
* ЛОКАЛЬНЫЕ СИМВОЛЫ (имя - смещение):
*   К39    122
*
KONSTA   СТАРТ  0
         УИА    JMP(М10)                ,М10 := JMP
         УИА    К39(М12)                ,М12 := К39
JMP      ПБ     0(М15)                  ,переход через М15
         МОДА   0                       ,мод.адрес +1: 0

