***************************************************
* KONSTA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5184 образа SIPROD.BIN
*   Длина при загрузке: 132 слов, 4 команд
*   Вход: KONSTA
*   Регистры: М10, М12, М15
***************************************************
KONSTA  СТАРТ  0
        УИА    L0002(М10)               ,М10 := L0002
        УИА    *0122B(М12)              ,М12 := *0122B
L0002   ПБ     KONSTA(М15)              ,переход через М15
        МОДА   KONSTA                   ,мод.адрес +1: KONSTA

