***************************************************
* MASVAL - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 10656 образа SIPROD.BIN
*   Длина при загрузке: 27 слов, 44 команд
*   Вход: MASVAL
*   Регистры: М1, М7, М10, М12, М15, М16
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*
MASVAL   СТАРТ  0
         УИА    V0(М16)                 ,М16 := V0
V0       ПБ     V0C                     ,переход на V0C
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     1(М7)                   ,1 := СМ
V0A      РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V0B                     ,переход на V0B
         МОДА   0                       ,мод.адрес +1: 0
         МОД    V4B                     ,мод.адрес по коду: V4B
         СЧ     0                       ,СМ := 0
V0B      МОД    V1B                     ,мод.адрес по коду: V1B
         УИА    0(М1)                   ,М1 := 0
V0C      МОД    V4                      ,мод.адрес по коду: V4
         ЗП     '4001'(М1)              ,'4001' := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     1(М7)                   ,1 := СМ
         РЖА    '22'                    ,РЖ := '22'
V1       МОДА   0                       ,мод.адрес +1: 0
         МОД    V4A                     ,мод.адрес по коду: V4A
         ВЧОБ   0                       ,СМ := (адрес) - СМ
V1A      ПО     V0A                     ,если СМ=0 → V0A
V1B      ПБ     V1                      ,переход на V1
V4       УИИ    М10(М7)                 ,М10 := М7
V4A      УИИ    М12(М16)                ,М12 := М16
V4B      УИА    V1A(М7)                 ,М7 := V1A
         ЗПМ    4(М7)                   ,ЗП + магазин: 4(М7)
         ЗПМ    3(М7)                   ,ЗП + магазин: 3(М7)
         ЗПМ    2(М7)                   ,ЗП + магазин: 2(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

