***************************************************
* MASVAL - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 10656 образа SIPROD.BIN
*   Длина при загрузке: 27 слов, 44 команд
*   Вход: MASVAL
*   Регистры: М1, М7, М10, М12, М15, М16
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*
MASVAL   СТАРТ  0
         УИА    L0001(М16)              ,М16 := L0001
L0001    ПБ     L0030                   ,переход на L0030
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     1(М7)                   ,1 := СМ
L0032    РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     L0027                   ,переход на L0027
         МОДА   0                       ,мод.адрес +1: 0
         МОД    V1                      ,мод.адрес по коду: V1
         СЧ     0                       ,СМ := 0
L0027    МОД    L0027A                  ,мод.адрес по коду: L0027A
         УИА    0(М1)                   ,М1 := 0
L0030    МОД    L0030A                  ,мод.адрес по коду: L0030A
         ЗП     '4001'(М1)              ,'4001' := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     1(М7)                   ,1 := СМ
         РЖА    '22'                    ,РЖ := '22'
L0031    МОДА   0                       ,мод.адрес +1: 0
         МОД    L0031A                  ,мод.адрес по коду: L0031A
         ВЧОБ   0                       ,СМ := (адрес) - СМ
L0026    ПО     L0032                   ,если СМ=0 → L0032
L0027A   ПБ     L0031                   ,переход на L0031
L0030A   УИИ    М10(М7)                 ,М10 := М7
L0031A   УИИ    М12(М16)                ,М12 := М16
V1       УИА    L0026(М7)               ,М7 := L0026
         ЗПМ    4(М7)                   ,ЗП + магазин: 4(М7)
         ЗПМ    3(М7)                   ,ЗП + магазин: 3(М7)
         ЗПМ    2(М7)                   ,ЗП + магазин: 2(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

