***************************************************
* NEWMAX - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 20864 образа SIPROD.BIN
*   Длина при загрузке: 71 слов, 136 команд
*   Вход: NEWMAX
*   Внешние: *LYG*, *NDAB*, *SEK*, *REGIM*
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1, 2
*   Смещения в *SEK*: 2, 3
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
NEWMAX  СТАРТ  0
        УИА    L0106(М16)               ,М16 := L0106
L0106   ПБ     REGIM2                   ,переход на REGIM2
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    SEK2                     ,мод.адрес по коду: SEK2
L0005   СЧ     NEWMAX                   ,СМ := NEWMAX
L0006   НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     L0005                    ,если СМ=0 → L0005
V1      ПБ     L0006                    ,переход на L0006
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
L0012   ПБ     NDAB                     ,переход на NDAB
V12     МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
NDAB    МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     NEWMAX                   ,СМ := NEWMAX
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   NEWMAX                   ,СМ := (адрес) - СМ
LYG1    МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
L0021   СЛ     NEWMAX                   ,СМ += NEWMAX
        РЖА    '22'                     ,РЖ := '22'
        ПО     V12                      ,если СМ=0 → V12
        ПБ     NDAB                     ,переход на NDAB
V13     МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
SEK3    ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     NEWMAX                   ,СМ := NEWMAX
СИМ12   РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ12                    ,мод.адрес +1: СИМ12
        ВЧ     NEWMAX                   ,СМ -= NEWMAX
        РЖА    '22'                     ,РЖ := '22'
L0036   ПЕ     LYG1                     ,если СМ≠0 → LYG1
СИМ122  ПБ     L0021                    ,переход на L0021
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   СИМ12                    ,мод.адрес +1: СИМ12
L0043   СЧ     NEWMAX                   ,СМ := NEWMAX
SEK32   СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
L0050   ПЕ     V13                      ,если СМ≠0 → V13
V14     ПБ     SEK3                     ,переход на SEK3
        ПБ     L01062                   ,переход на L01062
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     NEWMAX(М7)               ,СМ := NEWMAX(М7)
REGIM   СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
L0061   ПЕ     СИМ12                    ,если СМ≠0 → СИМ12
L01062  ПБ     СИМ122                   ,переход на СИМ122
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    SEK2                     ,мод.адрес по коду: SEK2
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
V15     ПО     L0036                    ,если СМ=0 → L0036
        ПБ     СИМ122                   ,переход на СИМ122
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
L0074   ПБ     L0074                    ,переход на L0074
REGIM2  МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     NEWMAX(М7)               ,СМ := NEWMAX(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     NEWMAX                   ,СМ := NEWMAX
L0102   НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПЕ     L0043                    ,если СМ≠0 → L0043
V16     ПБ     SEK32                    ,переход на SEK32
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
SEK2    ПБ     L01062                   ,переход на L01062
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     NEWMAX                   ,СМ := NEWMAX
        РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ14                    ,мод.адрес +1: СИМ14
        ВЧ     NEWMAX                   ,СМ -= NEWMAX
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0050                    ,если СМ≠0 → L0050
        ПБ     V14                      ,переход на V14
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   СИМ14                    ,мод.адрес +1: СИМ14
        СЧ     NEWMAX                   ,СМ := NEWMAX
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     REGIM                    ,если СМ=0 → REGIM
        ПБ     L01062                   ,переход на L01062
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    SEK2                     ,мод.адрес по коду: SEK2
        СЧ     NEWMAX                   ,СМ := NEWMAX
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     L0061                    ,если СМ=0 → L0061
        ПБ     L01062                   ,переход на L01062
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     NEWMAX                   ,СМ := NEWMAX
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        ЗП     NEWMAX                   ,NEWMAX := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    SEK2                     ,мод.адрес по коду: SEK2
        СЧ     NEWMAX                   ,СМ := NEWMAX
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    NEWMAX(М17)              ,СМ ^= NEWMAX(М17)
        ПО     V15                      ,если СМ=0 → V15
        ПБ     L0074                    ,переход на L0074
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        СЧ     NEWMAX(М7)               ,СМ := NEWMAX(М7)
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        ЗП     NEWMAX                   ,NEWMAX := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        ПБ     L0102                    ,переход на L0102
        МОДА   NEWMAX                   ,мод.адрес +1: NEWMAX
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    V16(М7)                  ,М7 := V16
        ЗПМ    2(М7)                    ,ЗП + магазин: 2(М7)
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     NEWMAX(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     NEWMAX(М10)              ,переход через М10

