***************************************************
* NEWMAX - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 20864 образа SIPROD.BIN
*   Длина при загрузке: 71 слов, 136 команд
*   Вход: NEWMAX
*   Выход: смещение 203, через М12, смещение 207, через М10
*   Внешние: LYG, NDAB, SEK, REGIM
*   Смещения в LYG: 1, 2
*   Смещения в NDAB: 1, 2
*   Смещения в SEK: 2, 3
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 LYG
*   002 LYG1
*   003 LYG2
*   004 NDAB
*   005 NDAB1
*   006 NDAB2
*   007 SEK
*   008 REGIM
*   009 SEK3
*   010 LYG3
*   011 SEK2
*   012 LYG5
*
NEWMAX   СТАРТ  0
         УИА    V1(М16)                 ,М16 := V1
V1       ПБ     REGIME                  ,переход на REGIME
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОД    SEK2A                   ,мод.адрес по коду: SEK2A
V1A      СЧ     0                       ,СМ := 0
V1B      НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V1A                     ,если СМ=0 → V1A
         ПБ     V1B                     ,переход на V1B
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NDABB                   ,переход на NDABB
NDABA    МОДА   0                       ,мод.адрес +1: 0
NDABB    МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
NDABC    МОДА   LYG1                    ,мод.адрес +1: LYG1
NDABD    СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПО     NDABA                   ,если СМ=0 → NDABA
         ПБ     NDABB                   ,переход на NDABB
V1C      МОДА   0                       ,мод.адрес +1: 0
SEK3A    ПБ     REGIMD                  ,переход на REGIMD
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
SEK3B    РЖА    '3'                     ,РЖ := '3'
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
SEK3C    ПЕ     NDABC                   ,если СМ≠0 → NDABC
SEK3D    ПБ     NDABD                   ,переход на NDABD
         ПБ     REGIMD                  ,переход на REGIMD
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG3                    ,мод.адрес +1: LYG3
LYG3A    СЧ     0                       ,СМ := 0
LYG3B    СЧИМ                           ,СЧИ + магазин
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
LYG3C    ПЕ     V1C                     ,если СМ≠0 → V1C
LYG3D    ПБ     SEK3A                   ,переход на SEK3A
         ПБ     REGIMC                  ,переход на REGIMC
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
REGIMA   СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
REGIMB   ПЕ     SEK3B                   ,если СМ≠0 → SEK3B
REGIMC   ПБ     SEK3D                   ,переход на SEK3D
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОД    SEK2A                   ,мод.адрес по коду: SEK2A
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
V1D      ПО     SEK3C                   ,если СМ=0 → SEK3C
         ПБ     SEK3D                   ,переход на SEK3D
         МОДА   0                       ,мод.адрес +1: 0
REGIMD   ПБ     REGIMD                  ,переход на REGIMD
REGIME   МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
REGIMF   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     LYG3A                   ,если СМ≠0 → LYG3A
REGIMG   ПБ     LYG3B                   ,переход на LYG3B
         МОДА   0                       ,мод.адрес +1: 0
SEK2A    ПБ     REGIMC                  ,переход на REGIMC
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEK2                    ,мод.адрес +1: SEK2
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     LYG3C                   ,если СМ≠0 → LYG3C
         ПБ     LYG3D                   ,переход на LYG3D
         ПБ     REGIMD                  ,переход на REGIMD
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEK2                    ,мод.адрес +1: SEK2
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     REGIMA                  ,если СМ=0 → REGIMA
         ПБ     REGIMC                  ,переход на REGIMC
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОД    SEK2A                   ,мод.адрес по коду: SEK2A
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     REGIMB                  ,если СМ=0 → REGIMB
         ПБ     REGIMC                  ,переход на REGIMC
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     REGIMD                  ,переход на REGIMD
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         МОДА   LYG1                    ,мод.адрес +1: LYG1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОД    SEK2A                   ,мод.адрес по коду: SEK2A
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V1D                     ,если СМ=0 → V1D
         ПБ     REGIMD                  ,переход на REGIMD
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   LYG1                    ,мод.адрес +1: LYG1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     REGIMF                  ,переход на REGIMF
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    REGIMG(М7)              ,М7 := REGIMG
         ЗПМ    2(М7)                   ,ЗП + магазин: 2(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10

