***************************************************
* NOTA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5920 образа SIPROD.BIN
*   Длина при загрузке: 12 слов, 20 команд
*   Вход: NOTA
*   Выход: FRAME (возврат через М15)
*   Регистры: М11, М12, М13, М15
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*
*** КОД МОДУЛЯ
*
NOTA     СТАРТ  0
         УИ     М11                     ,М11 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     0(М11)                  ,СМ := 0(М11)
         МОДА   GET                     ,мод.адрес +1: GET
         ВЧОБ   0                       ,СМ := (адрес) - СМ
POP      УИМ    М11                     ,М11 := СМ + стек
         УИМ    М12                     ,М12 := СМ + стек
         УИ     М13                     ,М13 := СМ
         СЛИА   1(М11)                  ,М11 += 1
         МОДА   0                       ,мод.адрес +1: 0
GET      СЧ     0(М13)                  ,СМ := 0(М13)
FRAME    МОДА   FRAME                   ,мод.адрес +1: FRAME
         НТЖ    0                       ,СМ ^= 0
         СЛИА   1(М13)                  ,М13 += 1
         ЗП     0(М12)                  ,0 := СМ
         СЛИА   1(М12)                  ,М12 += 1
         ЦИКЛ   POP(М11)                ,М11-- и если ≠0 → повтор
         ЗПМ    0                       ,ЗП + магазин: 0
         РЖА    '6'                     ,РЖ := '6'
         ПБ     0(М15)                  ,переход через М15
*

