***************************************************
* NUSTA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 14464 образа SIPROD.BIN
*   Длина при загрузке: 215 слов, 354 команд
*   Вход: NUSTA
*   Выход: ENDPG:V1+1, ENDPG:V1+1, SPAUD:NUSTB, SPAUD:V9, SPAUD:V44, 
*   SPAUD:SCAN90+1, REGIMJ (возврат через М12), REGIMJ (возврат через М10)
*   Внешние: FORMA, REGIM, PAGE, STR, SCANER, INS, ARPI, NDAB, NUST, FOP, 
*   BLO, LOL, BEGPG, RSYMB, FIRCAR, IDII
*   Смещения в FORMA: 10, 11
*   Смещения в INS: 24, 25, 26
*   Смещения в LOL: 2, 3, 4, 5, 6, 7, 10, 11
*   Смещения в NDAB: 1, 2
*   Смещения в NUST: 5, 6, 7
*   Смещения в REGIM: 8, 9
*   Смещения в SCANER: 1, 2
*   Смещения в STR: 24, 25, 26
*   Регистры: М1, М2, М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 FORMA
*   002 REGIM
*   003 PAGE
*   004 STR
*   005 STR24
*   006 STR25
*   007 STR26
*   008 SCANER
*   009 SCANER1
*   010 SCANER2
*   011 INS
*   012 INS24
*   013 INS25
*   014 INS26
*   015 ARPI
*   016 NDAB
*   017 NDAB1
*   018 NDAB2
*   019 NUST
*   020 FOP
*   021 BLO
*   022 LOL
*   023 BEGPG
*   024 RSYMB
*   025 FIRCAR
*   026 LOL3
*   027 LOL11
*   028 REGIM9
*   029 NUST5
*   030 IDII
*   031 LOL2
*   032 LOL4
*   033 NUST6
*   034 LOL5
*   035 LOL6
*   036 LOL7
*   037 LOL32767
*   038 REGIM8
*   039 FORMA10
*   040 LOL10
*   041 FORMA11
*   042 FORMA32767
*   043 REGIM32767
*   044 PAGE32767
*   045 NUST7
*
*** КОД МОДУЛЯ
*
NUSTA    СТАРТ  0
         УИА    LOL3A(М16)              ,М16 := LOL3A
LOL3A    ПБ     FORMAH                  ,переход на FORMAH
*
         СЧ     11(М7)                  ,СМ := 11(М7)
         МОДА   LOL3                    ,мод.адрес +1: LOL3
         ЗП     0                       ,0 := СМ
         СЧ     11(М7)                  ,СМ := 11(М7)
         МОДА   LOL11                   ,мод.адрес +1: LOL11
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     21(М7)                  ,21 := СМ
         РЖА    '3'                     ,РЖ := '3'
LOL3B    СЧ     0(М7)                   ,СМ := 0(М7)
LOL3C    ЗП     17(М7)                  ,17 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
LOL3D    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     LOL3B                   ,если СМ≠0 → LOL3B
         ПБ     LOL3C                   ,переход на LOL3C
*
         МОДА   0                       ,мод.адрес +1: 0
LOL3E    ПБ     LOL3D                   ,переход на LOL3D
*
LOL3F    МОДА   0                       ,мод.адрес +1: 0
         СЧ     14(М7)                  ,СМ := 14(М7)
         МОДА   LOL3                    ,мод.адрес +1: LOL3
         ЗП     0                       ,0 := СМ
         СЧ     14(М7)                  ,СМ := 14(М7)
         МОДА   LOL11                   ,мод.адрес +1: LOL11
         ЗП     0                       ,0 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         ЗП     21(М7)                  ,21 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     9(М7)                   ,СМ := 9(М7)
         ЗП     17(М7)                  ,17 := СМ
         РЖА    '22'                    ,РЖ := '22'
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM9                  ,мод.адрес +1: REGIM9
LOL3G    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     LOL3E                   ,если СМ≠0 → LOL3E
         ПБ     LOL3F                   ,переход на LOL3F
*
V7       МОДА   0                       ,мод.адрес +1: 0
         ПБ     LOL2B                   ,переход на LOL2B
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST5                   ,мод.адрес +1: NUST5
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         УИА    REGIMD(М16)             ,М16 := REGIMD
         ПВ     IDII(М15)               ,вызов через М15
         СЛ     10(М7)                  ,СМ += 10(М7)
         СЛ     17(М7)                  ,СМ += 17(М7)
         МОДА   LOL2                    ,мод.адрес +1: LOL2
         ЗП     0                       ,0 := СМ
LOL2A    МОДА   NUST5                   ,мод.адрес +1: NUST5
         СЧ     0                       ,СМ := 0
         ВЧ     5(М7)                   ,СМ -= 5(М7)
         МОДА   LOL3                    ,мод.адрес +1: LOL3
         ЗП     0                       ,0 := СМ
         МОДА   LOL2                    ,мод.адрес +1: LOL2
         СЧ     0                       ,СМ := 0
LOL2B    МОДА   LOL3                    ,мод.адрес +1: LOL3
         СЛ     0                       ,СМ += 0
         ЗП     16(М7)                  ,16 := СМ
         СЧ     12(М7)                  ,СМ := 12(М7)
         ВЧ     16(М7)                  ,СМ -= 16(М7)
         МОДА   LOL4                    ,мод.адрес +1: LOL4
         ЗП     0                       ,0 := СМ
LOL2C    СЧ     7(М7)                   ,СМ := 7(М7)
LOL2D    СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
LOL2E    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LOL3G                   ,если СМ=0 → LOL3G
LOL2F    ПБ     V7                      ,переход на V7
*
         МОДА   LOL4                    ,мод.адрес +1: LOL4
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     12(М7)                  ,СМ += 12(М7)
         МОДА   LOL4                    ,мод.адрес +1: LOL4
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST6                   ,мод.адрес +1: NUST6
LOL4A    СЧ     0                       ,СМ := 0
LOL4B    РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
LOL4C    УИА    REGIMD(М16)             ,М16 := REGIMD
         ПВ     IDII(М15)               ,вызов через М15
         СЛ     10(М7)                  ,СМ += 10(М7)
         МОДА   LOL5                    ,мод.адрес +1: LOL5
         ЗП     0                       ,0 := СМ
         МОДА   NUST6                   ,мод.адрес +1: NUST6
         СЧ     0                       ,СМ := 0
LOL5A    ВЧ     4(М7)                   ,СМ -= 4(М7)
         МОДА   LOL6                    ,мод.адрес +1: LOL6
         ЗП     0                       ,0 := СМ
LOL5B    МОДА   LOL5                    ,мод.адрес +1: LOL5
         СЧ     0                       ,СМ := 0
         МОДА   LOL6                    ,мод.адрес +1: LOL6
         СЛ     0                       ,СМ += 0
         ЗП     16(М7)                  ,16 := СМ
         СЧ     13(М7)                  ,СМ := 13(М7)
         ВЧ     16(М7)                  ,СМ -= 16(М7)
         МОДА   LOL7                    ,мод.адрес +1: LOL7
         ЗП     0                       ,0 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         ЗП     18(М7)                  ,18 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОД    REGIMF                  ,мод.адрес по коду: REGIMF
         УИА    0(М1)                   ,М1 := 0
LOL5C    МОДА   LOL32767(М1)            ,мод.адрес +1: LOL32767(М1)
LOL5D    СЧ     0                       ,СМ := 0
         МОДА   LOL7(М1)                ,мод.адрес +1: LOL7(М1)
         ЗП     0                       ,0 := СМ
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     18(М7)                  ,18 := СМ
LOL5E    ВЧОБ   6(М7)                   ,СМ := (адрес) - СМ
LOL5F    РЖА    '22'                    ,РЖ := '22'
         ПО     LOL2A                   ,если СМ=0 → LOL2A
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM8                  ,мод.адрес +1: REGIM8
LOL5G    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LOL2C                   ,если СМ=0 → LOL2C
         СЧ     7(М7)                   ,СМ := 7(М7)
LOL5H    СЧИМ                           ,СЧИ + магазин
         МОДА   NUST                    ,мод.адрес +1: NUST
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
LOL5I    ПЕ     LOL2C                   ,если СМ≠0 → LOL2C
LOL5J    ПБ     LOL2D                   ,переход на LOL2D
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     LOL2E                   ,переход на LOL2E
*
         МОДА   0                       ,мод.адрес +1: 0
FORMA1   МОДА   FORMA10                 ,мод.адрес +1: FORMA10
FORMAA   СЧ     0                       ,СМ := 0
         МОДА   LOL10                   ,мод.адрес +1: LOL10
         ЗП     0                       ,0 := СМ
FORMAB   МОДА   FORMA11                 ,мод.адрес +1: FORMA11
FORMAC   СЧ     0                       ,СМ := 0
         МОДА   LOL11                   ,мод.адрес +1: LOL11
         ЗП     0                       ,0 := СМ
FORMAD   СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     18(М7)                  ,18 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОД    REGIMF                  ,мод.адрес по коду: REGIMF
         УИА    0(М1)                   ,М1 := 0
         МОДА   LOL32767(М1)            ,мод.адрес +1: LOL32767(М1)
         СЧ     0                       ,СМ := 0
         МОДА   FORMA32767(М1)          ,мод.адрес +1: FORMA32767(М
         ЗП     0                       ,0 := СМ
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
FORMAE   ЗП     18(М7)                  ,18 := СМ
         ВЧОБ   8(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
FORMAF   ПО     LOL2F                   ,если СМ=0 → LOL2F
FORMAG   СЧ     7(М7)                   ,СМ := 7(М7)
FORMAH   СЧИМ                           ,СЧИ + магазин
         МОДА   NUST                    ,мод.адрес +1: NUST
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LOL4A                   ,если СМ=0 → LOL4A
         ПБ     LOL4B                   ,переход на LOL4B
*
REGIM3   ПБ     LOL5A                   ,переход на LOL5A
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
REGIMA   ЗП     18(М7)                  ,18 := СМ
REGIMB   РЖА    '3'                     ,РЖ := '3'
REGIMC   РЖА    '22'                    ,РЖ := '22'
REGIMD   МОД    REGIMF                  ,мод.адрес по коду: REGIMF
         УИА    0(М1)                   ,М1 := 0
         МОДА   REGIMH(М1)              ,мод.адрес +1: REGIMH(М1)
         СЧ     0                       ,СМ := 0
         МОДА   REGIM32767(М1)          ,мод.адрес +1: REGIM32767(М
         ЗП     0                       ,0 := СМ
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     18(М7)                  ,18 := СМ
         ВЧОБ   8(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     LOL4C                   ,если СМ=0 → LOL4C
         МОДА   0                       ,мод.адрес +1: 0
REGIME   СЧ     3(М7)                   ,СМ := 3(М7)
         ЗП     19(М7)                  ,19 := СМ
REGIMF   РЖА    '3'                     ,РЖ := '3'
REGIMG   СЧ     1(М7)                   ,СМ := 1(М7)
REGIMH   ЗП     18(М7)                  ,18 := СМ
REGIMI   РЖА    '22'                    ,РЖ := '22'
         МОД    REGIMG                  ,мод.адрес по коду: REGIMG
         УИА    0(М1)                   ,М1 := 0
         МОДА   FORMA32767(М1)          ,мод.адрес +1: FORMA32767(М
         СЧ     0                       ,СМ := 0
         МОД    REGIMF                  ,мод.адрес по коду: REGIMF
         УИА    0(М2)                   ,М2 := 0
         МОДА   PAGE32767(М2)           ,мод.адрес +1: PAGE32767(М2
         ЗП     0                       ,0 := СМ
         СЧ     19(М7)                  ,СМ := 19(М7)
         РЖА    '3'                     ,РЖ := '3'
REGIMJ   СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     19(М7)                  ,19 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     18(М7)                  ,18 := СМ
         ВЧОБ   4(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     LOL5B                   ,если СМ=0 → LOL5B
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST                    ,мод.адрес +1: NUST
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LOL5C                   ,если СМ=0 → LOL5C
         ПБ     LOL5D                   ,переход на LOL5D
*
         ПБ     FORMAA                  ,переход на FORMAA
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         ЗП     20(М7)                  ,20 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     FIRCAR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST                    ,мод.адрес +1: NUST
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LOL5E                   ,если СМ=0 → LOL5E
         ПБ     LOL5F                   ,переход на LOL5F
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     FORMAA                  ,переход на FORMAA
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         МОДА   NUST                    ,мод.адрес +1: NUST
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     0(М7)                   ,СМ := 0(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   NUST7                   ,мод.адрес +1: NUST7
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     LOL5G                   ,если СМ≠0 → LOL5G
         ПБ     LOL5H                   ,переход на LOL5H
*
         МОДА   NUST7                   ,мод.адрес +1: NUST7
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         МОДА   NUST7                   ,мод.адрес +1: NUST7
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LOL5I                   ,если СМ=0 → LOL5I
         ПБ     LOL5J                   ,переход на LOL5J
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     LOL3C                   ,переход на LOL3C
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM9                  ,мод.адрес +1: REGIM9
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     FORMA1                  ,если СМ=0 → FORMA1
         ПБ     FORMAA                  ,переход на FORMAA
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     LOL3D                   ,переход на LOL3D
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     20(М7)                  ,СМ := 20(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     FORMAB                  ,если СМ≠0 → FORMAB
         ПБ     FORMAC                  ,переход на FORMAC
*
         ПБ     FORMAG                  ,переход на FORMAG
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     20(М7)                  ,20 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     19(М7)                  ,19 := СМ
         РЖА    '22'                    ,РЖ := '22'
         УИА    REGIMA(М16)             ,М16 := REGIMA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    REGIMC(М16)             ,М16 := REGIMC
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    REGIMG(М16)             ,М16 := REGIMG
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     19(М7)                  ,СМ := 19(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     19(М7)                  ,19 := СМ
         ВЧОБ   15(М7)                  ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     FORMAD                  ,если СМ=0 → FORMAD
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     FORMAE                  ,если СМ≠0 → FORMAE
         ПБ     FORMAF                  ,переход на FORMAF
*
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGPG(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     REGIM3                  ,переход на REGIM3
*
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    REGIMB(М7)              ,М7 := REGIMB
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М2                      ,стек := М2, СМ := М2
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М2                      ,М2 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*

