***************************************************
* RASTXT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 16896 образа SIPROD.BIN
*   Длина при загрузке: 430 слов, 772 команд
*   Вход: RASTXT
*   Внешние: NRD, PUFOR, RAI, SEK, PUS, PAP, SUT, SLY, SCANER, DYD, PLN, 
*   LNT, STL, APJ, REGIM, LYG, ATV, TXT, TAB, STR, NUST, NDAB, NDABL, EGO, 
*   PAGE, INS, ENDPG, BEGPG, SEKLYG, LYGPAR, NEWMAX, SEKDYD, SEKGIR, 
*   BEGSTR, ENDSTR, SPAUD, KOKSEK, WTBACK, KLAIDA, RSYMB, IDII, IMUI
*   Смещения в ATV: 1
*   Смещения в DYD: 1, 2
*   Смещения в EGO: 2400, 4800, 7200
*   Смещения в INS: 24, 25, 26
*   Смещения в LYG: 1, 2
*   Смещения в NDAB: 1, 2
*   Смещения в NDABL: 1
*   Смещения в NRD: 24
*   Смещения в NUST: 1, 8
*   Смещения в PAGE: 1
*   Смещения в PUFOR: 6
*   Смещения в RAI: 1
*   Смещения в SCANER: 1, 2
*   Смещения в SEK: 2
*   Смещения в SLY: 1
*   Смещения в STL: 1
*   Смещения в STR: 24, 25, 26
*   Смещения в SUT: 1
*   Смещения в TAB: 1, 2, 3, 4
*   Смещения в TXT: 1, 2, 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 NRD
*   002 NRD24
*   003 PUFOR
*   004 RAI
*   005 RAI1
*   006 SEK
*   007 PUS
*   008 PAP
*   009 SUT
*   010 SUT1
*   011 SLY
*   012 SLY1
*   013 SCANER
*   014 SCANER1
*   015 SCANER2
*   016 DYD
*   017 DYD1
*   018 DYD2
*   019 PLN
*   020 LNT
*   021 STL
*   022 STL1
*   023 APJ
*   024 REGIM
*   025 LYG
*   026 LYG1
*   027 LYG2
*   028 ATV
*   029 ATV1
*   030 TXT
*   031 TXT1
*   032 TXT2
*   033 TXT3
*   034 TAB
*   035 TAB1
*   036 TAB2
*   037 TAB3
*   038 TAB4
*   039 STR
*   040 STR24
*   041 STR25
*   042 STR26
*   043 NUST
*   044 NDAB
*   045 NDAB1
*   046 NDAB2
*   047 NDABL
*   048 NDABL1
*   049 EGO
*   050 EGO2400
*   051 EGO4800
*   052 EGO7200
*   053 PAGE
*   054 PAGE1
*   055 INS
*   056 INS24
*   057 INS25
*   058 INS26
*   059 ENDPG
*   060 BEGPG
*   061 SEKLYG
*   062 LYGPAR
*   063 NEWMAX
*   064 SEKDYD
*   065 SEKGIR
*   066 BEGSTR
*   067 ENDSTR
*   068 SPAUD
*   069 KOKSEK
*   070 WTBACK
*   071 KLAIDA
*   072 RSYMB
*   073 NUST1
*   074 SEK2
*   076 NUST8
*   077 LYG3
*   078 EGO35167
*   079 EGO32767
*   080 IDII
*   081 IMUI
*   082 EGO37567
*   083 LYG32769
*   084 SEK32767
*   085 PUFOR6
*
RASTXT   СТАРТ  0
         УИА    TAB4A(М16)              ,М16 := TAB4A
TAB4A    ПБ     TXT3B                   ,переход на TXT3B
         СЧ     6(М7)                   ,СМ := 6(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TAB4                    ,мод.адрес +1: TAB4
L0005    СЧ     0                       ,СМ := 0
NUST1A   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0005                   ,если СМ=0 → L0005
         ПБ     NUST1A                  ,переход на NUST1A
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     L0114                   ,переход на L0114
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     11(М7)                  ,11 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     12(М7)                  ,12 := СМ
         УИА    NRD(М16)                ,М16 := NRD
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    TAB1(М16)               ,М16 := TAB1
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0616(М16)              ,М16 := L0616
         СЧИМ   М16                     ,стек := М16, СМ := М16
L0032    УИА    TAB3C(М16)              ,М16 := TAB3C
RSYMBA   СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         УИА    NRD(М16)                ,М16 := NRD
         СЧИМ   М16                     ,стек := М16, СМ := М16
L0042    УИА    TAB2(М16)               ,М16 := TAB2
         СЧИМ   М16                     ,стек := М16, СМ := М16
RSYMBB   УИА    LYGA(М16)               ,М16 := LYGA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    TAB3C(М16)              ,М16 := TAB3C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
LNTA     МОДА   LNT                     ,мод.адрес +1: LNT
V2       СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     L0032                   ,если СМ≠0 → L0032
         ПБ     RSYMBA                  ,переход на RSYMBA
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     RSYMBB                  ,переход на RSYMBB
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     11(М7)                  ,СМ := 11(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     3(М7)                   ,СМ += 3(М7)
         ЗП     11(М7)                  ,11 := СМ
         СЧ     12(М7)                  ,СМ := 12(М7)
         ВЧ     3(М7)                   ,СМ -= 3(М7)
         ЗП     12(М7)                  ,12 := СМ
         СЧ     11(М7)                  ,СМ := 11(М7)
KLAIDB   ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     12(М7)                  ,СМ += 12(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     L0042                   ,если СМ≠0 → L0042
         ПБ     RSYMBB                  ,переход на RSYMBB
         МОДА   0                       ,мод.адрес +1: 0
         УИА    V1E(М16)                ,М16 := V1E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     KLAIDA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TXT2                    ,мод.адрес +1: TXT2
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   TXT1                    ,мод.адрес +1: TXT1
L0114    ВЧ     0                       ,СМ -= 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     13(М7)                  ,13 := СМ
         СЧ     12(М7)                  ,СМ := 12(М7)
L0120    ВЧ     11(М7)                  ,СМ -= 11(М7)
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     14(М7)                  ,14 := СМ
         СЧ     6(М7)                   ,СМ := 6(М7)
L0124    СЧИМ                           ,СЧИ + магазин
PAPA     МОДА   PAP                     ,мод.адрес +1: PAP
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
L0131    ПО     LNTA                    ,если СМ=0 → LNTA
V6       ПБ     V2                      ,переход на V2
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     KLAIDB                  ,переход на KLAIDB
         МОДА   0                       ,мод.адрес +1: 0
NDAB1A   МОДА   NDAB1                   ,мод.адрес +1: NDAB1
NDABLA   СЧ     0                       ,СМ := 0
         МОДА   NDABL1                  ,мод.адрес +1: NDABL1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         МОДА   NDABL                   ,мод.адрес +1: NDABL
         ЗП     0                       ,0 := СМ
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         МОДА   STL                     ,мод.адрес +1: STL
         ЗП     0                       ,0 := СМ
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         МОДА   STL1                    ,мод.адрес +1: STL1
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   DYD1                    ,мод.адрес +1: DYD1
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   DYD2                    ,мод.адрес +1: DYD2
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
DYDA     МОДА   DYD                     ,мод.адрес +1: DYD
PAPB     ЗП     0                       ,0 := СМ
         СЧ     6(М7)                   ,СМ := 6(М7)
         МОДА   PAP                     ,мод.адрес +1: PAP
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
PAGEA    МОДА   PAGE                    ,мод.адрес +1: PAGE
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     11(М7)                  ,СМ += 11(М7)
STR25A   МОДА   STR25                   ,мод.адрес +1: STR25
PAGEB    ЗП     0                       ,0 := СМ
         МОДА   PAGE                    ,мод.адрес +1: PAGE
         СЧ     0                       ,СМ := 0
         СЛ     12(М7)                  ,СМ += 12(М7)
STR26A   МОДА   STR26                   ,мод.адрес +1: STR26
SEK2A    ЗП     0                       ,0 := СМ
         МОДА   SEK2                    ,мод.адрес +1: SEK2
         СЧ     0                       ,СМ := 0
WTBACA   МОДА   PUS                     ,мод.адрес +1: PUS
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     WTBACK(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         МОДА   STR24                   ,мод.адрес +1: STR24
         ЗП     0                       ,0 := СМ
L0222    РЖА    '3'                     ,РЖ := '3'
STR25B   МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         МОДА   RAI1                    ,мод.адрес +1: RAI1
L0226    ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
TXT2A    СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT2                    ,мод.адрес +1: TXT2
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0120                   ,если СМ=0 → L0120
         ПБ     PAPA                    ,переход на PAPA
V1       МОДА   0                       ,мод.адрес +1: 0
TXT3A    СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
L0244    НТЖ    0(М17)                  ,СМ ^= 0(М17)
V2A      ПЕ     L0124                   ,если СМ≠0 → L0124
         ПБ     PAPA                    ,переход на PAPA
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     INS25A                  ,переход на INS25A
V2B      МОДА   0                       ,мод.адрес +1: 0
TXT2B    СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT2                    ,мод.адрес +1: TXT2
         СЧ     0                       ,СМ := 0
V1A      НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0131                   ,если СМ=0 → L0131
         ПБ     V6                      ,переход на V6
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     PAPB                    ,переход на PAPB
V1B      МОДА   0                       ,мод.адрес +1: 0
         СЧ     6(М7)                   ,СМ := 6(М7)
         СЧИМ                           ,СЧИ + магазин
TAB4B    МОДА   TAB4                    ,мод.адрес +1: TAB4
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NDAB1A                  ,если СМ≠0 → NDAB1A
         ПБ     NDABLA                  ,переход на NDABLA
KOKSEA   МОДА   0                       ,мод.адрес +1: 0
         ПВ     KOKSEK(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
INS25A   МОДА   INS25                   ,мод.адрес +1: INS25
         СЧ     0                       ,СМ := 0
         ЗП     15(М7)                  ,15 := СМ
         РЖА    '3'                     ,РЖ := '3'
INS26A   МОДА   INS26                   ,мод.адрес +1: INS26
SCANEA   СЧ     0                       ,СМ := 0
         ЗП     16(М7)                  ,16 := СМ
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         СЧ     0                       ,СМ := 0
L0307    ЗП     17(М7)                  ,17 := СМ
TXT1A    МОДА   TXT1                    ,мод.адрес +1: TXT1
         СЧ     0                       ,СМ := 0
         МОДА   INS25                   ,мод.адрес +1: INS25
         ЗП     0                       ,0 := СМ
         МОДА   TXT2                    ,мод.адрес +1: TXT2
         СЧ     0                       ,СМ := 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   INS26                   ,мод.адрес +1: INS26
L0320    ЗП     0                       ,0 := СМ
         УИА    SEKLYA(М16)             ,М16 := SEKLYA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    NDABA(М16)              ,М16 := NDABA
         СЧИМ   М16                     ,стек := М16, СМ := М16
L0325    РЖА    '22'                    ,РЖ := '22'
SPAUDA   ПВ     SPAUD(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     15(М7)                  ,СМ := 15(М7)
         МОДА   INS25                   ,мод.адрес +1: INS25
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     16(М7)                  ,СМ := 16(М7)
         МОДА   INS26                   ,мод.адрес +1: INS26
         ЗП     0                       ,0 := СМ
L0341    СЧ     17(М7)                  ,СМ := 17(М7)
SCANEB   МОДА   SCANER                  ,мод.адрес +1: SCANER
TAB3A    ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TAB3                    ,мод.адрес +1: TAB3
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
L0351    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     DYDA                    ,если СМ≠0 → DYDA
         ПБ     PAPB                    ,переход на PAPB
STR24A   ПБ     PAPB                    ,переход на PAPB
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR24                   ,мод.адрес +1: STR24
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
V1C      ПО     PAGEA                   ,если СМ=0 → PAGEA
         ПБ     PAGEB                   ,переход на PAGEB
         МОДА   0                       ,мод.адрес +1: 0
TAB3B    СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TAB3                    ,мод.адрес +1: TAB3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR25A                  ,если СМ≠0 → STR25A
         ПБ     PAGEB                   ,переход на PAGEB
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TXT3A                   ,переход на TXT3A
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
L0404    СЧИМ                           ,СЧИ + магазин
STR24B   МОДА   STR24                   ,мод.адрес +1: STR24
L0406    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
STR25C   ПО     STR26A                  ,если СМ=0 → STR26A
         ПБ     SEK2A                   ,переход на SEK2A
         ПБ     TXT3A                   ,переход на TXT3A
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         ЗП     19(М7)                  ,19 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     L0226                   ,переход на L0226
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    ATV1A(М16)              ,М16 := ATV1A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0602(М16)              ,М16 := L0602
         СЧИМ   М16                     ,стек := М16, СМ := М16
L0430    УИА    TAB3C(М16)              ,М16 := TAB3C
RSYMBC   СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     9(М7)                   ,СМ := 9(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     '4113'(М7)              ,СМ := '4113'(М7)
L0441    НТЖ    0(М17)                  ,СМ ^= 0(М17)
V9       ПЕ     L0222                   ,если СМ≠0 → L0222
         ПБ     STR25B                  ,переход на STR25B
         ПБ     TXT2A                   ,переход на TXT2A
         МОДА   0                       ,мод.адрес +1: 0
L0446    СЧ     19(М7)                  ,СМ := 19(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     19(М7)                  ,19 := СМ
         РЖА    '22'                    ,РЖ := '22'
V19      МОДА   0                       ,мод.адрес +1: 0
STR24C   МОДА   STR24                   ,мод.адрес +1: STR24
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ПО     WTBACA                  ,если СМ=0 → WTBACA
         ПБ     TXT3A                   ,переход на TXT3A
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
L0461    СЧ     0                       ,СМ := 0
ENDSTA   ЗП     20(М7)                  ,20 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDSTR(М15)             ,вызов через М15
         СЧ     20(М7)                  ,СМ := 20(М7)
         СЧИМ                           ,СЧИ + магазин
NDAB1B   МОДА   NDAB1                   ,мод.адрес +1: NDAB1
BEGSTA   СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V1                      ,если СМ=0 → V1
         ПБ     TXT3A                   ,переход на TXT3A
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TAB3                    ,мод.адрес +1: TAB3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
L0505    ПЕ     L0244                   ,если СМ≠0 → L0244
V1D      ПБ     V2A                     ,переход на V2A
         МОДА   0                       ,мод.адрес +1: 0
SEKGIA   ПБ     V1A                     ,переход на V1A
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LNT                     ,мод.адрес +1: LNT
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V2B                     ,если СМ=0 → V2B
         ПБ     TXT2B                   ,переход на TXT2B
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     SEKGIR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     SEKDYD(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
L0526    УИА    V2D(М16)                ,М16 := V2D
L0527    СЧИМ   М16                     ,стек := М16, СМ := М16
NEWMAA   ПВ     NEWMAX(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     LYGPAR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   DYD1                    ,мод.адрес +1: DYD1
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     V1B                     ,если СМ≠0 → V1B
NDAB1C   ПБ     TAB4B                   ,переход на TAB4B
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         МОДА   DYD1                    ,мод.адрес +1: DYD1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   DYD2                    ,мод.адрес +1: DYD2
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     KOKSEA                  ,если СМ≠0 → KOKSEA
         ПБ     INS25A                  ,переход на INS25A
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЧ     0                       ,СМ := 0
         МОДА   DYD2                    ,мод.адрес +1: DYD2
L0571    ЗП     0                       ,0 := СМ
TXT3B    РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
L0577    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     INS26A                  ,если СМ=0 → INS26A
L0602    ПБ     SCANEA                  ,переход на SCANEA
V2C      МОДА   0                       ,мод.адрес +1: 0
         ПБ     SPAUDA                  ,переход на SPAUDA
V2D      МОДА   0                       ,мод.адрес +1: 0
L0606    СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
TAB3C    МОДА   TAB3                    ,мод.адрес +1: TAB3
         СЧ     0                       ,СМ := 0
V1E      НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     L0307                   ,если СМ≠0 → L0307
         ПБ     TXT1A                   ,переход на TXT1A
         МОДА   0                       ,мод.адрес +1: 0
L0616    ПБ     V1C                     ,переход на V1C
LYGA     МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG                     ,мод.адрес +1: LYG
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LNT                     ,мод.адрес +1: LNT
         СЛ     0                       ,СМ += 0
NDABA    МОДА   NDAB                    ,мод.адрес +1: NDAB
ATV1A    ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   ATV1                    ,мод.адрес +1: ATV1
L0632    СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     L0320                   ,если СМ≠0 → L0320
L0636    ПБ     SPAUDA                  ,переход на SPAUDA
V2E      МОДА   0                       ,мод.адрес +1: 0
SEKLYA   МОДА   TXT                     ,мод.адрес +1: TXT
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     L0325                   ,если СМ≠0 → L0325
         ПБ     SPAUDA                  ,переход на SPAUDA
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TAB3A                   ,переход на TAB3A
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     SEKLYG(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   DYD2                    ,мод.адрес +1: DYD2
         СЧ     0                       ,СМ := 0
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         МОДА   DYD1                    ,мод.адрес +1: DYD1
         СЧ     0                       ,СМ := 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TAB4                    ,мод.адрес +1: TAB4
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0341                   ,если СМ=0 → L0341
         ПБ     SCANEB                  ,переход на SCANEB
         ПБ     TAB3B                   ,переход на TAB3B
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     L0571                   ,переход на L0571
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TAB4                    ,мод.адрес +1: TAB4
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   DYD                     ,мод.адрес +1: DYD
         СЧ     0                       ,СМ := 0
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     1(М7)                   ,СМ += 1(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     L0351                   ,если СМ=0 → L0351
         ПБ     STR24A                  ,переход на STR24A
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         МОДА   DYD                     ,мод.адрес +1: DYD
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   DYD                     ,мод.адрес +1: DYD
         ВЧ     0                       ,СМ -= 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЧ     0                       ,СМ := 0
         МОДА   DYD                     ,мод.адрес +1: DYD
         ВЧ     0                       ,СМ -= 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     L0571                   ,переход на L0571
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     6(М7)                   ,СМ := 6(М7)
         МОДА   TAB4                    ,мод.адрес +1: TAB4
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     L0571                   ,переход на L0571
         СЧ     6(М7)                   ,СМ := 6(М7)
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   DYD2                    ,мод.адрес +1: DYD2
         СЧ     0                       ,СМ := 0
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         МОДА   DYD1                    ,мод.адрес +1: DYD1
         СЧ     0                       ,СМ := 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     21(М7)                  ,21 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     22(М7)                  ,22 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0404                   ,если СМ=0 → L0404
         ПБ     STR24B                  ,переход на STR24B
         ПБ     NEWMAA                  ,переход на NEWMAA
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     BEGSTA                  ,переход на BEGSTA
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         ЗП     23(М7)                  ,23 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОД    L0632                   ,мод.адрес по коду: L0632
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO35167(М1)            ,мод.адрес +1: EGO35167(М1)
         СЧ     0                       ,СМ := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         ЗП     0                       ,0 := СМ
         СЧ     23(М7)                  ,СМ := 23(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     23(М7)                  ,23 := СМ
         ВЧОБ   8(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     STR25C                  ,если СМ=0 → STR25C
         СЧ     2(М7)                   ,СМ := 2(М7)
         ЗП     24(М7)                  ,24 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     6(М7)                   ,СМ := 6(М7)
         МОДА   APJ                     ,мод.адрес +1: APJ
         ЗП     0                       ,0 := СМ
         МОДА   NDABL1                  ,мод.адрес +1: NDABL1
         СЧ     0                       ,СМ := 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     L0430                   ,если СМ≠0 → L0430
         ПБ     RSYMBC                  ,переход на RSYMBC
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     L0446                   ,переход на L0446
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDABL1                  ,мод.адрес +1: NDABL1
         СЧ     0                       ,СМ := 0
         УИА    L0606(М16)              ,М16 := L0606
         ПВ     IDII(М15)               ,вызов через М15
         ЗП     25(М7)                  ,25 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   NDABL1                  ,мод.адрес +1: NDABL1
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         СЧ     25(М7)                  ,СМ := 25(М7)
         УИА    L0606(М16)              ,М16 := L0606
         ПВ     IMUI(М15)               ,вызов через М15
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0441                   ,если СМ=0 → L0441
         ПБ     V9                      ,переход на V9
         ПБ     L0446                   ,переход на L0446
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDABL1                  ,мод.адрес +1: NDABL1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGPG(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     V19                     ,если СМ≠0 → V19
         ПБ     STR24C                  ,переход на STR24C
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     ENDSTA                  ,переход на ENDSTA
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     24(М7)                  ,СМ := 24(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     24(М7)                  ,24 := СМ
         СЧ     24(М7)                  ,СМ := 24(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     3(М7)                   ,СМ += 3(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     L0461                   ,если СМ=0 → L0461
         ПБ     ENDSTA                  ,переход на ENDSTA
         ПБ     L0446                   ,переход на L0446
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   APJ                     ,мод.адрес +1: APJ
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NDAB1B                  ,если СМ=0 → NDAB1B
         ПБ     BEGSTA                  ,переход на BEGSTA
         ПБ     NEWMAA                  ,переход на NEWMAA
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         СЧ     0                       ,СМ := 0
         ЗП     26(М7)                  ,26 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDPG(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     26(М7)                  ,СМ := 26(М7)
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         ЗП     0                       ,0 := СМ
         СЧ     22(М7)                  ,СМ := 22(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     22(М7)                  ,22 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     22(М7)                  ,СМ := 22(М7)
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     L0505                   ,если СМ=0 → L0505
         ПБ     V1D                     ,переход на V1D
         ПБ     L0406                   ,переход на L0406
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         ЗП     27(М7)                  ,27 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОД    L0636                   ,мод.адрес по коду: L0636
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO37567(М1)            ,мод.адрес +1: EGO37567(М1)
         СЧ     0                       ,СМ := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         ЗП     0                       ,0 := СМ
         СЧ     27(М7)                  ,СМ := 27(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     27(М7)                  ,27 := СМ
         ВЧОБ   8(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     SEKGIA                  ,если СМ=0 → SEKGIA
         СЧ     6(М7)                   ,СМ := 6(М7)
         МОДА   APJ                     ,мод.адрес +1: APJ
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     BEGPG(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     L0526                   ,если СМ≠0 → L0526
         ПБ     L0527                   ,переход на L0527
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NEWMAA                  ,переход на NEWMAA
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGPG(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   APJ                     ,мод.адрес +1: APJ
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LYG1                    ,мод.адрес +1: LYG1
         СЧ     0                       ,СМ := 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         МОДА   NDABL1                  ,мод.адрес +1: NDABL1
         СЧ     0                       ,СМ := 0
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЛ     0                       ,СМ += 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   NUST1                   ,мод.адрес +1: NUST1
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         ЗП     28(М7)                  ,28 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОД    V2E                     ,мод.адрес по коду: V2E
         УИА    0(М1)                   ,М1 := 0
         МОДА   LYG32769(М1)            ,мод.адрес +1: LYG32769(М1)
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОД    V2E                     ,мод.адрес по коду: V2E
         УИА    0(М1)                   ,М1 := 0
         МОДА   SEK32767(М1)            ,мод.адрес +1: SEK32767(М1)
         ЗП     0                       ,0 := СМ
         СЧ     28(М7)                  ,СМ := 28(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     28(М7)                  ,28 := СМ
         ВЧОБ   4(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     NDAB1C                  ,если СМ=0 → NDAB1C
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   PAP                     ,мод.адрес +1: PAP
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   SUT                     ,мод.адрес +1: SUT
         ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   SUT1                    ,мод.адрес +1: SUT1
         ЗП     0                       ,0 := СМ
         МОДА   INS26                   ,мод.адрес +1: INS26
         СЧ     0                       ,СМ := 0
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         МОДА   INS26                   ,мод.адрес +1: INS26
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   PLN                     ,мод.адрес +1: PLN
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         МОДА   PUFOR6                  ,мод.адрес +1: PUFOR6
         ЗП     0                       ,0 := СМ
         ПБ     L0577                   ,переход на L0577
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    V2C(М7)                 ,М7 := V2C
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

