***************************************************
* RSYMB - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 5280 образа SIPROD.BIN
*   Длина при загрузке: 38 слов, 76 команд
*   Вход: RSYMB
*   Выход: ADRSEK:V0, ADRSEK:ADR2B, BEGPG:V13A+1, BEGPG:V13A+1, 
*   BEGPG:V13A+1, BEGPG:V13A+1, BEGPG:V13A+1, DOUBLE:STR24A, FILL:STR24B, 
*   GETSTR:PUSHB+1, GETSTR:PUSHB+1, HOWSMB:WHO1A, KODKOD:NEWST3, KODKOD:V5, 
*   KOKSON:ADRA, KOKSON:ADR3D+1, NUSTA:REGIMJ+1, ONESTR:V16, PAPRAP:V2C, 
*   PAPRAP:COMCOB, PAPRAP:V20, PAPRAP:EGO86K, PAPRAP:PUSH+1, PAPRAP:PUSH+1, 
*   PAPRAP:PUSH+1, PAPRAP:PUSH+1, PILDYK:V1B, RASTXT:ADDR, RASTXT:LNTA, 
*   RASTXT:V9, RMAKR:PAGE1L+1, SCAN:SCANEA, SEGTAB:STR25A, SEGTAB:V26A, 
*   SPAUD:SCAN03, SPAUD:SCAN41, SPAUD:V44A, SPAUD:V45, SPAUD:SCAN90+1, 
*   SPAUD:SCAN90+1, SPAUD:SCAN90+1, SPAUD:SCAN90+1, STAATP:V9, STAATP:V9D, 
*   SYTINT:V2D, SYTINT:V2J, TAMPYK:V2, TAMTXT:STR26A, TAMTXT:V11, 
*   TAMTXT:V9C, TAMTXT:BEN2V+1, TARPOZ:V0, TARPOZ:V0D, TARPOZ:STR26A, 
*   TARPOZ:BEN1G+1, TITLE:V9, TITLE:V9B, TITLE:V15B+1, TOKREZ:SCANEP+1, 
*   TOPAGE:EGO32C+1, WHATYP:V11, WRITUR:FOR6A, WRITUR:V9, WRITUR:EGO41H+1, 
*   L9A (возврат через ячейка 0), L9A (возврат через М15), 
*   L9A (возврат через М15), L9A (возврат через М15)
*   РАЗБОР СИМВОЛА (КОД СИМВОЛА ИЗ ТЕКСТА).
*   Внешние: KONSTA, SYTOBI
*   Смещения в SYTOBI: 1, 2, 3, 4, 5
*   Регистры: М6, М7, М10, М11, М12, М13, М14, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 KONSTA
*   002 SYTOBI
*   003 SYTOBI1
*   004 SYTOBI2
*   005 SYTOBI3
*   006 SYTOBI4
*   007 SYTOBI5
*   008 СИМ10
*   009 СИМ11
*   010 СИМ12
*
*** КОД МОДУЛЯ
*
RSYMB    СТАРТ  0
         СЧИМ   М7                      ,стек := М7, СМ := М7
         СЧИМ   М15                     ,стек := М15, СМ := М15
         ПВ     KONSTA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ЗПМ    9(М12)                  ,ЗП + магазин: 9(М12)
         ЗПМ    12(М12)                 ,ЗП + магазин: 12(М12)
         УИМ    М13                     ,М13 := СМ + стек
         УИ     М16                     ,М16 := СМ
         СЧ     0(М13)                  ,СМ := 0(М13)
SYTOBA   ПВ     SYTOBI5(М15)            ,вызов через М15
         СЛИ    М16(М7)                 ,М16 += М7
         СЧИ    М7                      ,СМ := М7
         СЛИА   СИМ10(М11)              ,М11 += СИМ10
         И      4(М10)                  ,СМ &= 4(М10)
         ПО     SYTOBA                  ,если СМ=0 → SYTOBA
         СЛИА   СИМ11(М17)              ,М17 += СИМ11
         ПБ     FRAME                   ,переход на FRAME
*
FRAME    МОДА   0                       ,мод.адрес +1: 0
         УИИ    М13(М11)                ,М13 := М11
         СЧ     0(М17)                  ,СМ := 0(М17)
         УИМ    М11                     ,М11 := СМ + стек
         УИ     М14                     ,М14 := СМ
         СЧ     0(М11)                  ,СМ := 0(М11)
         ПВ     SYTOBI5(М15)            ,вызов через М15
         СЧИ    М11                     ,СМ := М11
         СЛИ    М14(М7)                 ,М14 += М7
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         УИ     М11                     ,М11 := СМ
         СЧИ    М7                      ,СМ := М7
AND      И      4(М10)                  ,СМ &= 4(М10)
         ПЕ     FRAME                   ,если СМ≠0 → FRAME
         ПВ     SYTOBI1(М15)            ,вызов через М15
         ПВ     SYTOBI2(М15)            ,вызов через М15
L9       МОДА   0                       ,мод.адрес +1: 0
         СЧ     12(М12)                 ,СМ := 12(М12)
L9A      УИМ    М7                      ,М7 := СМ + стек
         РЖА    '6'                     ,РЖ := '6'
         МОД    9(М12)                  ,мод.адрес по коду: 9(М12)
         ПБ     0                       ,переход на 0
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧИМ   М15                     ,стек := М15, СМ := М15
         ПВ     KONSTA(М15)             ,вызов через М15
         УИМ    М15                     ,М15 := СМ + стек
         РЖА    '3'                     ,РЖ := '3'
         УИ     М11                     ,М11 := СМ
         СЧ     0(М11)                  ,СМ := 0(М11)
         ВЧОБ   3(М10)                  ,СМ := (адрес) - СМ
         ПО     L9                      ,если СМ=0 → L9
         СЧИМ   М6                      ,стек := М6, СМ := М6
         СЧИМ   М15                     ,стек := М15, СМ := М15
         ЗПМ    10(М12)                 ,ЗП + магазин: 10(М12)
         ЗПМ    13(М12)                 ,ЗП + магазин: 13(М12)
         УИМ    М6                      ,М6 := СМ + стек
         СЛИА   1(М6)                   ,М6 += 1
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЛИА   1(М17)                  ,М17 += 1
         МОДА   0                       ,мод.адрес +1: 0
         ПИО    L9A(М6)                 ,если ИР=0 → L9A(М6)
         ПВ     SYTOBI1(М15)            ,вызов через М15
         СЛИА   1(М6)                   ,М6 += 1
         ПВ     SYTOBI2(М15)            ,вызов через М15
         ПБ     AND                     ,переход на AND
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     0(М15)                  ,переход через М15
*
         МОДА   0                       ,мод.адрес +1: 0
         СЛИА   СИМ12(М17)              ,М17 += СИМ12
         СЧ     0(М17)                  ,СМ := 0(М17)
         ПБ     0(М15)                  ,переход через М15
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧМ    13(М12)                 ,магазин + СЧ: 13(М12)
         СЧМ    10(М12)                 ,магазин + СЧ: 10(М12)
         УИМ    М15                     ,М15 := СМ + стек
         УИМ    М6                      ,М6 := СМ + стек
         СЧ     0(М17)                  ,СМ := 0(М17)
         ПБ     0(М15)                  ,переход через М15
*

