***************************************************
* RWBIT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 6016 образа SIPROD.BIN
*   Длина при загрузке: 15 слов, 24 команд
*   Вход: RWBIT
*   Выход: RWINF:V1C+1, SUB (возврат через М15)
*   Регистры: М10, М11, М12, М13, М14, М15, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*
*** КОД МОДУЛЯ
*
RWBIT    СТАРТ  0
         УИМ    М13                     ,М13 := СМ + стек
         УИА    SUB(М10)                ,М10 := SUB
         УИМ    М14                     ,М14 := СМ + стек
         УИМ    М12                     ,М12 := СМ + стек
         УИ     М11                     ,М11 := СМ
         СЧ     0(М11)                  ,СМ := 0(М11)
         СЧМ    0(М12)                  ,магазин + СЧ: 0(М12)
         УИМ    М12                     ,М12 := СМ + стек
         РЖА    '3'                     ,РЖ := '3'
         СДА    64-1(М12)               ,сдвиг СМ влево на 1(М1
         И      1(М10)                  ,СМ &= 1(М10)
         СЧМ    0(М13)                  ,магазин + СЧ: 0(М13)
SUB      ВЧОБ   0(М10)                  ,СМ := (адрес) - СМ
         УИМ    М13                     ,М13 := СМ + стек
         СДА    64(М13)                 ,сдвиг СМ на 64(М13)
         СЧМ    1(М10)                  ,магазин + СЧ: 1(М10)
         СДА    64(М13)                 ,сдвиг СМ на 64(М13)
         НТЖ    2(М10)                  ,СМ ^= 2(М10)
         СЧМ    0(М14)                  ,магазин + СЧ: 0(М14)
         И      0(М17)                  ,СМ &= 0(М17)
         ИЛИ    0(М17)                  ,СМ |= 0(М17)
         ЗПМ    0(М14)                  ,ЗП + магазин: 0(М14)
         РЖА    '6'                     ,РЖ := '6'
         ПБ     0(М15)                  ,переход через М15
*

