***************************************************
* RWBIT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 6016 образа SIPROD.BIN
*   Длина при загрузке: 15 слов, 24 команд
*   Вход: RWBIT
*   Выход: RWINF:INF2A, RWBIT (возврат через М15)
*   Регистры: М10 (блок вызывающего), М11 (буфер, счётчик), 
*   М12 (магазин, кадр параметров ОС), М13 (счётчик), 
*   М14 (смещение в буфере), М15 (адрес возврата), М17 (контекст задачи)
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*
* ЛОКАЛЬНЫЕ СИМВОЛЫ (имя - смещение в словах от начала модуля):
*   К0     14
*
*** КОД МОДУЛЯ
*
RWBIT    СТАРТ  0
         УИМ    М13                     ,М13 := СМ; СМ := из магазина
         УИА    К0(М10)                 ,М10 := адрес К0
         УИМ    М14                     ,М14 := СМ; СМ := из магазина
         УИМ    М12                     ,М12 := СМ; СМ := из магазина
         УИ     М11                     ,М11 := СМ
         СЧ     0(М11)                  ,СМ := смещение в буфере 0
         СЧМ    0(М12)                  ,магазин + СЧ: 0(М12)
         УИМ    М12                     ,М12 := СМ; СМ := из магазина
         РЖА    '3'                     ,РЖ := 3 (переходы по нулю)
         СДА    64-1(М12)
         И      1(М10)                  ,СМ &= поле блока вызывающего 1
         СЧМ    0(М13)                  ,магазин + СЧ: 0(М13)
         ВЧОБ   0(М10)                  ,СМ := (адрес) - СМ
         УИМ    М13                     ,М13 := СМ; СМ := из магазина
         СДА    64(М13)
         СЧМ    1(М10)                  ,магазин + СЧ: 1(М10)
         СДА    64(М13)
         НТЖ    2(М10)                  ,СМ ^= поле блока вызывающего 2
         СЧМ    0(М14)                  ,магазин + СЧ: 0(М14)
         И      0(М17)                  ,СМ &= поле контекста 0
         ИЛИ    0(М17)                  ,СМ |= поле контекста 0
         ЗПМ    0(М14)                  ,ЗП + магазин: 0(М14)
         РЖА    '6'                     ,РЖ := 6 (обращение к ОС)
         ПБ     0(М15)                  ,переход через М15
*

