***************************************************
* SCAKOD - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 19680 образа SIPROD.BIN
*   Длина при загрузке: 82 слов, 130 команд
*   Вход: SCAKOD
*   Внешние: NEW, REG, IMA, IMUI, IDII, IPOI
*   Смещения в IMA: 32762
*   Регистры: М1, М7, М10, М12, М14, М15, М16
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 NEW
*   002 REG
*   003 IMA
*   004 IMUI
*   005 IDII
*   006 IMUIA
*   007 IMA32762
*   008 IPOI
*
SCAKOD   СТАРТ  0
         УИА    IDIIA(М16)              ,М16 := IDIIA
IDIIA    ПБ     IPOIA                   ,переход на IPOIA
         МОДА   NEW                     ,мод.адрес +1: NEW
         СЧ     0                       ,СМ := 0
         УИА    NEWB(М16)               ,М16 := NEWB
         ПВ     IDII(М15)               ,вызов через М15
         ЗП     9(М7)                   ,9 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     9(М7)                   ,СМ := 9(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         УИА    NEWB(М16)               ,М16 := NEWB
         ПВ     IMUIA(М15)              ,вызов через М15
         МОДА   NEW                     ,мод.адрес +1: NEW
         СЛ     0                       ,СМ += 0
L0016    ЗП     10(М7)                  ,10 := СМ
IMUIAA   СЧ     1(М7)                   ,СМ := 1(М7)
         УИА    IDIIB(М16)              ,М16 := IDIIB
         ПВ     IMUIA(М15)              ,вызов через М15
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     11(М7)                  ,11 := СМ
L0057    ПВ     IMUIAB(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     10(М7)                  ,СМ := 10(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     2(М7)                   ,СМ += 2(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     L0016                   ,если СМ=0 → L0016
         ПБ     IMUIAA                  ,переход на IMUIAA
         ПБ     L0057                   ,переход на L0057
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     11(М7)                  ,СМ := 11(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     11(М7)                  ,11 := СМ
         ПВ     IMUIAB(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     10(М7)                  ,СМ := 10(М7)
         ВЧ     3(М7)                   ,СМ -= 3(М7)
         ЗП     10(М7)                  ,10 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОД    L0101                   ,мод.адрес по коду: L0101
         УИА    0(М1)                   ,М1 := 0
         МОДА   IMA32762(М1)            ,мод.адрес +1: IMA32762(М1)
L0053    СЧ     0                       ,СМ := 0
         ЗП     12(М7)                  ,12 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     3(М7)                   ,СМ := 3(М7)
IMUIAB   ВЧ     10(М7)                  ,СМ -= 10(М7)
         ЗП     8(М7)                   ,8 := СМ
         СЧ     6(М7)                   ,СМ := 6(М7)
         УИА    L0112(М16)              ,М16 := L0112
         ПВ     IMUIA(М15)              ,вызов через М15
L0064    ЗП     8(М7)                   ,8 := СМ
         УИА    IMUIAC(М16)             ,М16 := IMUIAC
         СЧИ    М16                     ,СМ := М16
         УИА    L0112(М16)              ,М16 := L0112
IPOIA    ПВ     IPOI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ЗП     13(М7)                  ,13 := СМ
         СЧ     12(М7)                  ,СМ := 12(М7)
         УИА    IDIIC(М16)              ,М16 := IDIIC
         ПВ     IDII(М15)               ,вызов через М15
NEWA     МОДА   NEW                     ,мод.адрес +1: NEW
         ЗП     0                       ,0 := СМ
         МОДА   NEW                     ,мод.адрес +1: NEW
L0101    СЧ     0                       ,СМ := 0
L0102    ВЧОБ   0                       ,СМ := (адрес) - СМ
IMUIAC   УИА    IDIIC(М16)              ,М16 := IDIIC
         ПВ     IMUIA(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЛ     12(М7)                  ,СМ += 12(М7)
NEWB     МОДА   NEW                     ,мод.адрес +1: NEW
         ЗП     0                       ,0 := СМ
L0111    СЧ     13(М7)                  ,СМ := 13(М7)
L0112    УИА    L0111(М16)              ,М16 := L0111
IDIIB    ПВ     IDII(М15)               ,вызов через М15
         ЗП     8(М7)                   ,8 := СМ
         МОДА   NEW                     ,мод.адрес +1: NEW
         СЧ     0                       ,СМ := 0
IDIIC    УИА    L0112(М16)              ,М16 := L0112
         ПВ     IDII(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NEW                     ,мод.адрес +1: NEW
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     NEWA                    ,переход на NEWA
         УИИ    М14(М15)                ,М14 := М15
         МОДА   REG                     ,мод.адрес +1: REG
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ПВ     L0064(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '22'                    ,РЖ := '22'
         ПБ     0(М14)                  ,переход через М14
         ВЧ     14(М7)                  ,СМ -= 14(М7)
         ЗП     14(М7)                  ,14 := СМ
         СЧМ    4(М7)                   ,магазин + СЧ: 4(М7)
         ПВ     IMUI(М16)               ,вызов через М16
         СЛ     '4011'(М7)              ,СМ += '4011'(М7)
         ЗП     '4011'(М7)              ,'4011' := СМ
         СЧ     11(М7)                  ,СМ := 11(М7)
         ЗП     14(М7)                  ,14 := СМ
         ПБ     0(М15)                  ,переход через М15
         МОДА   0                       ,мод.адрес +1: 0
         ВЧ     15(М7)                  ,СМ -= 15(М7)
         ЗП     15(М7)                  ,15 := СМ
         СЛ     '4011'(М7)              ,СМ += '4011'(М7)
         ЗП     '4011'(М7)              ,'4011' := СМ
         МОДА   REG                     ,мод.адрес +1: REG
         СЧ     0                       ,СМ := 0
         ЗП     15(М7)                  ,15 := СМ
         ПБ     0(М15)                  ,переход через М15
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    L0102(М7)               ,М7 := L0102
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         ПВ     L0053(М15)              ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

