***************************************************
* SCAKOD - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 19680 образа SIPROD.BIN
*   Длина при загрузке: 82 слов, 130 команд
*   Вход: SCAKOD
*   Внешние: *NEW*, *REG*, *IMA*, I*MUI*, I*DI*I, I*MU*I, I*PO*I
*   Смещения в *IMA*: 32762
*   Регистры: М1, М7, М10, М12, М14, М15, М16
***************************************************
SCAKOD  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     IPOI                     ,переход на IPOI
IDII    МОДА   *NEW*                    ,мод.адрес +1: *NEW*
        СЧ     SCAKOD                   ,СМ := SCAKOD
        УИА    NEW3(М16)                ,М16 := NEW3
        ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     9(М7)                    ,9 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0010   СЧ     9(М7)                    ,СМ := 9(М7)
        ВЧОБ   SCAKOD                   ,СМ := (адрес) - СМ
IMUI    УИА    NEW3(М16)                ,М16 := NEW3
        ПВ     I*MU*I(М15)              ,вызов через М15
NEW     МОДА   *NEW*                    ,мод.адрес +1: *NEW*
        СЛ     SCAKOD                   ,СМ += SCAKOD
L0016   ЗП     10(М7)                   ,10 := СМ
IMUI2   СЧ     1(М7)                    ,СМ := 1(М7)
        УИА    IDII2(М16)               ,М16 := IDII2
        ПВ     I*MU*I(М15)              ,вызов через М15
        СЛ     SCAKOD(М7)               ,СМ += SCAKOD(М7)
        ЗП     11(М7)                   ,11 := СМ
L0057   ПВ     IMUI3(М15)               ,вызов через М15
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        СЧ     10(М7)                   ,СМ := 10(М7)
        ВЧОБ   SCAKOD                   ,СМ := (адрес) - СМ
        СЛ     IDII(М7)                 ,СМ += IDII(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0016                    ,если СМ=0 → L0016
        ПБ     IMUI2                    ,переход на IMUI2
        ПБ     L0057                    ,переход на L0057
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        СЧ     11(М7)                   ,СМ := 11(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     SCAKOD(М7)               ,СМ += SCAKOD(М7)
        ЗП     11(М7)                   ,11 := СМ
        ПВ     IMUI3(М15)               ,вызов через М15
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        СЧ     10(М7)                   ,СМ := 10(М7)
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        ЗП     10(М7)                   ,10 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОД    L0101                    ,мод.адрес по коду: L0101
        УИА    SCAKOD(М1)               ,М1 := SCAKOD
        МОДА   *IMA*+77772(М1)          ,мод.адрес +1: *IMA*+77772(
L0053   СЧ     SCAKOD                   ,СМ := SCAKOD
        ЗП     12(М7)                   ,12 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     3(М7)                    ,СМ := 3(М7)
IMUI3   ВЧ     10(М7)                   ,СМ -= 10(М7)
        ЗП     8(М7)                    ,8 := СМ
        СЧ     6(М7)                    ,СМ := 6(М7)
        УИА    L0112(М16)               ,М16 := L0112
        ПВ     I*MU*I(М15)              ,вызов через М15
L0064   ЗП     8(М7)                    ,8 := СМ
        УИА    IMUI4(М16)               ,М16 := IMUI4
        СЧИ    М16                      ,СМ := М16
        УИА    L0112(М16)               ,М16 := L0112
IPOI    ПВ     I*PO*I(М15)              ,вызов через М15
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        ЗП     13(М7)                   ,13 := СМ
        СЧ     12(М7)                   ,СМ := 12(М7)
        УИА    IDII3(М16)               ,М16 := IDII3
        ПВ     I*DI*I(М15)              ,вызов через М15
NEW2    МОДА   *NEW*                    ,мод.адрес +1: *NEW*
        ЗП     SCAKOD                   ,SCAKOD := СМ
        МОДА   *NEW*                    ,мод.адрес +1: *NEW*
L0101   СЧ     SCAKOD                   ,СМ := SCAKOD
L0102   ВЧОБ   SCAKOD                   ,СМ := (адрес) - СМ
IMUI4   УИА    IDII3(М16)               ,М16 := IDII3
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        СЛ     NEW(М7)                  ,СМ += NEW(М7)
NEW3    МОДА   *NEW*                    ,мод.адрес +1: *NEW*
        ЗП     SCAKOD                   ,SCAKOD := СМ
L0111   СЧ     13(М7)                   ,СМ := 13(М7)
L0112   УИА    L0111(М16)               ,М16 := L0111
IDII2   ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     8(М7)                    ,8 := СМ
        МОДА   *NEW*                    ,мод.адрес +1: *NEW*
        СЧ     SCAKOD                   ,СМ := SCAKOD
IDII3   УИА    L0112(М16)               ,М16 := L0112
        ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        МОДА   *NEW*                    ,мод.адрес +1: *NEW*
        ЗП     SCAKOD                   ,SCAKOD := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     NEW2                     ,переход на NEW2
        УИИ    М14(М15)                 ,М14 := М15
        МОДА   *REG*                    ,мод.адрес +1: *REG*
        СЧ     SCAKOD                   ,СМ := SCAKOD
        РЖА    '3'                      ,РЖ := '3'
        ПВ     L0064(М15)               ,вызов через М15
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        РЖА    '22'                     ,РЖ := '22'
        ПБ     SCAKOD(М14)              ,переход через М14
        ВЧ     14(М7)                   ,СМ -= 14(М7)
        ЗП     14(М7)                   ,14 := СМ
        СЧМ    4(М7)                    ,магазин + СЧ: 4(М7)
        ПВ     I*MUI*(М16)              ,вызов через М16
        СЛ     *4011B(М7)               ,СМ += *4011B(М7)
        ЗП     '4011'(М7)               ,'4011' := СМ
        СЧ     11(М7)                   ,СМ := 11(М7)
        ЗП     14(М7)                   ,14 := СМ
        ПБ     SCAKOD(М15)              ,переход через М15
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        ВЧ     15(М7)                   ,СМ -= 15(М7)
        ЗП     15(М7)                   ,15 := СМ
        СЛ     *4011B(М7)               ,СМ += *4011B(М7)
        ЗП     '4011'(М7)               ,'4011' := СМ
        МОДА   *REG*                    ,мод.адрес +1: *REG*
        СЧ     SCAKOD                   ,СМ := SCAKOD
        ЗП     15(М7)                   ,15 := СМ
        ПБ     SCAKOD(М15)              ,переход через М15
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0102(М7)                ,М7 := L0102
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        ПВ     L0053(М15)               ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SCAKOD(М12)              ,переход через М12
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SCAKOD(М10)              ,переход через М10
        МОДА   SCAKOD                   ,мод.адрес +1: SCAKOD

