***************************************************
* SCHEMA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 10848 образа SIPROD.BIN
*   Длина при загрузке: 521 слов, 860 команд
*   Вход: SCHEMA
*   Внешние: *BLO*, *RUSIS*, *INS*, *NUSTA*, *EGO*, *NDAB*, *TXT*, *PAGE*, 
*   *STR*, *STAND*, *STANN*, *STV*, *MKR*, *SCANER*, *NUST*, *REGIM*, 
*   *FOP*, *RPT*, *GOT*, *FIN*, SPAUD, REDTXT, LOADGO, ENDKOR, WRIKOR, 
*   ENDPG, TOPAGE, GOSTAS, SYTINT, KLAIDA, RNSYMB,      Ы Ц, GETSTR, START, 
*   I*DI*I
*   Смещения в *EGO*: 7200, 8600, 8601
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *MKR*: 500, 501
*   Смещения в *NDAB*: 1, 2
*   Смещения в *PAGE*: 3, 4
*   Смещения в *REGIM*: 8, 9
*   Смещения в *SCANER*: 1, 2
*   Смещения в *STAND*: 1
*   Смещения в *STR*: 24
*   Смещения в *TXT*: 3
*   Регистры: М1, М2, М7, М10, М12, М15, М16, М17
***************************************************
SCHEMA  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     FOP4                     ,переход на FOP4
L0002   СЧ     1(М7)                    ,СМ := 1(М7)
L0712   ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L07122                   ,мод.адрес по коду: L07122
L0010   УИА    SCHEMA(М1)               ,М1 := SCHEMA
REGIM7  МОДА   *REGIM*+77777(М1)        ,мод.адрес +1: *REGIM*+7777
V1      ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
REGIM   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   13(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0712                    ,если СМ=0 → L0712
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     26(М7)                   ,26 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        МОД    L0713                    ,мод.адрес по коду: L0713
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   *INS*+77777(М1)          ,мод.адрес +1: *INS*+77777(
        ЗП     SCHEMA                   ,SCHEMA := СМ
V12     МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     26(М7)                   ,СМ := 26(М7)
L0041   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     26(М7)                   ,26 := СМ
        ВЧОБ   15(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     REGIM                    ,если СМ=0 → REGIM
L0047   СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
FOP     МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *RPT*                    ,мод.адрес +1: *RPT*
SCANER  ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        ЗП     27(М7)                   ,27 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
INS32   ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
RUSIS   МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
START   ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     START(М15)               ,вызов через М15
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        ЗП     28(М7)                   ,28 := СМ
SCANEA  МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ВЧ     SCHEMA                   ,СМ -= SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0047                    ,если СМ≠0 → L0047
        ПБ     FOP                      ,переход на FOP
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0116   ПБ     SCANER                   ,переход на SCANER
GETSTR  МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L07232(М16)              ,М16 := L07232
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GETSTR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
ЫЦ      МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ          Ы Ц(М15)            ,вызов через М15
V13     МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
SCANEB  СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     INS32                    ,если СМ=0 → INS32
SCANEC  ПБ     START                    ,переход на START
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0146   РЖА    '3'                      ,РЖ := '3'
INS322  ВЧОБ   SCHEMA                   ,СМ := (адрес) - СМ
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0151   СЛ     SCHEMA                   ,СМ += SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        ПО     RUSIS                    ,если СМ=0 → RUSIS
        ПБ     START                    ,переход на START
V7      МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
V72     ПБ     SCANER                   ,переход на SCANER
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        ЗП     29(М7)                   ,29 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0163   СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
BLO     МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0170   ВЧ     1(М7)                    ,СМ -= 1(М7)
RNSYMB  ЗП     24(М7)                   ,24 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0711(М16)               ,М16 := L0711
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0716(М16)               ,М16 := L0716
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0664(М16)               ,М16 := L0664
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RNSYMB(М15)              ,вызов через М15
L0206   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
BLO2    СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
BLO3    СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОД    L07122                   ,мод.адрес по коду: L07122
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
L0772   МОДА   L07722(М1)               ,мод.адрес +1: L07722(М1)
        СЧ     SCHEMA                   ,СМ := SCHEMA
        СЧИМ                            ,СЧИ + магазин
        СЧ     29(М7)                   ,СМ := 29(М7)
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0116                    ,если СМ=0 → L0116
L0233   ПБ     GETSTR                   ,переход на GETSTR
V29     ПБ     ЫЦ                       ,переход на ЫЦ
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
L0240   СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   7(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
L0244   ПО     SCANEA                   ,если СМ=0 → SCANEA
        УИА    L0702(М16)               ,М16 := L0702
        СЧИМ   М16                      ,стек := М16, СМ := М16
KLAIDA  ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0002(М7)                ,СМ += L0002(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
L0256   СЧ     7(М7)                    ,СМ := 7(М7)
BLO4    СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
L0263   НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
STANN   ПЕ     V13                      ,если СМ≠0 → V13
        ПБ     SCANEB                   ,переход на SCANEB
        ПБ     SCANEC                   ,переход на SCANEC
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *STANN*                  ,мод.адрес +1: *STANN*
L0272   ЗП     SCHEMA                   ,SCHEMA := СМ
GOT     РЖА    '3'                      ,РЖ := '3'
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
V9      РЖА    '22'                     ,РЖ := '22'
        ПБ     V12                      ,переход на V12
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     6(М7)                    ,СМ := 6(М7)
BLO5    СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0146                    ,если СМ≠0 → L0146
V6      ПБ     INS322                   ,переход на INS322
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0772                    ,переход на L0772
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        ЗП     30(М7)                   ,30 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0321   РЖА    '22'                     ,РЖ := '22'
SCANED  МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
L0326   ВЧ     SCHEMA                   ,СМ -= SCHEMA
ЫЦ2     РЖА    '22'                     ,РЖ := '22'
        ПО     V7                       ,если СМ=0 → V7
        ПБ     V72                      ,переход на V72
        ПБ     BLO3                     ,переход на BLO3
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ          Ы Ц(М15)            ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0336   СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
SCANEE  МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0163                    ,если СМ=0 → L0163
        ПБ     BLO                      ,переход на BLO
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0151                    ,переход на L0151
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     14(М7)                   ,СМ := 14(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
SCANEF  СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0170                    ,если СМ≠0 → L0170
        ПБ     RNSYMB                   ,переход на RNSYMB
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     BLO3                     ,переход на BLO3
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
L0366   ЗП     31(М7)                   ,31 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    FOP5(М16)                ,М16 := FOP5
L0372   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    IDII(М16)                ,М16 := IDII
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
SYTINT  ПВ     SYTINT(М15)              ,вызов через М15
SCANEG  МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     31(М7)                   ,СМ := 31(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
L0405   РЖА    '3'                      ,РЖ := '3'
L0406   СЧ     27(М7)                   ,СМ := 27(М7)
        ВЧОБ   SCHEMA                   ,СМ := (адрес) - СМ
        СЛ     REGIM7(М7)               ,СМ += REGIM7(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0206                    ,если СМ≠0 → L0206
        ПБ     BLO2                     ,переход на BLO2
        СЧ     9(М7)                    ,СМ := 9(М7)
        ЗП     27(М7)                   ,27 := СМ
RPT     РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     27(М7)                   ,СМ := 27(М7)
        МОДА   *RPT*                    ,мод.адрес +1: *RPT*
SCANEH  ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0426   СЛ     L0001(М7)                ,СМ += L0001(М7)
SCANEI  МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     1(М7)                    ,СМ -= 1(М7)
SCANEJ  МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
GOT2    ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        ВЧ     1(М7)                    ,СМ -= 1(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V12                      ,переход на V12
FOP2    МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
BLO6    НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0233                    ,если СМ≠0 → L0233
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0233                    ,если СМ=0 → L0233
        ПБ     V29                      ,переход на V29
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0240                    ,переход на L0240
GOSTAS  МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     GOSTAS(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
BLO7    РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
L0504   НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0244                    ,если СМ=0 → L0244
        ПБ     KLAIDA                   ,переход на KLAIDA
GOT3    МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
V3      ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0516   СЧ     3(М7)                    ,СМ := 3(М7)
BLO8    СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0256                    ,если СМ=0 → L0256
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0256                    ,если СМ=0 → L0256
        ПБ     BLO4                     ,переход на BLO4
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0534   ПБ     GOSTAS                   ,переход на GOSTAS
V5      МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
FOP3    МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0263                    ,если СМ≠0 → L0263
        ПБ     STANN                    ,переход на STANN
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     V9                       ,переход на V9
PAGE3   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
TOPAGE  СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     SCHEMA                   ,СМ += SCHEMA
        ЗП     32(М7)                   ,32 := СМ
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        ВЧ     32(М7)                   ,СМ -= 32(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0272                    ,если СМ≠0 → L0272
        ПБ     GOT                      ,переход на GOT
        ПВ     TOPAGE(М15)              ,вызов через М15
ENDPG   МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDPG(М15)               ,вызов через М15
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     SCHEMA                   ,SCHEMA := СМ
V92     РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
GOT4    СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *GOT*                    ,мод.адрес +1: *GOT*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     BLO5                     ,если СМ=0 → BLO5
        ПБ     V6                       ,переход на V6
V14     МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0612   УИА    L0660(М16)               ,М16 := L0660
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0614   УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    STANN2(М16)              ,М16 := STANN2
WRIKOR  СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0321                    ,если СМ=0 → L0321
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
BLO9    МОДА   *BLO*                    ,мод.адрес +1: *BLO*
L0635   СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0321                    ,если СМ=0 → L0321
V4      ПБ     SCANED                   ,переход на SCANED
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0366                    ,переход на L0366
V42     МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0644   СЧ     1(М7)                    ,СМ := 1(М7)
FOP4    СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0326                    ,если СМ=0 → L0326
        ПБ     ЫЦ2                      ,переход на ЫЦ2
V15     МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     GOSTAS                   ,переход на GOSTAS
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0656   СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
STAND   МОДА   *STAND*                  ,мод.адрес +1: *STAND*
L0660   ЗП     SCHEMA                   ,SCHEMA := СМ
L0661   РЖА    '3'                      ,РЖ := '3'
L0662   СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     33(М7)                   ,33 := СМ
L0664   СЧ     9(М7)                    ,СМ := 9(М7)
L0665   СЧИМ                            ,СЧИ + магазин
STANN2  МОДА   *STANN*                  ,мод.адрес +1: *STANN*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
L0671   НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0336                    ,если СМ=0 → L0336
L0673   ПБ     SCANEE                   ,переход на SCANEE
L0674   СЧ     12(М7)                   ,СМ := 12(М7)
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        УИА    STANN3(М16)              ,М16 := STANN3
L0701   СЧИМ   М16                      ,стек := М16, СМ := М16
L0702   УИА    L0722(М16)               ,М16 := L0722
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0704   УИА    L0673(М16)               ,М16 := L0673
WRIKOA  СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
V122    МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0710   РЖА    '3'                      ,РЖ := '3'
L0711   РЖА    '22'                     ,РЖ := '22'
L07122  СЧ     33(М7)                   ,СМ := 33(М7)
L0713   УИА    L0671(М16)               ,М16 := L0671
IDII    ПВ     I*DI*I(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
L0716   ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
FOP5    СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
L0722   ЗП     SCHEMA                   ,SCHEMA := СМ
L0723   СЧ     1(М7)                    ,СМ := 1(М7)
L0724   ЗП     25(М7)                   ,25 := СМ
L07232  РЖА    '22'                     ,РЖ := '22'
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0041(М7)                ,СМ += L0041(М7)
        ЗП     34(М7)                   ,34 := СМ
        МОД    L0723                    ,мод.адрес по коду: L0723
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   FOP6(М1)                 ,мод.адрес +1: FOP6(М1)
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОД    L07122                   ,мод.адрес по коду: L07122
        УИА    SCHEMA(М2)               ,М2 := SCHEMA
        МОДА   *PAGE*+77777(М2)         ,мод.адрес +1: *PAGE*+77777
L0741   ЗП     SCHEMA                   ,SCHEMA := СМ
L0742   РЖА    '22'                     ,РЖ := '22'
V25     МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
L0745   РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
L0747   ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   5(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     SCANEF                   ,если СМ=0 → SCANEF
        ПБ     GOSTAS                   ,переход на GOSTAS
        СЧ     8(М7)                    ,СМ := 8(М7)
        СЧИМ                            ,СЧИ + магазин
FOP6    МОДА   *FOP*                    ,мод.адрес +1: *FOP*
BLOA    СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0372                    ,если СМ=0 → L0372
        ПБ     SCANEG                   ,переход на SCANEG
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     SYTINT                   ,если СМ≠0 → SYTINT
L07722  ПБ     SCANEG                   ,переход на SCANEG
V43     МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     GOSTAS                   ,переход на GOSTAS
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
STANN3  МОДА   *STANN*                  ,мод.адрес +1: *STANN*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
WRIKOB  ПЕ     L0405                    ,если СМ≠0 → L0405
        ПБ     L0406                    ,переход на L0406
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     RPT                      ,переход на RPT
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    STAND(М16)               ,М16 := STAND
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0665(М16)               ,М16 := L0665
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     5(М7)                    ,СМ := 5(М7)
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     SCANEH                   ,переход на SCANEH
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    WRIKOB(М16)              ,М16 := WRIKOB
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0674(М16)               ,М16 := L0674
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     L0426                    ,если СМ≠0 → L0426
        ПБ     SCANEI                   ,переход на SCANEI
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     FOP2                     ,переход на FOP2
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     SCANEJ                   ,если СМ=0 → SCANEJ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     SCANEJ                   ,если СМ=0 → SCANEJ
        ПБ     GOT2                     ,переход на GOT2
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     FOP2                     ,переход на FOP2
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    STANN3(М16)              ,М16 := STANN3
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    STANN3(М16)              ,М16 := STANN3
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0665(М16)               ,М16 := L0665
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0662(М16)               ,М16 := L0662
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     ENDKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     8(М7)                    ,СМ := 8(М7)
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0041(М7)                ,СМ += L0041(М7)
        ЗП     34(М7)                   ,34 := СМ
        МОД    L0723                    ,мод.адрес по коду: L0723
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   L0742(М1)                ,мод.адрес +1: L0742(М1)
        СЧ     SCHEMA                   ,СМ := SCHEMA
        МОД    L07122                   ,мод.адрес по коду: L07122
        УИА    SCHEMA(М2)               ,М2 := SCHEMA
        МОДА   *PAGE*+77777(М2)         ,мод.адрес +1: *PAGE*+77777
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   5(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     BLO6                     ,если СМ=0 → BLO6
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОД    *BLO*                    ,мод.адрес по коду: *BLO*
        ПБ     GOSTAS                   ,переход на GOSTAS
        ПБ     BLO7                     ,переход на BLO7
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     L0504                    ,переход на L0504
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     GOT3                     ,переход на GOT3
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     V3                       ,переход на V3
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     TOPAGE                   ,переход на TOPAGE
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     ENDPG                    ,переход на ENDPG
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    WRIKOA(М16)              ,М16 := WRIKOA
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V92                      ,переход на V92
        УИА    L0710(М16)               ,М16 := L0710
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     V92                      ,переход на V92
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L0704(М16)               ,М16 := L0704
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     V92                      ,переход на V92
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0516                    ,если СМ=0 → L0516
        ПБ     BLO8                     ,переход на BLO8
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     PAGE3                    ,переход на PAGE3
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+11               ,мод.адрес +1: *REGIM*+11
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     GOSTAS(М15)              ,вызов через М15
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0534                    ,если СМ=0 → L0534
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПО     L0534                    ,если СМ=0 → L0534
        ПБ     V5                       ,переход на V5
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     PAGE3                    ,переход на PAGE3
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        МОД    L07122                   ,мод.адрес по коду: L07122
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   *EGO*+77777(М1)          ,мод.адрес +1: *EGO*+77777(
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   18(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     FOP3                     ,если СМ=0 → FOP3
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     REDTXT(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     WRIKOR                   ,переход на WRIKOR
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *STV*                    ,мод.адрес +1: *STV*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *MKR*+765                ,мод.адрес +1: *MKR*+765
        ЗП     SCHEMA                   ,SCHEMA := СМ
        УИА    V122(М16)                ,М16 := V122
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     LOADGO(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *STV*                    ,мод.адрес +1: *STV*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+10               ,мод.адрес +1: *REGIM*+10
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *MKR*+765                ,мод.адрес +1: *MKR*+765
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     WRIKOR                   ,переход на WRIKOR
        УИА    V43(М16)                 ,М16 := V43
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0701(М16)               ,М16 := L0701
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0671(М16)               ,М16 := L0671
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     WRIKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПВ     ENDKOR(М15)              ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *NUST*                   ,мод.адрес +1: *NUST*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     9(М7)                    ,СМ := 9(М7)
        ЗП     28(М7)                   ,28 := СМ
        СЧ     9(М7)                    ,СМ := 9(М7)
        МОДА   *FIN*                    ,мод.адрес +1: *FIN*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИА    L07232(М16)              ,М16 := L07232
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0724(М16)               ,М16 := L0724
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     SPAUD(М15)               ,вызов через М15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *EGO*+20630              ,мод.адрес +1: *EGO*+20630
        СЧ     SCHEMA                   ,СМ := SCHEMA
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     V14                      ,если СМ≠0 → V14
        ПБ     L0612                    ,переход на L0612
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     GOT4                     ,переход на GOT4
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4063'(М7)               ,СМ := '4063'(М7)
        МОД    L07122                   ,мод.адрес по коду: L07122
        УИА    SCHEMA(М1)               ,М1 := SCHEMA
        МОДА   СИМ74(М1)                ,мод.адрес +1: СИМ74(М1)
        ЗП     SCHEMA                   ,SCHEMA := СМ
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   21(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0614                    ,если СМ=0 → L0614
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *NUSTA*                  ,мод.адрес +1: *NUSTA*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SCHEMA(М7)               ,СМ := SCHEMA(М7)
        МОДА   *RUSIS*                  ,мод.адрес +1: *RUSIS*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *REGIM*+10               ,мод.адрес +1: *REGIM*+10
        ЗП     SCHEMA                   ,SCHEMA := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *BLO*                    ,мод.адрес +1: *BLO*
        СЧ     SCHEMA                   ,СМ := SCHEMA
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     BLO9                     ,если СМ≠0 → BLO9
        ПБ     L0635                    ,переход на L0635
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     V4                       ,переход на V4
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *FOP*                    ,мод.адрес +1: *FOP*
        ЗП     SCHEMA                   ,SCHEMA := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        СЧ     9(М7)                    ,СМ := 9(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     28(М7)                   ,СМ := 28(М7)
        НТЖ    SCHEMA(М17)              ,СМ ^= SCHEMA(М17)
        ПЕ     V42                      ,если СМ≠0 → V42
        ПБ     L0644                    ,переход на L0644
        ПБ     V12                      ,переход на V12
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        ПБ     V15                      ,переход на V15
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0661(М7)                ,М7 := L0661
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М2                       ,стек := М2, СМ := М2
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SCHEMA(М12)              ,переход через М12
        МОДА   SCHEMA                   ,мод.адрес +1: SCHEMA
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М2                       ,М2 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SCHEMA(М10)              ,переход через М10

