***************************************************
* SEGTAB - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 16384 образа SIPROD.BIN
*   Длина при загрузке: 401 слов, 728 команд
*   Вход: SEGTAB
*   Внешние: *STR*, *INS*, *TXT*, *TAB*, *LYG*, *LRE*, *ATV*, *SLY*, *EGO*, 
*   *DYD*, *LNT*, *SEK*, *INF*, *NRD*, *SCANER*, *NUST*, *RUSIS*, *NDAB*, 
*   *PAGE*, *REGIM*, KLAIDA, RASTXT, ANATXT, LYGPAR, NEWMAX, SEKDYD, 
*   SEKGIR, RWINF, SYTINT, GETSTR, SEKLYG, BEGPG, ENDPG, BEGSTR, ENDSTR, 
*   RSYMB, I*MU*I, I*DI*I
*   Смещения в *ATV*: 1
*   Смещения в *DYD*: 1, 2
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *INF*: 1, 2
*   Смещения в *INS*: 24, 25, 26
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1, 2, 3
*   Смещения в *NRD*: 24
*   Смещения в *NUST*: 8
*   Смещения в *PAGE*: 3, 4, 5
*   Смещения в *SCANER*: 1, 2
*   Смещения в *SEK*: 2, 3
*   Смещения в *SLY*: 1
*   Смещения в *STR*: 24, 25, 26
*   Смещения в *TAB*: 1, 2, 3, 4
*   Смещения в *TXT*: 1, 2, 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
SEGTAB  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     INF                      ,переход на INF
LNT     СЧ     3(М7)                    ,СМ := 3(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        ЗП     19(М7)                   ,19 := СМ
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
L0010   СЧ     SEGTAB                   ,СМ := SEGTAB
L0011   УИА    L0601(М16)               ,М16 := L0601
IMUI    ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ЗП     20(М7)                   ,20 := СМ
STR32   МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
STR31   СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
V3      СЛ     LNT(М7)                  ,СМ += LNT(М7)
        ЗП     21(М7)                   ,21 := СМ
        СЧ     20(М7)                   ,СМ := 20(М7)
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        СЛ     L0011(М7)                ,СМ += L0011(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     STR32                    ,если СМ=0 → STR32
        ПБ     STR31                    ,переход на STR31
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     V3                       ,переход на V3
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     11(М7)                   ,СМ := 11(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0037   РЖА    '22'                     ,РЖ := '22'
V11     ПБ     V14                      ,переход на V14
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
L0043   ЗП     23(М7)                   ,23 := СМ
        РЖА    '3'                      ,РЖ := '3'
        УИА    *NRD*(М16)               ,М16 := *NRD*
        СЧИМ   М16                      ,стек := М16, СМ := М16
RSYMB   УИА    L0602(М16)               ,М16 := L0602
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0605(М16)               ,М16 := L0605
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    STR314(М16)              ,М16 := STR314
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
STR312  СЧ     23(М7)                   ,СМ := 23(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        МОДА   *STR*+32                 ,мод.адрес +1: *STR*+32
        СЛ     SEGTAB                   ,СМ += SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0037                    ,если СМ=0 → L0037
        ПБ     V11                      ,переход на V11
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0043                    ,переход на L0043
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     12(М7)                   ,СМ := 12(М7)
L0101   ЗП     22(М7)                   ,22 := СМ
L0102   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
NUST10  ПБ     V14                      ,переход на V14
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0114   РЖА    '22'                     ,РЖ := '22'
V2      МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     '4111'(М7)               ,СМ := '4111'(М7)
L0606   МОД    L06062                   ,мод.адрес по коду: L06062
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   СИМ112(М1)               ,мод.адрес +1: СИМ112(М1)
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     '4111'(М7)               ,СМ := '4111'(М7)
        МОД    L06062                   ,мод.адрес по коду: L06062
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   СИМ113(М1)               ,мод.адрес +1: СИМ113(М1)
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     24(М7)                   ,СМ := 24(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        ЗП     24(М7)                   ,24 := СМ
        ВЧОБ   17(М7)                   ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     RSYMB                    ,если СМ=0 → RSYMB
L0137   СЧ     2(М7)                    ,СМ := 2(М7)
L0607   ЗП     25(М7)                   ,25 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L06072                   ,мод.адрес по коду: L06072
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
L0150   ЗП     SEGTAB                   ,SEGTAB := СМ
V1      МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
L0155   ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   8(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     STR312                   ,если СМ=0 → STR312
        СЧ     1(М7)                    ,СМ := 1(М7)
SLY1    МОДА   *SLY*+1                  ,мод.адрес +1: *SLY*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
STR313  ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
STR30   МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
ENDSTR  СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0101                    ,если СМ=0 → L0101
        ПБ     L0102                    ,переход на L0102
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     NUST10                   ,переход на NUST10
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     3(М7)                    ,СМ := 3(М7)
        РЖА    '3'                      ,РЖ := '3'
L0212   ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
IMUI2   УИА    *LNT*(М16)               ,М16 := *LNT*
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
NDAB    МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
PAGE3   ВЧ     SEGTAB                   ,СМ -= SEGTAB
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЛ     SEGTAB                   ,СМ += SEGTAB
ENDPG   МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     SEGTAB                   ,СМ += SEGTAB
        ВЧ     4(М7)                    ,СМ -= 4(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0114                    ,если СМ=0 → L0114
        ПБ     V2                       ,переход на V2
        ПБ     L0606                    ,переход на L0606
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     ENDPG(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     BEGPG(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
L0241   ЗП     SEGTAB                   ,SEGTAB := СМ
TAB3    РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
L0245   ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     26(М7)                   ,26 := СМ
INS32   МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
SCANER  СЧ     SEGTAB                   ,СМ := SEGTAB
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
ATV     ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     SEGTAB(М7)               ,СМ := SEGTAB(М7)
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ115                   ,мод.адрес +1: СИМ115
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SEGTAB                   ,СМ := SEGTAB
L0272   РЖА    '22'                     ,РЖ := '22'
L0273   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0137                    ,если СМ≠0 → L0137
        ПБ     L0607                    ,переход на L0607
        ПБ     SLY1                     ,переход на SLY1
V22     МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
NDAB1   МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        УИА    L0561(М16)               ,М16 := L0561
IDII    ПВ     I*DI*I(М15)              ,вызов через М15
        ЗП     27(М7)                   ,27 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
        СЧ     27(М7)                   ,СМ := 27(М7)
        УИА    L0561(М16)               ,М16 := L0561
        ПВ     I*MU*I(М15)              ,вызов через М15
L0314   РЖА    '22'                     ,РЖ := '22'
L0315   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0150                    ,если СМ≠0 → L0150
        ПБ     V1                       ,переход на V1
V27     ПБ     L0155                    ,переход на L0155
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
СИМ117  СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   СИМ117                   ,мод.адрес +1: СИМ117
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   СИМ120                   ,мод.адрес +1: СИМ120
        ЗП     SEGTAB                   ,SEGTAB := СМ
        ПБ     SLY1                     ,переход на SLY1
V23     МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
СИМ11A  СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ117                   ,мод.адрес +1: СИМ117
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
СИМ120  МОДА   СИМ120                   ,мод.адрес +1: СИМ120
SEK3    ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
SEK     МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     6(М7)                    ,СМ := 6(М7)
        МОДА   *SEK*                    ,мод.адрес +1: *SEK*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ120                   ,мод.адрес +1: СИМ120
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
SEKLYG  ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SEKLYG(М15)              ,вызов через М15
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SEGTAB                   ,СМ := SEGTAB
L0360   РЖА    '3'                      ,РЖ := '3'
INS322  МОДА   *INS*+32                 ,мод.адрес +1: *INS*+32
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     STR30                    ,если СМ≠0 → STR30
L0365   ПБ     ENDSTR                   ,переход на ENDSTR
GETSTR  ПБ     V7                       ,переход на V7
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИА    L0612(М16)               ,М16 := L0612
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     GETSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
INS31   РЖА    '22'                     ,РЖ := '22'
        МОДА   *INS*+31                 ,мод.адрес +1: *INS*+31
        СЧ     SEGTAB                   ,СМ := SEGTAB
SCANEA  МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
NRD     ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     26(М7)                   ,СМ := 26(М7)
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        ЗП     26(М7)                   ,26 := СМ
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        ЗП     29(М7)                   ,29 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     *NRD*(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     7(М7)                    ,СМ := 7(М7)
SCANEB  СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
V7      НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0212                    ,если СМ=0 → L0212
        ПБ     IMUI2                    ,переход на IMUI2
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
L0424   ПБ     ENDPG                    ,переход на ENDPG
V72     МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     NDAB                     ,если СМ≠0 → NDAB
V26     ПБ     PAGE3                    ,переход на PAGE3
        ПБ     SCANEB                   ,переход на SCANEB
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     13(М7)                   ,СМ := 13(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0441   РЖА    '22'                     ,РЖ := '22'
SCANEC  ПБ     V14                      ,переход на V14
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
L0445   СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        ЗП     30(М7)                   ,30 := СМ
        УИА    *INS*(М16)               ,М16 := *INS*
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0614(М16)               ,М16 := L0614
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0615(М16)               ,М16 := L0615
        СЧИМ   М16                      ,стек := М16, СМ := М16
SYTINT  РЖА    '22'                     ,РЖ := '22'
        ПВ     SYTINT(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     30(М7)                   ,СМ := 30(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
NRD2    ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     *NRD*(М15)               ,вызов через М15
        СЧ     10(М7)                   ,СМ := 10(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SCANER*+1               ,мод.адрес +1: *SCANER*+1
L0475   СЧ     SEGTAB                   ,СМ := SEGTAB
V10     НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0241                    ,если СМ≠0 → L0241
        ПБ     TAB3                     ,переход на TAB3
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
V102    ПБ     L0245                    ,переход на L0245
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     31(М7)                   ,СМ := 31(М7)
TXT     МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     ATV                      ,переход на ATV
L0512   СЧ     2(М7)                    ,СМ := 2(М7)
L0513   СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
V262    ПЕ     INS32                    ,если СМ≠0 → INS32
        ПБ     SCANER                   ,переход на SCANER
        ПБ     SCANEB                   ,переход на SCANEB
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     14(М7)                   ,СМ := 14(М7)
L0523   ЗП     22(М7)                   ,22 := СМ
L0524   РЖА    '3'                      ,РЖ := '3'
V14     РЖА    '22'                     ,РЖ := '22'
        ПБ     V14                      ,переход на V14
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
ATV2    МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        СЧ     SEGTAB                   ,СМ := SEGTAB
RWINF   МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
INF     МОДА   *INF*                    ,мод.адрес +1: *INF*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
INF2    МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *ATV*+1                  ,мод.адрес +1: *ATV*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
L0555   СЧ     2(М7)                    ,СМ := 2(М7)
L0556   СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
L0560   РЖА    '22'                     ,РЖ := '22'
L0561   НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0272                    ,если СМ=0 → L0272
STR314  ПБ     L0273                    ,переход на L0273
        ПБ     SEK                      ,переход на SEK
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     V22                      ,если СМ=0 → V22
        ПБ     NDAB1                    ,переход на NDAB1
        ПБ     СИМ11A                   ,переход на СИМ11A
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *STR*+31                 ,мод.адрес +1: *STR*+31
L0601   СЧ     SEGTAB                   ,СМ := SEGTAB
L0602   ЗП     32(М7)                   ,32 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0604   РЖА    '22'                     ,РЖ := '22'
L0605   ПБ     V27                      ,переход на V27
L06062  УИА    *STR*(М16)               ,М16 := *STR*
L06072  СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    RSYMB2(М16)              ,М16 := RSYMB2
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0612   УИА    L0555(М16)               ,М16 := L0555
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0614   УИА    STR314(М16)              ,М16 := STR314
L0615   СЧИМ   М16                      ,стек := М16, СМ := М16
RSYMB2  ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
ENDSTA  РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     18(М7)                   ,СМ := 18(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     '4123'(М7)               ,СМ := '4123'(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0314                    ,если СМ≠0 → L0314
        ПБ     L0315                    ,переход на L0315
        ПБ     СИМ117                   ,переход на СИМ117
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     32(М7)                   ,СМ := 32(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        ЗП     32(М7)                   ,32 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *STR*+30                 ,мод.адрес +1: *STR*+30
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        ПО     IDII                     ,если СМ=0 → IDII
        ПБ     СИМ11A                   ,переход на СИМ11A
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        ЗП     33(М7)                   ,33 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ENDSTR(М15)              ,вызов через М15
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        СЧИМ                            ,СЧИ + магазин
        СЧ     33(М7)                   ,СМ := 33(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     V23                      ,если СМ=0 → V23
        ПБ     СИМ11A                   ,переход на СИМ11A
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     BEGSTR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     СИМ120                   ,если СМ=0 → СИМ120
        ПБ     SEK3                     ,переход на SEK3
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKGIR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKDYD(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИА    L0560(М16)               ,М16 := L0560
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     NEWMAX(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     LYGPAR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+4                  ,мод.адрес +1: *TAB*+4
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *ATV*+1                  ,мод.адрес +1: *ATV*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     SEKLYG                   ,если СМ≠0 → SEKLYG
        ПБ     INS322                   ,переход на INS322
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЛ     SEGTAB                   ,СМ += SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0360                    ,если СМ≠0 → L0360
        ПБ     INS322                   ,переход на INS322
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     INS31                    ,переход на INS31
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0365                    ,если СМ=0 → L0365
        ПБ     GETSTR                   ,переход на GETSTR
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKGIR(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     SEKLYG(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *DYD*+1                  ,мод.адрес +1: *DYD*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V7                       ,переход на V7
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     26(М7)                   ,СМ := 26(М7)
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     SCANEA                   ,если СМ=0 → SCANEA
        ПБ     NRD                      ,переход на NRD
        ПБ     V7                       ,переход на V7
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЛ     SEGTAB                   ,СМ += SEGTAB
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        МОДА   *NDAB*+1                 ,мод.адрес +1: *NDAB*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V7                       ,переход на V7
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     29(М7)                   ,СМ := 29(М7)
        МОДА   *SCANER*                 ,мод.адрес +1: *SCANER*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПО     L0424                    ,если СМ=0 → L0424
        ПБ     V72                      ,переход на V72
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     NRD2                     ,переход на NRD2
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        СЛ     L0001(М7)                ,СМ += L0001(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     V26                      ,если СМ≠0 → V26
        ПБ     SCANEC                   ,переход на SCANEC
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        СЛ     SEGTAB                   ,СМ += SEGTAB
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0441                    ,если СМ=0 → L0441
        ПБ     SCANEC                   ,переход на SCANEC
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     L0445                    ,переход на L0445
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     16(М7)                   ,СМ := 16(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V14                      ,переход на V14
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     3(М7)                    ,СМ := 3(М7)
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        ВЧ     SEGTAB                   ,СМ -= SEGTAB
        ЗП     19(М7)                   ,19 := СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        УИА    L0601(М16)               ,М16 := L0601
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЛ     SEGTAB                   ,СМ += SEGTAB
        МОДА   *TAB*+2                  ,мод.адрес +1: *TAB*+2
        ЗП     SEGTAB                   ,SEGTAB := СМ
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        МОДА   *TAB*+1                  ,мод.адрес +1: *TAB*+1
        ЗП     SEGTAB                   ,SEGTAB := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     25(М7)                   ,25 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОД    L06072                   ,мод.адрес по коду: L06072
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     25(М7)                   ,СМ := 25(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        ЗП     25(М7)                   ,25 := СМ
        ВЧОБ   8(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     SYTINT                   ,если СМ=0 → SYTINT
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ANATXT(М15)              ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0475                    ,если СМ≠0 → L0475
        ПБ     V10                      ,переход на V10
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     TXT                      ,переход на TXT
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     V102                     ,если СМ≠0 → V102
        ПБ     TXT                      ,переход на TXT
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *TAB*+3                  ,мод.адрес +1: *TAB*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEGTAB                   ,СМ := SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEGTAB                   ,СМ := (адрес) - СМ
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        СЛ     SEGTAB                   ,СМ += SEGTAB
        РЖА    '22'                     ,РЖ := '22'
        ПО     L0512                    ,если СМ=0 → L0512
        ПБ     L0513                    ,переход на L0513
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     V262                     ,переход на V262
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     15(М7)                   ,СМ := 15(М7)
        ЗП     22(М7)                   ,22 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V14                      ,переход на V14
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПВ     RASTXT(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     6(М7)                    ,СМ := 6(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        СЧ     SEGTAB                   ,СМ := SEGTAB
        НТЖ    SEGTAB(М17)              ,СМ ^= SEGTAB(М17)
        ПЕ     L0523                    ,если СМ≠0 → L0523
        ПБ     L0524                    ,переход на L0524
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     STR313                   ,переход на STR313
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        ПБ     ATV2                     ,переход на ATV2
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИА    L0604(М16)               ,М16 := L0604
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        ЗП     34(М7)                   ,34 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     '4111'(М7)               ,СМ := '4111'(М7)
        МОД    ENDSTA                   ,мод.адрес по коду: ENDSTA
        УИА    SEGTAB(М1)               ,М1 := SEGTAB
        МОДА   *STR*+77777(М1)          ,мод.адрес +1: *STR*+77777(
        ЗП     SEGTAB                   ,SEGTAB := СМ
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        СЧ     34(М7)                   ,СМ := 34(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LNT(М7)                  ,СМ += LNT(М7)
        ЗП     34(М7)                   ,34 := СМ
        ВЧОБ   9(М7)                    ,СМ := (адрес) - СМ
        РЖА    '22'                     ,РЖ := '22'
        ПО     RWINF                    ,если СМ=0 → RWINF
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *TXT*+3                  ,мод.адрес +1: *TXT*+3
        ЗП     SEGTAB                   ,SEGTAB := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     INF2                     ,переход на INF2
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0556(М7)                ,М7 := L0556
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SEGTAB(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SEGTAB(М10)              ,переход через М10
        МОДА   SEGTAB                   ,мод.адрес +1: SEGTAB

