***************************************************
* SEGTAB - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 16384 образа SIPROD.BIN
*   Длина при загрузке: 401 слов, 728 команд
*   Вход: SEGTAB
*   Выход: SPAUD:STR25A, V26A (возврат через М12), 
*   V26A (возврат через М10)
*   СЕГМЕНТЫ ТАБЛИЦЫ (ЯЧЕЙКИ, ЛИНЕЙКИ).
*   Внешние: STR, INS, TXT, TAB, LYG, LRE, ATV, SLY, EGO, DYD, LNT, SEK, 
*   INF, NRD, SCANER, NUST, RUSIS, NDAB, PAGE, REGIM, KLAIDA, RASTXT, 
*   ANATXT, LYGPAR, NEWMAX, SEKDYD, SEKGIR, RWINF, SYTINT, GETSTR, SEKLYG, 
*   BEGPG, ENDPG, BEGSTR, ENDSTR, RSYMB, IMUI, IDII
*   Смещения в ATV: 1
*   Смещения в DYD: 1, 2
*   Смещения в EGO: 2400, 4800, 7200
*   Смещения в INF: 1, 2
*   Смещения в INS: 24, 25, 26
*   Смещения в LYG: 1, 2
*   Смещения в NDAB: 1, 2, 3
*   Смещения в NRD: 24
*   Смещения в NUST: 8
*   Смещения в PAGE: 3, 4, 5
*   Смещения в SCANER: 1, 2
*   Смещения в SEK: 2, 3
*   Смещения в SLY: 1
*   Смещения в STR: 24, 25, 26
*   Смещения в TAB: 1, 2, 3, 4
*   Смещения в TXT: 1, 2, 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 STR
*   002 STR24
*   003 STR25
*   004 STR26
*   005 INS
*   006 INS24
*   007 INS25
*   008 INS26
*   009 TXT
*   010 TXT1
*   011 TXT2
*   012 TXT3
*   013 TAB
*   014 TAB1
*   015 TAB2
*   016 TAB3
*   017 TAB4
*   018 LYG
*   019 LYG1
*   020 LYG2
*   021 LRE
*   022 ATV
*   023 ATV1
*   024 SLY
*   025 SLY1
*   026 EGO
*   027 EGO2400
*   028 EGO4800
*   029 EGO7200
*   030 DYD
*   031 DYD1
*   032 DYD2
*   033 LNT
*   034 SEK
*   035 INF
*   036 INF1
*   037 INF2
*   038 NRD
*   039 NRD24
*   040 SCANER
*   041 SCANER1
*   042 SCANER2
*   043 NUST
*   044 RUSIS
*   045 NDAB
*   046 NDAB1
*   047 NDAB2
*   048 NDAB3
*   049 PAGE
*   050 PAGE3
*   051 PAGE4
*   052 PAGE5
*   053 REGIM
*   054 KLAIDA
*   055 RASTXT
*   056 ANATXT
*   057 LYGPAR
*   058 NEWMAX
*   059 SEKDYD
*   060 SEKGIR
*   061 RWINF
*   062 SYTINT
*   063 NRDA
*   064 GETSTR
*   065 SEKLYG
*   066 BEGPG
*   067 ENDPG
*   068 BEGSTR
*   069 ENDSTR
*   070 RSYMB
*   071 IMUI
*   072 NUST8
*   074 EGO35167
*   075 EGO37567
*   076 LRE32767
*   077 LYG3
*   078 IDII
*   079 LYG4
*   080 LYG5
*   081 SEK3
*   082 SEK2
*   084 STR32767
*
*** КОД МОДУЛЯ
*
SEGTAB   СТАРТ  0
         УИА    LNTA(М16)               ,М16 := LNTA
LNTA     ПБ     INFA                    ,переход на INFA
*
         СЧ     3(М7)                   ,СМ := 3(М7)
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LNT                     ,мод.адрес +1: LNT
         ВЧ     0                       ,СМ -= 0
         ЗП     19(М7)                  ,19 := СМ
         МОДА   NRD24                   ,мод.адрес +1: NRD24
         СЧ     0                       ,СМ := 0
         УИА    STR25B(М16)             ,М16 := STR25B
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ЗП     20(М7)                  ,20 := СМ
STR26A   МОДА   STR26                   ,мод.адрес +1: STR26
STR26B   СЧ     0                       ,СМ := 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         ВЧ     0                       ,СМ -= 0
STR26C   СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     21(М7)                  ,21 := СМ
         СЧ     20(М7)                  ,СМ := 20(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     9(М7)                   ,СМ += 9(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     STR26A                  ,если СМ=0 → STR26A
         ПБ     STR26B                  ,переход на STR26B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     STR26C                  ,переход на STR26C
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     11(М7)                  ,СМ := 11(М7)
         ЗП     22(М7)                  ,22 := СМ
         РЖА    '3'                     ,РЖ := '3'
V11      РЖА    '22'                    ,РЖ := '22'
V11A     ПБ     V14B                    ,переход на V14B
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
V1       ЗП     23(М7)                  ,23 := СМ
         РЖА    '3'                     ,РЖ := '3'
         УИА    NRD(М16)                ,М16 := NRD
         СЧИМ   М16                     ,стек := М16, СМ := М16
V1A      УИА    STR25C(М16)             ,М16 := STR25C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25E(М16)             ,М16 := STR25E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    INFG(М16)               ,М16 := INFG
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
STR25A   СЧ     23(М7)                  ,СМ := 23(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   STR25                   ,мод.адрес +1: STR25
         ВЧ     0                       ,СМ -= 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПО     V11                     ,если СМ=0 → V11
         ПБ     V11A                    ,переход на V11A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V1                      ,переход на V1
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     12(М7)                  ,СМ := 12(М7)
V12      ЗП     22(М7)                  ,22 := СМ
V12A     РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
NUST8A   ПБ     V14B                    ,переход на V14B
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         ЗП     24(М7)                  ,24 := СМ
         РЖА    '3'                     ,РЖ := '3'
NUST8B   РЖА    '22'                    ,РЖ := '22'
NUST8C   МОДА   0                       ,мод.адрес +1: 0
         СЧ     '4111'(М7)              ,СМ := '4111'(М7)
NUST8D   МОД    ADDR                    ,мод.адрес по коду: ADDR
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO35167(М1)            ,мод.адрес +1: EGO35167(М1)
         ЗП     0                       ,0 := СМ
         СЧ     '4111'(М7)              ,СМ := '4111'(М7)
         МОД    ADDR                    ,мод.адрес по коду: ADDR
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO37567(М1)            ,мод.адрес +1: EGO37567(М1)
         ЗП     0                       ,0 := СМ
         СЧ     24(М7)                  ,СМ := 24(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     24(М7)                  ,24 := СМ
         ВЧОБ   17(М7)                  ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     V1A                     ,если СМ=0 → V1A
NUST8E   СЧ     2(М7)                   ,СМ := 2(М7)
NUST8F   ЗП     25(М7)                  ,25 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОД    PUSH                    ,мод.адрес по коду: PUSH
         УИА    0(М1)                   ,М1 := 0
         МОДА   LRE32767(М1)            ,мод.адрес +1: LRE32767(М1)
NUST8G   ЗП     0                       ,0 := СМ
NUST8H   МОДА   0                       ,мод.адрес +1: 0
         СЧ     25(М7)                  ,СМ := 25(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
NUST8I   ЗП     25(М7)                  ,25 := СМ
         ВЧОБ   8(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     STR25A                  ,если СМ=0 → STR25A
         СЧ     1(М7)                   ,СМ := 1(М7)
NUST8J   МОДА   SLY1                    ,мод.адрес +1: SLY1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TAB                     ,мод.адрес +1: TAB
NUST8K   ЗП     0                       ,0 := СМ
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
NUST8L   МОДА   STR24                   ,мод.адрес +1: STR24
NUST8M   СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V12                     ,если СМ=0 → V12
         ПБ     V12A                    ,переход на V12A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8A                  ,переход на NUST8A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     ENDSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
         РЖА    '3'                     ,РЖ := '3'
V3       ВЧОБ   0                       ,СМ := (адрес) - СМ
V3A      УИА    LNT(М16)                ,М16 := LNT
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
NDABA    МОДА   NDAB                    ,мод.адрес +1: NDAB
NDABB    ВЧ     0                       ,СМ -= 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЛ     0                       ,СМ += 0
NDABC    МОДА   PAGE4                   ,мод.адрес +1: PAGE4
         СЛ     0                       ,СМ += 0
         ВЧ     4(М7)                   ,СМ -= 4(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     NUST8B                  ,если СМ=0 → NUST8B
         ПБ     NUST8C                  ,переход на NUST8C
*
         ПБ     NUST8D                  ,переход на NUST8D
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     ENDPG(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGPG(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         МОДА   LYG1                    ,мод.адрес +1: LYG1
NDABD    ЗП     0                       ,0 := СМ
NDABE    РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TAB3                    ,мод.адрес +1: TAB3
NDABF    ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     26(М7)                  ,26 := СМ
NDABG    МОДА   INS26                   ,мод.адрес +1: INS26
NDABH    СЧ     0                       ,СМ := 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   SCANER                  ,мод.адрес +1: SCANER
NDABI    ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   ATV                     ,мод.адрес +1: ATV
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
NDABJ    РЖА    '22'                    ,РЖ := '22'
NDABK    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NUST8E                  ,если СМ≠0 → NUST8E
         ПБ     NUST8F                  ,переход на NUST8F
*
         ПБ     NUST8J                  ,переход на NUST8J
*
NDAB1A   МОДА   0                       ,мод.адрес +1: 0
NDAB1B   МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         УИА    INFF(М16)               ,М16 := INFF
IDIIA    ПВ     IDII(М15)               ,вызов через М15
         ЗП     27(М7)                  ,27 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         СЧ     27(М7)                  ,СМ := 27(М7)
         УИА    INFF(М16)               ,М16 := INFF
         ПВ     IMUI(М15)               ,вызов через М15
WAIT     РЖА    '22'                    ,РЖ := '22'
XOR      НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NUST8G                  ,если СМ≠0 → NUST8G
         ПБ     NUST8H                  ,переход на NUST8H
*
LYG4A    ПБ     NUST8I                  ,переход на NUST8I
*
         МОДА   0                       ,мод.адрес +1: 0
LYG4B    СЧ     2(М7)                   ,СМ := 2(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         ЗП     0                       ,0 := СМ
         ПБ     NUST8J                  ,переход на NUST8J
*
LYG4C    МОДА   0                       ,мод.адрес +1: 0
LYG4D    СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
LYG4E    МОДА   LYG5                    ,мод.адрес +1: LYG5
LYG4F    ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         ЗП     0                       ,0 := СМ
LYG4G    МОДА   0                       ,мод.адрес +1: 0
         СЧ     6(М7)                   ,СМ := 6(М7)
         МОДА   SEK                     ,мод.адрес +1: SEK
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         СЧ     0                       ,СМ := 0
         МОДА   SEK2                    ,мод.адрес +1: SEK2
LYG4H    ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     SEKLYG(М15)             ,вызов через М15
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         СЧ     0                       ,СМ := 0
SCANEA   РЖА    '3'                     ,РЖ := '3'
SCANEB   МОДА   INS26                   ,мод.адрес +1: INS26
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     NUST8L                  ,если СМ≠0 → NUST8L
SCANEC   ПБ     NUST8M                  ,переход на NUST8M
*
V6       ПБ     SCANEE                  ,переход на SCANEE
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    ADDRA(М16)              ,М16 := ADDRA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     GETSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
INS25A   РЖА    '22'                    ,РЖ := '22'
         МОДА   INS25                   ,мод.адрес +1: INS25
         СЧ     0                       ,СМ := 0
INS25B   МОДА   SCANER                  ,мод.адрес +1: SCANER
INS25C   ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     26(М7)                  ,СМ := 26(М7)
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     26(М7)                  ,26 := СМ
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         СЧ     0                       ,СМ := 0
         ЗП     29(М7)                  ,29 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     NRDA(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
SCANED   СЧИМ                           ,СЧИ + магазин
         МОДА   SCANER1                 ,мод.адрес +1: SCANER1
         СЧ     0                       ,СМ := 0
SCANEE   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V3                      ,если СМ=0 → V3
         ПБ     V3A                     ,переход на V3A
*
         МОДА   0                       ,мод.адрес +1: 0
V7       ПБ     NDABC                   ,переход на NDABC
*
V7A      МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     26(М7)                  ,СМ := 26(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NDABA                   ,если СМ≠0 → NDABA
V26      ПБ     NDABB                   ,переход на NDABB
*
         ПБ     SCANED                  ,переход на SCANED
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     13(М7)                  ,СМ := 13(М7)
         ЗП     22(М7)                  ,22 := СМ
         РЖА    '3'                     ,РЖ := '3'
V13      РЖА    '22'                    ,РЖ := '22'
SCANEF   ПБ     V14B                    ,переход на V14B
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SCANER                  ,мод.адрес +1: SCANER
SCANEG   СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         ЗП     30(М7)                  ,30 := СМ
         УИА    INS(М16)                ,М16 := INS
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    ADDRB(М16)              ,М16 := ADDRB
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    PUSHA(М16)              ,М16 := PUSHA
         СЧИМ   М16                     ,стек := М16, СМ := М16
SCANEH   РЖА    '22'                    ,РЖ := '22'
         ПВ     SYTINT(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     30(М7)                  ,СМ := 30(М7)
         МОДА   SCANER                  ,мод.адрес +1: SCANER
SCANEI   ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     NRDA(М15)               ,вызов через М15
         СЧ     10(М7)                  ,СМ := 10(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SCANER1                 ,мод.адрес +1: SCANER1
SCANEJ   СЧ     0                       ,СМ := 0
SCANEK   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NDABD                   ,если СМ≠0 → NDABD
         ПБ     NDABE                   ,переход на NDABE
*
         МОДА   0                       ,мод.адрес +1: 0
TXTA     ПБ     NDABF                   ,переход на NDABF
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     31(М7)                  ,СМ := 31(М7)
TXTB     МОДА   TXT                     ,мод.адрес +1: TXT
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     NDABI                   ,переход на NDABI
*
V2       СЧ     2(М7)                   ,СМ := 2(М7)
V2A      СЧИМ                           ,СЧИ + магазин
         СЧ     26(М7)                  ,СМ := 26(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
V2B      ПЕ     NDABG                   ,если СМ≠0 → NDABG
         ПБ     NDABH                   ,переход на NDABH
*
         ПБ     SCANED                  ,переход на SCANED
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     14(М7)                  ,СМ := 14(М7)
V14      ЗП     22(М7)                  ,22 := СМ
V14A     РЖА    '3'                     ,РЖ := '3'
V14B     РЖА    '22'                    ,РЖ := '22'
         ПБ     V14B                    ,переход на V14B
*
         МОДА   0                       ,мод.адрес +1: 0
ATVA     МОДА   ATV                     ,мод.адрес +1: ATV
         СЧ     0                       ,СМ := 0
ATVB     МОДА   INF                     ,мод.адрес +1: INF
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   TXT                     ,мод.адрес +1: TXT
         СЧ     0                       ,СМ := 0
         МОДА   INF1                    ,мод.адрес +1: INF1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RWINF(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
INFA     МОДА   INF                     ,мод.адрес +1: INF
         СЧ     0                       ,СМ := 0
         МОДА   ATV                     ,мод.адрес +1: ATV
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
INFB     МОДА   INF2                    ,мод.адрес +1: INF2
         СЧ     0                       ,СМ := 0
         МОДА   ATV1                    ,мод.адрес +1: ATV1
         ЗП     0                       ,0 := СМ
INFC     СЧ     2(М7)                   ,СМ := 2(М7)
INFD     СЧИМ                           ,СЧИ + магазин
         СЧ     26(М7)                  ,СМ := 26(М7)
INFE     РЖА    '22'                    ,РЖ := '22'
INFF     НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NDABJ                   ,если СМ=0 → NDABJ
INFG     ПБ     NDABK                   ,переход на NDABK
*
         ПБ     LYG4G                   ,переход на LYG4G
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         МОДА   STR24                   ,мод.адрес +1: STR24
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NDAB1A                  ,если СМ=0 → NDAB1A
         ПБ     NDAB1B                  ,переход на NDAB1B
*
         ПБ     LYG4D                   ,переход на LYG4D
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR25                   ,мод.адрес +1: STR25
STR25B   СЧ     0                       ,СМ := 0
STR25C   ЗП     32(М7)                  ,32 := СМ
         РЖА    '3'                     ,РЖ := '3'
STR25D   РЖА    '22'                    ,РЖ := '22'
STR25E   ПБ     LYG4A                   ,переход на LYG4A
*
ADDR     УИА    STR(М16)                ,М16 := STR
PUSH     СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    RSYMBA(М16)             ,М16 := RSYMBA
         СЧИМ   М16                     ,стек := М16, СМ := М16
ADDRA    УИА    INFC(М16)               ,М16 := INFC
         СЧИМ   М16                     ,стек := М16, СМ := М16
ADDRB    УИА    INFG(М16)               ,М16 := INFG
PUSHA    СЧИМ   М16                     ,стек := М16, СМ := М16
RSYMBA   ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
V26A     РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     18(М7)                  ,СМ := 18(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     '4123'(М7)              ,СМ := '4123'(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     WAIT                    ,если СМ≠0 → WAIT
         ПБ     XOR                     ,переход на XOR
*
         ПБ     LYG4B                   ,переход на LYG4B
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     32(М7)                  ,СМ := 32(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     32(М7)                  ,32 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR24                   ,мод.адрес +1: STR24
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ПО     IDIIA                   ,если СМ=0 → IDIIA
         ПБ     LYG4D                   ,переход на LYG4D
*
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         ЗП     33(М7)                  ,33 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDSTR(М15)             ,вызов через М15
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         СЧ     33(М7)                  ,СМ := 33(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LYG4C                   ,если СМ=0 → LYG4C
         ПБ     LYG4D                   ,переход на LYG4D
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     BEGSTR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LNT                     ,мод.адрес +1: LNT
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LYG4E                   ,если СМ=0 → LYG4E
         ПБ     LYG4F                   ,переход на LYG4F
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     SEKGIR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     SEKDYD(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         УИА    INFE(М16)               ,М16 := INFE
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     NEWMAX(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     LYGPAR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TAB3                    ,мод.адрес +1: TAB3
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TAB4                    ,мод.адрес +1: TAB4
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   ATV1                    ,мод.адрес +1: ATV1
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     LYG4H                   ,если СМ≠0 → LYG4H
         ПБ     SCANEB                  ,переход на SCANEB
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TXT                     ,мод.адрес +1: TXT
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     SCANEA                  ,если СМ≠0 → SCANEA
         ПБ     SCANEB                  ,переход на SCANEB
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     INS25A                  ,переход на INS25A
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LNT                     ,мод.адрес +1: LNT
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SCANEC                  ,если СМ=0 → SCANEC
         ПБ     V6                      ,переход на V6
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     SEKGIR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     SEKLYG(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   DYD1                    ,мод.адрес +1: DYD1
         СЧ     0                       ,СМ := 0
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   DYD2                    ,мод.адрес +1: DYD2
         СЧ     0                       ,СМ := 0
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     SCANEE                  ,переход на SCANEE
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     26(М7)                  ,СМ := 26(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     INS25B                  ,если СМ=0 → INS25B
         ПБ     INS25C                  ,переход на INS25C
*
         ПБ     SCANEE                  ,переход на SCANEE
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG                     ,мод.адрес +1: LYG
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LNT                     ,мод.адрес +1: LNT
         СЛ     0                       ,СМ += 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         СЧ     0                       ,СМ := 0
         МОДА   DYD                     ,мод.адрес +1: DYD
         ВЧ     0                       ,СМ -= 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   NDAB1                   ,мод.адрес +1: NDAB1
         ЗП     0                       ,0 := СМ
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЧ     0                       ,СМ := 0
         МОДА   DYD                     ,мод.адрес +1: DYD
         ВЧ     0                       ,СМ -= 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     SCANEE                  ,переход на SCANEE
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     29(М7)                  ,СМ := 29(М7)
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TAB3                    ,мод.адрес +1: TAB3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V7                      ,если СМ=0 → V7
         ПБ     V7A                     ,переход на V7A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SCANEI                  ,переход на SCANEI
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TXT                     ,мод.адрес +1: TXT
         СЧ     0                       ,СМ := 0
         МОДА   TAB                     ,мод.адрес +1: TAB
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЧ     0                       ,СМ := 0
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     1(М7)                   ,СМ += 1(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     V26                     ,если СМ≠0 → V26
         ПБ     SCANEF                  ,переход на SCANEF
*
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   NRD24                   ,мод.адрес +1: NRD24
         СЛ     0                       ,СМ += 0
         МОДА   LNT                     ,мод.адрес +1: LNT
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
         ПО     V13                     ,если СМ=0 → V13
         ПБ     SCANEF                  ,переход на SCANEF
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SCANEG                  ,переход на SCANEG
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     16(М7)                  ,СМ := 16(М7)
         ЗП     22(М7)                  ,22 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V14B                    ,переход на V14B
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LNT                     ,мод.адрес +1: LNT
         ВЧ     0                       ,СМ -= 0
         ЗП     19(М7)                  ,19 := СМ
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЧ     0                       ,СМ := 0
         УИА    STR25B(М16)             ,М16 := STR25B
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LNT                     ,мод.адрес +1: LNT
         СЛ     0                       ,СМ += 0
         МОДА   TAB2                    ,мод.адрес +1: TAB2
         ЗП     0                       ,0 := СМ
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         МОДА   TAB1                    ,мод.адрес +1: TAB1
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         ЗП     25(М7)                  ,25 := СМ
         РЖА    '22'                    ,РЖ := '22'
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОД    PUSH                    ,мод.адрес по коду: PUSH
         УИА    0(М1)                   ,М1 := 0
         МОДА   LRE32767(М1)            ,мод.адрес +1: LRE32767(М1)
         ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     25(М7)                  ,СМ := 25(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     25(М7)                  ,25 := СМ
         ВЧОБ   8(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     SCANEH                  ,если СМ=0 → SCANEH
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TAB3                    ,мод.адрес +1: TAB3
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ANATXT(М15)             ,вызов через М15
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT                     ,мод.адрес +1: TXT
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SCANEJ                  ,если СМ≠0 → SCANEJ
         ПБ     SCANEK                  ,переход на SCANEK
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TXTB                    ,переход на TXTB
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     TXTA                    ,если СМ≠0 → TXTA
         ПБ     TXTB                    ,переход на TXTB
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         МОДА   TAB3                    ,мод.адрес +1: TAB3
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   NRD24                   ,мод.адрес +1: NRD24
         СЛ     0                       ,СМ += 0
         РЖА    '22'                    ,РЖ := '22'
         ПО     V2                      ,если СМ=0 → V2
         ПБ     V2A                     ,переход на V2A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V2B                     ,переход на V2B
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     15(М7)                  ,СМ := 15(М7)
         ЗП     22(М7)                  ,22 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V14B                    ,переход на V14B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     RASTXT(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     6(М7)                   ,СМ := 6(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     V14                     ,если СМ≠0 → V14
         ПБ     V14A                    ,переход на V14A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8K                  ,переход на NUST8K
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     ATVA                    ,переход на ATVA
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    STR25D(М16)             ,М16 := STR25D
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     KLAIDA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         ЗП     34(М7)                  ,34 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     '4111'(М7)              ,СМ := '4111'(М7)
         МОД    V26A                    ,мод.адрес по коду: V26A
         УИА    0(М1)                   ,М1 := 0
         МОДА   STR32767(М1)            ,мод.адрес +1: STR32767(М1)
         ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     34(М7)                  ,СМ := 34(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         ЗП     34(М7)                  ,34 := СМ
         ВЧОБ   9(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     ATVB                    ,если СМ=0 → ATVB
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     INFB                    ,переход на INFB
*
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    INFD(М7)                ,М7 := INFD
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*
         МОДА   0                       ,мод.адрес +1: 0

