***************************************************
* SEKGIR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 17664 образа SIPROD.BIN
*   Длина при загрузке: 394 слов, 734 команд
*   Вход: SEKGIR
*   РАЗБОР СЕГМЕНТА ГИРЛЯНДЫ (ПРОГОНА).
*   Внешние: SEK, LRE, TAB, REGIM, SUT, LYG, SLY, DYD, NRD, INF, ADR, SEP, 
*   PAGE, EGO, SEKDYD, RWINF, WRREM, KOKSON, ADRSEK, KOKSEK, IMUI
*   Смещения в ADR: 1, 2, 3
*   Смещения в DYD: 1, 2
*   Смещения в EGO: 2400, 4800, 7200
*   Смещения в INF: 1, 2
*   Смещения в LYG: 1, 2
*   Смещения в NRD: 24
*   Смещения в PAGE: 3, 4, 5
*   Смещения в SEK: 1, 2, 3
*   Смещения в SEP: 1, 2, 3, 4, 5
*   Смещения в SLY: 1
*   Смещения в SUT: 1
*   Смещения в TAB: 1
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 SEK
*   002 LRE
*   003 TAB
*   004 TAB1
*   005 REGIM
*   006 SUT
*   007 SUT1
*   008 LYG
*   009 LYG1
*   010 LYG2
*   011 SLY
*   012 SLY1
*   013 DYD
*   014 DYD1
*   015 DYD2
*   016 NRD
*   017 NRD24
*   018 INF
*   019 INF1
*   020 INF2
*   021 ADR
*   022 ADR1
*   023 ADR2
*   024 ADR3
*   025 SEP
*   026 SEP1
*   027 SEP2
*   028 SEP3
*   029 SEP4
*   030 SEP5
*   031 PAGE
*   032 PAGE3
*   033 PAGE4
*   034 PAGE5
*   035 EGO
*   036 EGO2400
*   037 EGO4800
*   038 EGO7200
*   039 SEKDYD
*   040 RWINF
*   041 WRREM
*   042 KOKSON
*   043 ADRSEK
*   044 KOKSEK
*   045 LYG4
*   046 IMUI
*   047 LYG3
*   048 LYG5
*   049 SEK1
*   050 LRE32767
*   051 SEK3
*   052 SEK2
*
SEKGIR   СТАРТ  0
         УИА    LYG2A(М16)              ,М16 := LYG2A
LYG2A    ПБ     INFD                    ,переход на INFD
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         СЧ     0                       ,СМ := 0
         ЗП     13(М7)                  ,13 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         ЗП     14(М7)                  ,14 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     15(М7)                  ,15 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   INF2                    ,мод.адрес +1: INF2
         ЗП     0                       ,0 := СМ
         МОДА   TAB                     ,мод.адрес +1: TAB
LYG2B    СЧ     0                       ,СМ := 0
         ЗП     16(М7)                  ,16 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
LYG2C    ЗП     17(М7)                  ,17 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     18(М7)                  ,18 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SLY                     ,мод.адрес +1: SLY
LYG2D    СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LYG2B                   ,если СМ=0 → LYG2B
LYG2E    ПБ     LYG2C                   ,переход на LYG2C
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         МОДА   TAB                     ,мод.адрес +1: TAB
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
TABA     РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
TABB     МОДА   PAGE4                   ,мод.адрес +1: PAGE4
         СЛ     0                       ,СМ += 0
         УИА    TABO(М16)               ,М16 := TABO
IMUIA    ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ВЧ     8(М7)                   ,СМ -= 8(М7)
         ЗП     19(М7)                  ,19 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     LYG2E                   ,переход на LYG2E
         МОДА   TAB                     ,мод.адрес +1: TAB
TABC     СЧ     0                       ,СМ := 0
TABD     РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   TAB                     ,мод.адрес +1: TAB
TABE     ЗП     0                       ,0 := СМ
TABF     РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     KOKSEK(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     ADRSEK(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SLY                     ,мод.адрес +1: SLY
         СЧ     0                       ,СМ := 0
SLYA     НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     TABA                    ,если СМ=0 → TABA
         ПБ     TABB                    ,переход на TABB
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     9(М7)                   ,СМ := 9(М7)
         УИА    LYG1(М16)               ,М16 := LYG1
         ПВ     IMUI(М15)               ,вызов через М15
ADR1A    МОДА   0                       ,мод.адрес +1: 0
ADR1B    РЖА    '3'                     ,РЖ := '3'
         ВЧ     8(М7)                   ,СМ -= 8(М7)
         МОДА   ADR1                    ,мод.адрес +1: ADR1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
ADR1C    МОДА   SEP                     ,мод.адрес +1: SEP
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
ADR1D    МОДА   0                       ,мод.адрес +1: 0
ADR1E    СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   INF2                    ,мод.адрес +1: INF2
         СЧ     0                       ,СМ := 0
ADR1F    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     TABC                    ,если СМ≠0 → TABC
         СЧ     5(М7)                   ,СМ := 5(М7)
         СЧИМ                           ,СЧИ + магазин
ADR1G    МОДА   SEP                     ,мод.адрес +1: SEP
ADR1H    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     TABC                    ,если СМ≠0 → TABC
         ПБ     TABD                    ,переход на TABD
V5       МОДА   0                       ,мод.адрес +1: 0
V5A      ПБ     SLYA                    ,переход на SLYA
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     18(М7)                  ,СМ := 18(М7)
V18      НТЖ    0(М17)                  ,СМ ^= 0(М17)
V18A     ПЕ     TABE                    ,если СМ≠0 → TABE
V18B     ПБ     TABF                    ,переход на TABF
         ПБ     SLYA                    ,переход на SLYA
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG2                    ,мод.адрес +1: LYG2
LYG2F    СЧ     0                       ,СМ := 0
         ЗП     20(М7)                  ,20 := СМ
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LYG4                    ,мод.адрес +1: LYG4
LYG2G    СЧ     0                       ,СМ := 0
LYG2H    ЗП     21(М7)                  ,21 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
         ЗП     17(М7)                  ,17 := СМ
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         СЧ     0                       ,СМ := 0
LYG2I    МОДА   LYG2                    ,мод.адрес +1: LYG2
LYG2J    ЗП     0                       ,0 := СМ
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         СЧ     0                       ,СМ := 0
LYG2K    МОДА   LYG4                    ,мод.адрес +1: LYG4
LYG2L    ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     SLYI                    ,переход на SLYI
         МОДА   0                       ,мод.адрес +1: 0
SEPA     МОДА   SEP                     ,мод.адрес +1: SEP
SEPB     СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   SEP                     ,мод.адрес +1: SEP
SEPC     ЗП     0                       ,0 := СМ
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
         ВЧОБ   0                       ,СМ := (адрес) - СМ
SEPD     СЛ     5(М7)                   ,СМ += 5(М7)
SEPE     РЖА    '22'                    ,РЖ := '22'
         ПЕ     ADR1A                   ,если СМ≠0 → ADR1A
         ПБ     ADR1B                   ,переход на ADR1B
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TABM                    ,переход на TABM
SEPF     МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
SEPG     СЛ     3(М7)                   ,СМ += 3(М7)
SEPH     ЗП     22(М7)                  ,22 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEK                     ,мод.адрес +1: SEK
SEPI     СЧ     0                       ,СМ := 0
SEPJ     РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     ADR1C                   ,если СМ≠0 → ADR1C
         ПБ     ADR1E                   ,переход на ADR1E
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
SEPK     МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     ADR1D                   ,если СМ=0 → ADR1D
SEPL     ПБ     ADR1E                   ,переход на ADR1E
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     IMUIA                   ,переход на IMUIA
         МОДА   0                       ,мод.адрес +1: 0
SEK1A    СЧ     2(М7)                   ,СМ := 2(М7)
SEK1B    СЧИМ                           ,СЧИ + магазин
         МОДА   SEK1                    ,мод.адрес +1: SEK1
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     ADR1F                   ,если СМ≠0 → ADR1F
         ПБ     ADR1H                   ,переход на ADR1H
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
SEPM     ПО     ADR1G                   ,если СМ=0 → ADR1G
SEPN     ПБ     ADR1H                   ,переход на ADR1H
V4       МОДА   0                       ,мод.адрес +1: 0
         ПБ     IMUIA                   ,переход на IMUIA
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
SLYB     СЧИМ                           ,СЧИ + магазин
         МОДА   SLY                     ,мод.адрес +1: SLY
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
SLYC     ПО     V5                      ,если СМ=0 → V5
         ПБ     V5A                     ,переход на V5A
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SEPJ                    ,переход на SEPJ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОД    INFE                    ,мод.адрес по коду: INFE
         УИА    0(М1)                   ,М1 := 0
         МОДА   LRE32767(М1)            ,мод.адрес +1: LRE32767(М1)
         СЧ     0                       ,СМ := 0
LRE327   НТЖ    0(М17)                  ,СМ ^= 0(М17)
LRE32A   ПО     V18                     ,если СМ=0 → V18
         ПБ     V18A                    ,переход на V18A
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     IMUIA                   ,переход на IMUIA
         МОДА   0                       ,мод.адрес +1: 0
SLYD     ПБ     SEPJ                    ,переход на SEPJ
SLYE     МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
SLYF     МОДА   SLY                     ,мод.адрес +1: SLY
SLYG     СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LYG2F                   ,если СМ=0 → LYG2F
         ПБ     LYG2H                   ,переход на LYG2H
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
INF2A    МОДА   INF2                    ,мод.адрес +1: INF2
         СЧ     0                       ,СМ := 0
INF2B    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LYG2G                   ,если СМ=0 → LYG2G
         ПБ     LYG2H                   ,переход на LYG2H
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     IMUIA                   ,переход на IMUIA
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     KOKSON(М15)             ,вызов через М15
SEPO     МОДА   0                       ,мод.адрес +1: 0
SEPP     СЧ     3(М7)                   ,СМ := 3(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     LYG2I                   ,если СМ≠0 → LYG2I
         ПБ     LYG2J                   ,переход на LYG2J
         МОДА   0                       ,мод.адрес +1: 0
V3       ПБ     SEPE                    ,переход на SEPE
V3A      МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     18(М7)                  ,СМ := 18(М7)
V18C     НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LYG2K                   ,если СМ=0 → LYG2K
         ПБ     LYG2L                   ,переход на LYG2L
         ПБ     TABM                    ,переход на TABM
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
SEK3A    МОДА   LYG2                    ,мод.адрес +1: LYG2
SEK3B    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SEPA                    ,если СМ≠0 → SEPA
         ПБ     SEPB                    ,переход на SEPB
         ПБ     TABM                    ,переход на TABM
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
REGIMA   СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SEPC                    ,если СМ=0 → SEPC
         ПБ     SEPE                    ,переход на SEPE
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEK2                    ,мод.адрес +1: SEK2
         СЧ     0                       ,СМ := 0
SEK2A    СЧИМ                           ,СЧИ + магазин
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
SEK2B    ПЕ     SEPD                    ,если СМ≠0 → SEPD
         ПБ     SEPE                    ,переход на SEPE
         ПБ     TABM                    ,переход на TABM
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     WRREM(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
SLYH     СЧИМ                           ,СЧИ + магазин
SLYI     МОДА   SLY                     ,мод.адрес +1: SLY
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SEPF                    ,если СМ=0 → SEPF
SLYJ     ПБ     SEPH                    ,переход на SEPH
SEPQ     МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
SEPR     РЖА    '3'                     ,РЖ := '3'
SEPS     ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     3(М7)                   ,СМ += 3(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     SEPG                    ,если СМ≠0 → SEPG
         ПБ     SEPH                    ,переход на SEPH
         ПБ     SLYE                    ,переход на SLYE
         МОДА   0                       ,мод.адрес +1: 0
V7       ПБ     TABM                    ,переход на TABM
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     15(М7)                  ,СМ := 15(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
V7A      ПО     SEPI                    ,если СМ=0 → SEPI
         ПБ     SEPJ                    ,переход на SEPJ
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SLYE                    ,переход на SLYE
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЧ     0                       ,СМ := 0
         МОДА   INF1                    ,мод.адрес +1: INF1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     3(М7)                   ,СМ := 3(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
TABG     РЖА    '22'                    ,РЖ := '22'
TABH     НТЖ    0(М17)                  ,СМ ^= 0(М17)
TABI     ПО     SEPK                    ,если СМ=0 → SEPK
         ПБ     SEPL                    ,переход на SEPL
         МОДА   0                       ,мод.адрес +1: 0
TABJ     МОДА   TAB                     ,мод.адрес +1: TAB
TABK     СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     10(М7)                  ,СМ += 10(М7)
         МОДА   INF1                    ,мод.адрес +1: INF1
         ЗП     0                       ,0 := СМ
TABL     РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEP                     ,мод.адрес +1: SEP
TABM     СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     3(М7)                   ,СМ += 3(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     SEK1A                   ,если СМ≠0 → SEK1A
         ПБ     SEK1B                   ,переход на SEK1B
         ПБ     V4                      ,переход на V4
SUTA     МОДА   0                       ,мод.адрес +1: 0
SUTB     МОДА   SUT                     ,мод.адрес +1: SUT
         СЧ     0                       ,СМ := 0
         ЗП     23(М7)                  ,23 := СМ
         РЖА    '3'                     ,РЖ := '3'
SUTC     МОДА   SUT                     ,мод.адрес +1: SUT
SUTD     СЧ     0                       ,СМ := 0
         МОДА   INF                     ,мод.адрес +1: INF
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RWINF(М15)              ,вызов через М15
INFA     МОДА   INF                     ,мод.адрес +1: INF
INFB     СЧ     0                       ,СМ := 0
         МОДА   SUT                     ,мод.адрес +1: SUT
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
INFC     СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SLY                     ,мод.адрес +1: SLY
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
INFD     ПЕ     SEPM                    ,если СМ≠0 → SEPM
         ПБ     SEPN                    ,переход на SEPN
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TABM                    ,переход на TABM
         МОДА   0                       ,мод.адрес +1: 0
V7B      ПБ     V18B                    ,переход на V18B
         ПБ     TABM                    ,переход на TABM
         СЧ     5(М7)                   ,СМ := 5(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEP                     ,мод.адрес +1: SEP
SEPT     СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SLYB                    ,если СМ=0 → SLYB
         ПБ     SLYC                    ,переход на SLYC
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TAB                     ,мод.адрес +1: TAB
TABN     СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     10(М7)                  ,СМ += 10(М7)
TABO     МОДА   INF1                    ,мод.адрес +1: INF1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SUT1                    ,мод.адрес +1: SUT1
         СЧ     0                       ,СМ := 0
         МОДА   INF                     ,мод.адрес +1: INF
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RWINF(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   INF                     ,мод.адрес +1: INF
INFE     СЧ     0                       ,СМ := 0
         МОДА   SUT1                    ,мод.адрес +1: SUT1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SLY                     ,мод.адрес +1: SLY
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LRE327                  ,если СМ=0 → LRE327
         ПБ     LRE32A                  ,переход на LRE32A
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V18B                    ,переход на V18B
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОД    INFE                    ,мод.адрес по коду: INFE
         УИА    0(М1)                   ,М1 := 0
         МОДА   LRE32767(М1)            ,мод.адрес +1: LRE32767(М1)
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SLYD                    ,если СМ≠0 → SLYD
         ПБ     SLYE                    ,переход на SLYE
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TABM                    ,переход на TABM
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     15(М7)                  ,СМ := 15(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SLYF                    ,если СМ=0 → SLYF
         ПБ     SLYG                    ,переход на SLYG
         ПБ     INF2B                   ,переход на INF2B
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         ЗП     15(М7)                  ,15 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     SEKDYD(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   DYD                     ,мод.адрес +1: DYD
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     2(М7)                   ,СМ += 2(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     INF2A                   ,если СМ≠0 → INF2A
         ПБ     INF2B                   ,переход на INF2B
         СЧ     7(М7)                   ,СМ := 7(М7)
         ЗП     18(М7)                  ,18 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   DYD                     ,мод.адрес +1: DYD
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     2(М7)                   ,СМ -= 2(М7)
         МОДА   DYD                     ,мод.адрес +1: DYD
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   DYD                     ,мод.адрес +1: DYD
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SEPO                    ,если СМ=0 → SEPO
         ПБ     SEPP                    ,переход на SEPP
         ПБ     SLYI                    ,переход на SLYI
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         УИА    TABO(М16)               ,М16 := TABO
         ПВ     IMUI(М15)               ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   SEP4                    ,мод.адрес +1: SEP4
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   REGIM                   ,мод.адрес +1: REGIM
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V3                      ,если СМ=0 → V3
         ПБ     V3A                     ,переход на V3A
         ПБ     V18C                    ,переход на V18C
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     SEK2A                   ,переход на SEK2A
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         СЧ     11(М7)                  ,СМ := 11(М7)
         ЗП     24(М7)                  ,24 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SEK3A                   ,если СМ≠0 → SEK3A
         ПБ     SEK3B                   ,переход на SEK3B
         ПБ     REGIMA                  ,переход на REGIMA
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         СЧ     11(М7)                  ,СМ := 11(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ЗП     24(М7)                  ,24 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEP1                    ,мод.адрес +1: SEP1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     24(М7)                  ,СМ += 24(М7)
         МОДА   SEP1                    ,мод.адрес +1: SEP1
         ЗП     0                       ,0 := СМ
         СЧ     19(М7)                  ,СМ := 19(М7)
         МОДА   SEP4                    ,мод.адрес +1: SEP4
         ВЧ     0                       ,СМ -= 0
         УИА    TABN(М16)               ,М16 := TABN
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEP1                    ,мод.адрес +1: SEP1
         СЛ     0                       ,СМ += 0
         МОДА   SEP2                    ,мод.адрес +1: SEP2
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   DYD                     ,мод.адрес +1: DYD
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SEK2B                   ,если СМ=0 → SEK2B
         ПБ     SLYH                    ,переход на SLYH
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   ADR1                    ,мод.адрес +1: ADR1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   SEP4                    ,мод.адрес +1: SEP4
         ВЧ     0                       ,СМ -= 0
         УИА    TABN(М16)               ,М16 := TABN
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SEP1                    ,мод.адрес +1: SEP1
         СЛ     0                       ,СМ += 0
         МОДА   SEP2                    ,мод.адрес +1: SEP2
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SEPE                    ,переход на SEPE
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     SLYJ                    ,если СМ=0 → SLYJ
         ПБ     SEPQ                    ,переход на SEPQ
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TABM                    ,переход на TABM
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     18(М7)                  ,СМ := 18(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SEPR                    ,если СМ≠0 → SEPR
         ПБ     SEPS                    ,переход на SEPS
         ПБ     TABM                    ,переход на TABM
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
         МОДА   SEP                     ,мод.адрес +1: SEP
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ADRSEK(М15)             ,вызов через М15
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SLY                     ,мод.адрес +1: SLY
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V7                      ,если СМ=0 → V7
         ПБ     V7A                     ,переход на V7A
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     9(М7)                   ,СМ := 9(М7)
         УИА    LYG1(М16)               ,М16 := LYG1
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     8(М7)                   ,СМ -= 8(М7)
         МОДА   ADR1                    ,мод.адрес +1: ADR1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     KOKSON(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     10(М7)                  ,СМ += 10(М7)
         МОДА   INF1                    ,мод.адрес +1: INF1
         ЗП     0                       ,0 := СМ
         СЧ     23(М7)                  ,СМ := 23(М7)
         МОДА   INF                     ,мод.адрес +1: INF
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RWINF(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   INF                     ,мод.адрес +1: INF
         СЧ     0                       ,СМ := 0
         МОДА   SUT                     ,мод.адрес +1: SUT
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   INF2                    ,мод.адрес +1: INF2
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     TABG                    ,если СМ=0 → TABG
         ПБ     TABH                    ,переход на TABH
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     TABI                    ,переход на TABI
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     WRREM(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     17(М7)                  ,СМ := 17(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     TABJ                    ,если СМ≠0 → TABJ
         ПБ     TABK                    ,переход на TABK
         ПБ     TABL                    ,переход на TABL
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     20(М7)                  ,СМ := 20(М7)
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     21(М7)                  ,СМ := 21(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     17(М7)                  ,17 := СМ
         РЖА    '22'                    ,РЖ := '22'
         СЧ     5(М7)                   ,СМ := 5(М7)
         МОДА   SEP                     ,мод.адрес +1: SEP
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     13(М7)                  ,СМ := 13(М7)
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     14(М7)                  ,СМ := 14(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     15(М7)                  ,15 := СМ
         МОДА   SEP                     ,мод.адрес +1: SEP
         СЧ     0                       ,СМ := 0
         ВЧ     5(М7)                   ,СМ -= 5(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     SUTA                    ,если СМ≠0 → SUTA
         ПБ     SUTB                    ,переход на SUTB
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     IMUIA                   ,переход на IMUIA
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     7(М7)                   ,СМ := 7(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SLY                     ,мод.адрес +1: SLY
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SUTC                    ,если СМ≠0 → SUTC
         ПБ     SUTD                    ,переход на SUTD
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     INFC                    ,переход на INFC
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   TAB                     ,мод.адрес +1: TAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   NRD24                   ,мод.адрес +1: NRD24
         ВЧ     0                       ,СМ -= 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     INFA                    ,если СМ≠0 → INFA
         ПБ     INFB                    ,переход на INFB
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     LYG2D                   ,переход на LYG2D
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   SUT1                    ,мод.адрес +1: SUT1
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   SUT                     ,мод.адрес +1: SUT
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         СЧ     16(М7)                  ,СМ := 16(М7)
         МОДА   TAB                     ,мод.адрес +1: TAB
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     13(М7)                  ,СМ := 13(М7)
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         СЧ     14(М7)                  ,СМ := 14(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V7B                     ,переход на V7B
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    SEPT(М7)                ,М7 := SEPT
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

