***************************************************
* SEKGIR - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 17664 образа SIPROD.BIN
*   Длина при загрузке: 394 слов, 734 команд
*   Вход: SEKGIR
*   Внешние: *SEK*, *LRE*, *TAB*, *REGIM*, *SUT*, *LYG*, *SLY*, *DYD*, 
*   *NRD*, *INF*, *ADR*, *SEP*, *PAGE*, *EGO*, SEKDYD, RWINF, WRREM, 
*   KOKSON, ADRSEK, KOKSEK, I*MU*I
*   Смещения в *ADR*: 1, 2, 3
*   Смещения в *DYD*: 1, 2
*   Смещения в *EGO*: 2400, 4800, 7200
*   Смещения в *INF*: 1, 2
*   Смещения в *LYG*: 1, 2
*   Смещения в *NRD*: 24
*   Смещения в *PAGE*: 3, 4, 5
*   Смещения в *SEK*: 1, 2, 3
*   Смещения в *SEP*: 1, 2, 3, 4, 5
*   Смещения в *SLY*: 1
*   Смещения в *SUT*: 1
*   Смещения в *TAB*: 1
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
SEKGIR  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     V75                      ,переход на V75
LYG2    МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
L0003   СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     13(М7)                   ,13 := СМ
СИМ55   РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0010   ЗП     14(М7)                   ,14 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
INF2    ЗП     15(М7)                   ,15 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0017   СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     16(М7)                   ,16 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
SLY     ЗП     17(М7)                   ,17 := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     18(М7)                   ,18 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
L0030   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0017                    ,если СМ=0 → L0017
TAB     ПБ     SLY                      ,переход на SLY
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
PAGE3   РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
PAGE4   МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        СЛ     SEKGIR                   ,СМ += SEKGIR
        УИА    RWINF2(М16)              ,М16 := RWINF2
IMUI    ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ВЧ     8(М7)                    ,СМ -= 8(М7)
        ЗП     19(М7)                   ,19 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     TAB                      ,переход на TAB
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0061   СЧ     SEKGIR                   ,СМ := SEKGIR
TAB2    РЖА    '3'                      ,РЖ := '3'
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0065   ЗП     SEKGIR                   ,SEKGIR := СМ
KOKSEK  РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     KOKSEK(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     ADRSEK(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
IMUI2   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     PAGE3                    ,если СМ=0 → PAGE3
        ПБ     PAGE4                    ,переход на PAGE4
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     9(М7)                    ,СМ := 9(М7)
        УИА    *LYG*+1(М16)             ,М16 := *LYG*+1
        ПВ     I*MU*I(М15)              ,вызов через М15
V9      МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
ADR1    РЖА    '3'                      ,РЖ := '3'
        ВЧ     8(М7)                    ,СМ -= 8(М7)
        МОДА   *ADR*+1                  ,мод.адрес +1: *ADR*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
SEP     МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
V1      МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
INF22   СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0130   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0061                    ,если СМ≠0 → L0061
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
SEP2    МОДА   *SEP*                    ,мод.адрес +1: *SEP*
L0135   СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0061                    ,если СМ≠0 → L0061
        ПБ     TAB2                     ,переход на TAB2
V5      МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
V52     ПБ     IMUI2                    ,переход на IMUI2
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
L0147   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0150   ПЕ     L0065                    ,если СМ≠0 → L0065
LYG22   ПБ     KOKSEK                   ,переход на KOKSEK
        ПБ     IMUI2                    ,переход на IMUI2
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
СИМ552  СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     20(М7)                   ,20 := СМ
        РЖА    '3'                      ,РЖ := '3'
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
L0161   СЧ     SEKGIR                   ,СМ := SEKGIR
СИМ57   ЗП     21(М7)                   ,21 := СМ
        СЧ     7(М7)                    ,СМ := 7(М7)
        ЗП     17(М7)                   ,17 := СМ
        МОДА   СИМ57                    ,мод.адрес +1: СИМ57
        СЧ     SEKGIR                   ,СМ := SEKGIR
LYG23   МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
СИМ60   ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   СИМ60                    ,мод.адрес +1: СИМ60
        СЧ     SEKGIR                   ,СМ := SEKGIR
СИМ553  МОДА   СИМ55                    ,мод.адрес +1: СИМ55
V7      ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     SLY4                     ,переход на SLY4
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
SEP3    МОДА   *SEP*                    ,мод.адрес +1: *SEP*
SEP4    СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
SEP5    ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
L0211   СЛ     СИМ55(М7)                ,СМ += СИМ55(М7)
V72     РЖА    '22'                     ,РЖ := '22'
        ПЕ     V9                       ,если СМ≠0 → V9
        ПБ     ADR1                     ,переход на ADR1
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
SEP6    МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
L0223   СЛ     L0003(М7)                ,СМ += L0003(М7)
SEK     ЗП     22(М7)                   ,22 := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*                    ,мод.адрес +1: *SEK*
L0230   СЧ     SEKGIR                   ,СМ := SEKGIR
V2      РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     SEP                      ,если СМ≠0 → SEP
        ПБ     INF22                    ,переход на INF22
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
SEP7    МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     V1                       ,если СМ=0 → V1
V22     ПБ     INF22                    ,переход на INF22
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     IMUI                     ,переход на IMUI
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0250   СЧ     2(М7)                    ,СМ := 2(М7)
SEK1    СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+1                  ,мод.адрес +1: *SEK*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0130                    ,если СМ≠0 → L0130
        ПБ     L0135                    ,переход на L0135
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0265   ПО     SEP2                     ,если СМ=0 → SEP2
L0266   ПБ     L0135                    ,переход на L0135
V4      МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     IMUI                     ,переход на IMUI
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
SLY2    СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
L0607   ПО     V5                       ,если СМ=0 → V5
        ПБ     V52                      ,переход на V52
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     V2                       ,переход на V2
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    SEKDYD                   ,мод.адрес по коду: SEKDYD
        УИА    SEKGIR(М1)               ,М1 := SEKGIR
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0312   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
V12     ПО     L0147                    ,если СМ=0 → L0147
        ПБ     L0150                    ,переход на L0150
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     IMUI                     ,переход на IMUI
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0320   ПБ     V2                       ,переход на V2
V13     МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
SLY3    МОДА   *SLY*                    ,мод.адрес +1: *SLY*
V73     СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     СИМ552                   ,если СМ=0 → СИМ552
        ПБ     СИМ57                    ,переход на СИМ57
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
INF23   МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
KOKSON  НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0161                    ,если СМ=0 → L0161
        ПБ     СИМ57                    ,переход на СИМ57
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     IMUI                     ,переход на IMUI
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     KOKSON(М15)              ,вызов через М15
V23     МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
SEP8    СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     LYG23                    ,если СМ≠0 → LYG23
        ПБ     СИМ60                    ,переход на СИМ60
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0356   ПБ     V72                      ,переход на V72
V3      МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
SEK3    НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     СИМ553                   ,если СМ=0 → СИМ553
        ПБ     V7                       ,переход на V7
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     SEKGIR                   ,СМ := SEKGIR
        СЧИМ                            ,СЧИ + магазин
LYG24   МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
V18     СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     SEP3                     ,если СМ≠0 → SEP3
        ПБ     SEP4                     ,переход на SEP4
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
REGIM   СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     SEP5                     ,если СМ=0 → SEP5
        ПБ     V72                      ,переход на V72
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
СИМ554  СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
WRREM   ПЕ     L0211                    ,если СМ≠0 → L0211
        ПБ     V72                      ,переход на V72
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     WRREM(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
L0427   СЧИМ                            ,СЧИ + магазин
SLY4    МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     SEP6                     ,если СМ=0 → SEP6
L0434   ПБ     SEK                      ,переход на SEK
SEP9    МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0440   РЖА    '3'                      ,РЖ := '3'
V74     ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0223                    ,если СМ≠0 → L0223
        ПБ     SEK                      ,переход на SEK
        ПБ     V13                      ,переход на V13
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
L0450   ПБ     L0511                    ,переход на L0511
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     15(М7)                   ,СМ := 15(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
TAB3    ПО     L0230                    ,если СМ=0 → L0230
        ПБ     V2                       ,переход на V2
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     V13                      ,переход на V13
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
L0473   РЖА    '22'                     ,РЖ := '22'
L0474   НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
V32     ПО     SEP7                     ,если СМ=0 → SEP7
        ПБ     V22                      ,переход на V22
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
TAB4    МОДА   *TAB*                    ,мод.адрес +1: *TAB*
INF1    СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     INF2(М7)                 ,СМ += INF2(М7)
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
SEPA    РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
L0511   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        СЛ     L0003(М7)                ,СМ += L0003(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0250                    ,если СМ≠0 → L0250
        ПБ     SEK1                     ,переход на SEK1
        ПБ     V4                       ,переход на V4
V33     МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
SUT     МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        ЗП     23(М7)                   ,23 := СМ
        РЖА    '3'                      ,РЖ := '3'
SUT2    МОДА   *SUT*                    ,мод.адрес +1: *SUT*
RWINF   СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
INF     МОДА   *INF*                    ,мод.адрес +1: *INF*
SUT3    СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
SLY5    СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
V75     ПЕ     L0265                    ,если СМ≠0 → L0265
        ПБ     L0266                    ,переход на L0266
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
SEPB    ПБ     LYG22                    ,переход на LYG22
        ПБ     L0511                    ,переход на L0511
        СЧ     5(М7)                    ,СМ := 5(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
TAB5    СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     SLY2                     ,если СМ=0 → SLY2
        ПБ     L0607                    ,переход на L0607
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
L0567   СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     INF2(М7)                 ,СМ += INF2(М7)
RWINF2  МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SUT*+1                  ,мод.адрес +1: *SUT*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
SEKDYD  СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *SUT*+1                  ,мод.адрес +1: *SUT*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0312                    ,если СМ=0 → L0312
        ПБ     V12                      ,переход на V12
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     LYG22                    ,переход на LYG22
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОД    SEKDYD                   ,мод.адрес по коду: SEKDYD
        УИА    SEKGIR(М1)               ,М1 := SEKGIR
        МОДА   *LRE*+77777(М1)          ,мод.адрес +1: *LRE*+77777(
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0320                    ,если СМ≠0 → L0320
        ПБ     V13                      ,переход на V13
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     15(М7)                   ,СМ := 15(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     SLY3                     ,если СМ=0 → SLY3
        ПБ     V73                      ,переход на V73
        ПБ     KOKSON                   ,переход на KOKSON
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        ЗП     15(М7)                   ,15 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SEKDYD(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     INF23                    ,если СМ≠0 → INF23
        ПБ     KOKSON                   ,переход на KOKSON
        СЧ     7(М7)                    ,СМ := 7(М7)
        ЗП     18(М7)                   ,18 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     2(М7)                    ,СМ -= 2(М7)
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     V23                      ,если СМ=0 → V23
        ПБ     SEP8                     ,переход на SEP8
        ПБ     SLY4                     ,переход на SLY4
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     SEKGIR                   ,СМ := SEKGIR
        УИА    RWINF2(М16)              ,М16 := RWINF2
        ПВ     I*MU*I(М15)              ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        МОДА   *SEP*+4                  ,мод.адрес +1: *SEP*+4
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0356                    ,если СМ=0 → L0356
        ПБ     V3                       ,переход на V3
        ПБ     SEK3                     ,переход на SEK3
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     СИМ554                   ,переход на СИМ554
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     11(М7)                   ,СМ := 11(М7)
        ЗП     24(М7)                   ,24 := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     LYG24                    ,если СМ≠0 → LYG24
        ПБ     V18                      ,переход на V18
        ПБ     REGIM                    ,переход на REGIM
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     11(М7)                   ,СМ := 11(М7)
        ВЧОБ   SEKGIR                   ,СМ := (адрес) - СМ
        ЗП     24(М7)                   ,24 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     L0030(М7)                ,СМ += L0030(М7)
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     19(М7)                   ,СМ := 19(М7)
        МОДА   *SEP*+4                  ,мод.адрес +1: *SEP*+4
        ВЧ     SEKGIR                   ,СМ -= SEKGIR
        УИА    L0567(М16)               ,М16 := L0567
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        СЛ     SEKGIR                   ,СМ += SEKGIR
        МОДА   *SEP*+2                  ,мод.адрес +1: *SEP*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *DYD*                    ,мод.адрес +1: *DYD*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     WRREM                    ,если СМ=0 → WRREM
        ПБ     L0427                    ,переход на L0427
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *ADR*+1                  ,мод.адрес +1: *ADR*+1
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *SEP*+4                  ,мод.адрес +1: *SEP*+4
        ВЧ     SEKGIR                   ,СМ -= SEKGIR
        УИА    L0567(М16)               ,М16 := L0567
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *SEP*+1                  ,мод.адрес +1: *SEP*+1
        СЛ     SEKGIR                   ,СМ += SEKGIR
        МОДА   *SEP*+2                  ,мод.адрес +1: *SEP*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     V72                      ,переход на V72
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0434                    ,если СМ=0 → L0434
        ПБ     SEP9                     ,переход на SEP9
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     18(М7)                   ,СМ := 18(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     L0440                    ,если СМ≠0 → L0440
        ПБ     V74                      ,переход на V74
        ПБ     L0511                    ,переход на L0511
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     3(М7)                    ,СМ := 3(М7)
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     ADRSEK(М15)              ,вызов через М15
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0450                    ,если СМ=0 → L0450
        ПБ     TAB3                     ,переход на TAB3
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     9(М7)                    ,СМ := 9(М7)
        УИА    *LYG*+1(М16)             ,М16 := *LYG*+1
        ПВ     I*MU*I(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     8(М7)                    ,СМ -= 8(М7)
        МОДА   *ADR*+1                  ,мод.адрес +1: *ADR*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     KOKSON(М15)              ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        СЛ     INF2(М7)                 ,СМ += INF2(М7)
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     23(М7)                   ,СМ := 23(М7)
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *INF*+2                  ,мод.адрес +1: *INF*+2
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПО     L0473                    ,если СМ=0 → L0473
        ПБ     L0474                    ,переход на L0474
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     V32                      ,переход на V32
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПВ     WRREM(М15)               ,вызов через М15
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        СЧ     17(М7)                   ,СМ := 17(М7)
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     TAB4                     ,если СМ≠0 → TAB4
        ПБ     INF1                     ,переход на INF1
        ПБ     SEPA                     ,переход на SEPA
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     20(М7)                   ,СМ := 20(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     21(М7)                   ,СМ := 21(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     17(М7)                   ,17 := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     5(М7)                    ,СМ := 5(М7)
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     13(М7)                   ,СМ := 13(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     14(М7)                   ,СМ := 14(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     1(М7)                    ,СМ := 1(М7)
        ЗП     15(М7)                   ,15 := СМ
        МОДА   *SEP*                    ,мод.адрес +1: *SEP*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        ВЧ     5(М7)                    ,СМ -= 5(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     V33                      ,если СМ≠0 → V33
        ПБ     SUT                      ,переход на SUT
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     IMUI                     ,переход на IMUI
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     7(М7)                    ,СМ := 7(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        НТЖ    SEKGIR(М17)              ,СМ ^= SEKGIR(М17)
        ПЕ     SUT2                     ,если СМ≠0 → SUT2
        ПБ     RWINF                    ,переход на RWINF
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     SLY5                     ,переход на SLY5
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        СЧ     SEKGIR                   ,СМ := SEKGIR
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *NRD*+30                 ,мод.адрес +1: *NRD*+30
        ВЧ     SEKGIR                   ,СМ -= SEKGIR
        СЛ     LYG2(М7)                 ,СМ += LYG2(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     INF                      ,если СМ≠0 → INF
        ПБ     SUT3                     ,переход на SUT3
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        ПБ     L0030                    ,переход на L0030
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR
        СЧ     SEKGIR(М7)               ,СМ := SEKGIR(М7)
        МОДА   *SUT*+1                  ,мод.адрес +1: *SUT*+1
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     SEKGIR(М7)               ,СМ := SEKGIR(М7)
        МОДА   *SUT*                    ,мод.адрес +1: *SUT*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        СЧ     16(М7)                   ,СМ := 16(М7)
        МОДА   *TAB*                    ,мод.адрес +1: *TAB*
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     13(М7)                   ,СМ := 13(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKGIR                   ,SEKGIR := СМ
        СЧ     14(М7)                   ,СМ := 14(М7)
        МОДА   СИМ55                    ,мод.адрес +1: СИМ55
        ЗП     SEKGIR                   ,SEKGIR := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     SEPB                     ,переход на SEPB
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    TAB5(М7)                 ,М7 := TAB5
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М1                       ,стек := М1, СМ := М1
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SEKGIR(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М1                       ,М1 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SEKGIR(М10)              ,переход через М10
        МОДА   SEKGIR                   ,мод.адрес +1: SEKGIR

