***************************************************
* SEKLYG - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 18144 образа SIPROD.BIN
*   Длина при загрузке: 139 слов, 260 команд
*   Вход: SEKLYG
*   Выход: RASTXT:TXTB+1, SEGTAB:SCANEA, SEGTAB:V26A+1, 
*   LYG4F (возврат через М12), LYG4F (возврат через М10)
*   РАЗБОР СЕГМЕНТА ЛИСТА (СТРАНИЦЫ).
*   Внешние: TAB, INF, ATV, DYD, APJ, LYG, SEK, LNT, STL, SLY, NUST, PLN, 
*   PAGE, REGIM, TXT, NDAB, BEGPG, KLAIDA, RWINF, SEKGIR
*   Смещения в ATV: 1
*   Смещения в DYD: 1, 2
*   Смещения в INF: 1, 2
*   Смещения в LYG: 1, 2
*   Смещения в NDAB: 1
*   Смещения в NUST: 8
*   Смещения в PAGE: 3, 4, 5
*   Смещения в SEK: 2, 3
*   Смещения в SLY: 1
*   Смещения в STL: 1
*   Смещения в TAB: 1
*   Смещения в TXT: 1
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 TAB
*   002 TAB1
*   003 INF
*   004 INF1
*   005 INF2
*   006 ATV
*   007 ATV1
*   008 DYD
*   009 DYD1
*   010 DYD2
*   011 APJ
*   012 LYG
*   013 LYG1
*   014 LYG2
*   015 SEK
*   016 LNT
*   017 STL
*   018 STL1
*   019 SLY
*   020 SLY1
*   021 NUST
*   022 PLN
*   023 PAGE
*   024 PAGE3
*   025 PAGE4
*   026 PAGE5
*   027 REGIM
*   028 TXT
*   029 TXT1
*   030 NDAB
*   031 NDAB1
*   032 BEGPG
*   033 KLAIDA
*   034 RWINF
*   035 SEKGIR
*   036 LYG3
*   037 SEK3
*   038 LYG5
*   039 SEK2
*   040 LYG4
*   041 NUST8
*
*** КОД МОДУЛЯ
*
SEKLYG   СТАРТ  0
         УИА    LYG3A(М16)              ,М16 := LYG3A
LYG3A    ПБ     LYG4C                   ,переход на LYG4C
*
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         СЧ     0                       ,СМ := 0
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         ЗП     0                       ,0 := СМ
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         СЧ     0                       ,СМ := 0
         МОДА   SEK2                    ,мод.адрес +1: SEK2
         ЗП     0                       ,0 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
LYG3B    МОДА   LNT                     ,мод.адрес +1: LNT
LYG3C    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     LYG3B                   ,если СМ≠0 → LYG3B
         СЧ     4(М7)                   ,СМ := 4(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEK                     ,мод.адрес +1: SEK
LYG3D    СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     LYG3B                   ,если СМ=0 → LYG3B
         ПБ     LYG3C                   ,переход на LYG3C
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     LYG3D                   ,переход на LYG3D
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         МОДА   SLY                     ,мод.адрес +1: SLY
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     SEKGIR(М15)             ,вызов через М15
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   SLY                     ,мод.адрес +1: SLY
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   PLN                     ,мод.адрес +1: PLN
SLYA     ЗП     0                       ,0 := СМ
SLYB     РЖА    '3'                     ,РЖ := '3'
         МОДА   LYG1                    ,мод.адрес +1: LYG1
         СЧ     0                       ,СМ := 0
         МОДА   LYG                     ,мод.адрес +1: LYG
         ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   ATV                     ,мод.адрес +1: ATV
SLYC     ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         МОДА   INF                     ,мод.адрес +1: INF
SLYD     ЗП     0                       ,0 := СМ
         МОДА   TXT                     ,мод.адрес +1: TXT
         СЧ     0                       ,СМ := 0
         МОДА   INF1                    ,мод.адрес +1: INF1
SLYE     ЗП     0                       ,0 := СМ
SLYF     РЖА    '22'                    ,РЖ := '22'
         ПВ     RWINF(М15)              ,вызов через М15
         МОДА   INF                     ,мод.адрес +1: INF
         СЧ     0                       ,СМ := 0
         МОДА   ATV                     ,мод.адрес +1: ATV
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
INFA     МОДА   LYG3                    ,мод.адрес +1: LYG3
         СЧ     0                       ,СМ := 0
INFB     МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         СЧ     0                       ,СМ := 0
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         МОДА   LYG1                    ,мод.адрес +1: LYG1
         СЧ     0                       ,СМ := 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         ВЧ     0                       ,СМ -= 0
INFC     МОДА   PAGE4                   ,мод.адрес +1: PAGE4
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
INFD     ПЕ     SLYA                    ,если СМ≠0 → SLYA
         ПБ     SLYB                    ,переход на SLYB
*
         ПБ     LYG4B                   ,переход на LYG4B
*
         МОДА   0                       ,мод.адрес +1: 0
NUST8A   МОДА   NUST8                   ,мод.адрес +1: NUST8
NUST8B   СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         ЗП     0                       ,0 := СМ
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЧ     0                       ,СМ := 0
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         МОДА   DYD2                    ,мод.адрес +1: DYD2
         СЛ     0                       ,СМ += 0
NUST8C   РЖА    '22'                    ,РЖ := '22'
         ПЕ     SLYC                    ,если СМ≠0 → SLYC
NUST8D   ПБ     SLYD                    ,переход на SLYD
*
         МОДА   NUST8                   ,мод.адрес +1: NUST8
         СЧ     0                       ,СМ := 0
         МОДА   DYD2                    ,мод.адрес +1: DYD2
NUST8E   ЗП     0                       ,0 := СМ
NUST8F   РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         СЧИМ                           ,СЧИ + магазин
NUST8G   МОДА   REGIM                   ,мод.адрес +1: REGIM
NUST8H   СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SLYE                    ,если СМ≠0 → SLYE
         ПБ     SLYF                    ,переход на SLYF
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8B                  ,переход на NUST8B
*
LYG4A    МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
LYG4B    МОДА   LYG4                    ,мод.адрес +1: LYG4
         ЗП     0                       ,0 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
LYG4C    НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     INFA                    ,если СМ=0 → INFA
         ПБ     INFB                    ,переход на INFB
*
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   LYG4                    ,мод.адрес +1: LYG4
LYG4D    ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
LYG4E    МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         МОДА   LYG5                    ,мод.адрес +1: LYG5
         ЗП     0                       ,0 := СМ
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
LYG4F    МОДА   SEK2                    ,мод.адрес +1: SEK2
         ЗП     0                       ,0 := СМ
         СЧ     5(М7)                   ,СМ := 5(М7)
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     INFC                    ,если СМ=0 → INFC
         ПБ     INFD                    ,переход на INFD
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     5(М7)                   ,СМ := 5(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ЗП     8(М7)                   ,8 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NUST8A                  ,если СМ≠0 → NUST8A
         ПБ     NUST8B                  ,переход на NUST8B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUST8D                  ,переход на NUST8D
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         ЗП     0                       ,0 := СМ
         МОДА   LYG3                    ,мод.адрес +1: LYG3
         ЗП     0                       ,0 := СМ
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         СЧ     0                       ,СМ := 0
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         ЗП     0                       ,0 := СМ
         МОДА   LYG2                    ,мод.адрес +1: LYG2
         СЧ     0                       ,СМ := 0
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     3(М7)                   ,СМ += 3(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     NUST8C                  ,если СМ≠0 → NUST8C
         ПБ     NUST8D                  ,переход на NUST8D
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    LYG4F(М16)              ,М16 := LYG4F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     KLAIDA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     NUST8E                  ,если СМ≠0 → NUST8E
         ПБ     NUST8F                  ,переход на NUST8F
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     LYG4A                   ,переход на LYG4A
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   LYG4                    ,мод.адрес +1: LYG4
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     NUST8G                  ,если СМ=0 → NUST8G
         ПБ     NUST8H                  ,переход на NUST8H
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     LYG4A                   ,переход на LYG4A
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         МОДА   APJ                     ,мод.адрес +1: APJ
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     BEGPG(М15)              ,вызов через М15
         СЧ     1(М7)                   ,СМ := 1(М7)
         МОДА   APJ                     ,мод.адрес +1: APJ
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   PAGE3                   ,мод.адрес +1: PAGE3
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   LYG                     ,мод.адрес +1: LYG
         ЗП     0                       ,0 := СМ
         МОДА   LYG1                    ,мод.адрес +1: LYG1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   LYG                     ,мод.адрес +1: LYG
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   LNT                     ,мод.адрес +1: LNT
         СЛ     0                       ,СМ += 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         МОДА   SLY1                    ,мод.адрес +1: SLY1
         СЧ     0                       ,СМ := 0
         СЛ     2(М7)                   ,СМ += 2(М7)
         МОДА   SLY1                    ,мод.адрес +1: SLY1
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     LYG4D                   ,переход на LYG4D
*
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    LYG4E(М7)               ,М7 := LYG4E
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*

