***************************************************
* SEKLYG - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 18144 образа SIPROD.BIN
*   Длина при загрузке: 139 слов, 260 команд
*   Вход: SEKLYG
*   Внешние: *TAB*, *INF*, *ATV*, *DYD*, *APJ*, *LYG*, *SEK*, *LNT*, *STL*, 
*   *SLY*, *NUST*, *PLN*, *PAGE*, *REGIM*, *TXT*, *NDAB*, BEGPG, KLAIDA, 
*   RWINF, SEKGIR
*   Смещения в *ATV*: 1
*   Смещения в *DYD*: 1, 2
*   Смещения в *INF*: 1, 2
*   Смещения в *LYG*: 1, 2
*   Смещения в *NDAB*: 1
*   Смещения в *NUST*: 8
*   Смещения в *PAGE*: 3, 4, 5
*   Смещения в *SEK*: 2, 3
*   Смещения в *SLY*: 1
*   Смещения в *STL*: 1
*   Смещения в *TAB*: 1
*   Смещения в *TXT*: 1
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
SEKLYG  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     СИМ503                   ,переход на СИМ503
СИМ44   МОДА   СИМ44                    ,мод.адрес +1: СИМ44
SEK3    СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        СЧ     SEKLYG                   ,СМ := SEKLYG
SEK2    МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
L0012   СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
LNT     МОДА   *LNT*                    ,мод.адрес +1: *LNT*
SEK     СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     LNT                      ,если СМ≠0 → LNT
        СЧ     4(М7)                    ,СМ := 4(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*                    ,мод.адрес +1: *SEK*
SEKGIR  СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     LNT                      ,если СМ=0 → LNT
        ПБ     SEK                      ,переход на SEK
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     SEKGIR                   ,переход на SEKGIR
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     4(М7)                    ,СМ := 4(М7)
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     SEKGIR(М15)              ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *SLY*                    ,мод.адрес +1: *SLY*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *PLN*                    ,мод.адрес +1: *PLN*
L0050   ЗП     SEKLYG                   ,SEKLYG := СМ
LYG1    РЖА    '3'                      ,РЖ := '3'
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     SEKLYG(М7)               ,СМ := SEKLYG(М7)
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
INF     ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     SEKLYG(М7)               ,СМ := SEKLYG(М7)
        МОДА   *INF*                    ,мод.адрес +1: *INF*
TXT     ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *TXT*                    ,мод.адрес +1: *TXT*
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *INF*+1                  ,мод.адрес +1: *INF*+1
L0067   ЗП     SEKLYG                   ,SEKLYG := СМ
RWINF   РЖА    '22'                     ,РЖ := '22'
        ПВ     RWINF(М15)               ,вызов через М15
        МОДА   *INF*                    ,мод.адрес +1: *INF*
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *ATV*                    ,мод.адрес +1: *ATV*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
СИМ442  МОДА   СИМ44                    ,мод.адрес +1: СИМ44
        СЧ     SEKLYG                   ,СМ := SEKLYG
LYG2    МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        ВЧ     SEKLYG                   ,СМ -= SEKLYG
PAGE4   МОДА   *PAGE*+4                 ,мод.адрес +1: *PAGE*+4
        ВЧ     SEKLYG                   ,СМ -= SEKLYG
        РЖА    '22'                     ,РЖ := '22'
V1      ПЕ     L0050                    ,если СМ≠0 → L0050
        ПБ     LYG1                     ,переход на LYG1
        ПБ     СИМ502                   ,переход на СИМ502
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
NUST10  МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
NUST1A  СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     СИМ44(М7)                ,СМ += СИМ44(М7)
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     SEKLYG                   ,СМ := SEKLYG
        ВЧОБ   SEKLYG                   ,СМ := (адрес) - СМ
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
        СЛ     SEKLYG                   ,СМ += SEKLYG
L0135   РЖА    '22'                     ,РЖ := '22'
        ПЕ     INF                      ,если СМ≠0 → INF
NUST1B  ПБ     TXT                      ,переход на TXT
        МОДА   *NUST*+10                ,мод.адрес +1: *NUST*+10
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *DYD*+2                  ,мод.адрес +1: *DYD*+2
L0143   ЗП     SEKLYG                   ,SEKLYG := СМ
L0144   РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        СЧИМ                            ,СЧИ + магазин
REGIM   МОДА   *REGIM*                  ,мод.адрес +1: *REGIM*
V2      СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     L0067                    ,если СМ≠0 → L0067
        ПБ     RWINF                    ,переход на RWINF
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     NUST1A                   ,переход на NUST1A
СИМ50   МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     СИМ44(М7)                ,СМ += СИМ44(М7)
СИМ502  МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     3(М7)                    ,СМ := 3(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '22'                     ,РЖ := '22'
СИМ503  НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     СИМ442                   ,если СМ=0 → СИМ442
        ПБ     LYG2                     ,переход на LYG2
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
V12     ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
СИМ504  МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   СИМ46                    ,мод.адрес +1: СИМ46
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
KLAIDA  МОДА   *SEK*+2                  ,мод.адрес +1: *SEK*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
        СЧ     5(М7)                    ,СМ := 5(М7)
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '3'                      ,РЖ := '3'
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '22'                     ,РЖ := '22'
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     PAGE4                    ,если СМ=0 → PAGE4
        ПБ     V1                       ,переход на V1
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     5(М7)                    ,СМ := 5(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧОБ   SEKLYG                   ,СМ := (адрес) - СМ
        ЗП     8(М7)                    ,8 := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     NUST10                   ,если СМ≠0 → NUST10
        ПБ     NUST1A                   ,переход на NUST1A
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     NUST1B                   ,переход на NUST1B
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     СИМ44(М7)                ,СМ += СИМ44(М7)
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   СИМ44                    ,мод.адрес +1: СИМ44
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKLYG                   ,СМ := SEKLYG
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+2                  ,мод.адрес +1: *LYG*+2
        СЧ     SEKLYG                   ,СМ := SEKLYG
        ВЧОБ   SEKLYG                   ,СМ := (адрес) - СМ
        СЛ     SEK3(М7)                 ,СМ += SEK3(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0135                    ,если СМ≠0 → L0135
        ПБ     NUST1B                   ,переход на NUST1B
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        УИА    KLAIDA(М16)              ,М16 := KLAIDA
        СЧИМ   М16                      ,стек := М16, СМ := М16
        ПВ     KLAIDA(М15)              ,вызов через М15
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   *SEK*+3                  ,мод.адрес +1: *SEK*+3
        СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПЕ     L0143                    ,если СМ≠0 → L0143
        ПБ     L0144                    ,переход на L0144
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     СИМ50                    ,переход на СИМ50
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     1(М7)                    ,СМ := 1(М7)
        СЧИМ                            ,СЧИ + магазин
        МОДА   СИМ50                    ,мод.адрес +1: СИМ50
        СЧ     SEKLYG                   ,СМ := SEKLYG
        НТЖ    SEKLYG(М17)              ,СМ ^= SEKLYG(М17)
        ПО     REGIM                    ,если СМ=0 → REGIM
        ПБ     V2                       ,переход на V2
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        ПБ     СИМ50                    ,переход на СИМ50
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        СЧ     4(М7)                    ,СМ := 4(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПВ     BEGPG(М15)               ,вызов через М15
        СЧ     1(М7)                    ,СМ := 1(М7)
        МОДА   *APJ*                    ,мод.адрес +1: *APJ*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   *PAGE*+3                 ,мод.адрес +1: *PAGE*+3
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        СЛ     СИМ44(М7)                ,СМ += СИМ44(М7)
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *LYG*+1                  ,мод.адрес +1: *LYG*+1
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '22'                     ,РЖ := '22'
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        МОДА   *LYG*                    ,мод.адрес +1: *LYG*
        СЧ     SEKLYG                   ,СМ := SEKLYG
        РЖА    '3'                      ,РЖ := '3'
        МОДА   *LNT*                    ,мод.адрес +1: *LNT*
        СЛ     SEKLYG                   ,СМ += SEKLYG
        МОДА   *NDAB*                   ,мод.адрес +1: *NDAB*
        ЗП     SEKLYG                   ,SEKLYG := СМ
        МОДА   *SLY*+1                  ,мод.адрес +1: *SLY*+1
        СЧ     SEKLYG                   ,СМ := SEKLYG
        СЛ     СИМ44(М7)                ,СМ += СИМ44(М7)
        МОДА   *SLY*+1                  ,мод.адрес +1: *SLY*+1
        ЗП     SEKLYG                   ,SEKLYG := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     V12                      ,переход на V12
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    СИМ504(М7)               ,М7 := СИМ504
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SEKLYG(М12)              ,переход через М12
        МОДА   SEKLYG                   ,мод.адрес +1: SEKLYG
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SEKLYG(М10)              ,переход через М10

