***************************************************
* SYTINT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 15168 образа SIPROD.BIN
*   Длина при загрузке: 82 слов, 132 команд
*   Вход: SYTINT
*   Внешние:  A   A И, RSYMB
*   Регистры: М7, М10, М12, М15, М16
***************************************************
SYTINT  СТАРТ  0
        УИА    L0001(М16)               ,М16 := L0001
L0001   ПБ     L0072                    ,переход на L0072
        СЧ     '4003'(М7)               ,СМ := '4003'(М7)
        ЗП     2(М7)                    ,2 := СМ
        РЖА    '3'                      ,РЖ := '3'
L0120   МОД    L01202                   ,мод.адрес по коду: L01202
        СЧ     SYTINT                   ,СМ := SYTINT
        ЗП     3(М7)                    ,3 := СМ
L0010   РЖА    '22'                     ,РЖ := '22'
        МОДА   SYTINT                   ,мод.адрес +1: SYTINT
L0117   МОД    V25                      ,мод.адрес по коду: V25
        УИА    SYTINT(М16)              ,М16 := SYTINT
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0113(М16)               ,М16 := L0113
        СЧИМ   М16                      ,стек := М16, СМ := М16
L0017   УИА    L0112(М16)               ,М16 := L0112
L0020   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0111(М16)               ,М16 := L0111
        СЧИМ   М16                      ,стек := М16, СМ := М16
RSYMB   ПВ     RSYMB(М15)               ,вызов через М15
L0024   РЖА    '3'                      ,РЖ := '3'
L0025   РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        РЖА    '3'                      ,РЖ := '3'
L0030   ВЧОБ   SYTINT                   ,СМ := (адрес) - СМ
        СЛ     *4004B(М7)               ,СМ += *4004B(М7)
V2      РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0017                    ,если СМ≠0 → L0017
        ПБ     L0020                    ,переход на L0020
        МОДА   SYTINT                   ,мод.адрес +1: SYTINT
        ПБ     L0025                    ,переход на L0025
        МОДА   SYTINT                   ,мод.адрес +1: SYTINT
        СЧ     2(М7)                    ,СМ := 2(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     '4005'(М7)               ,СМ -= '4005'(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     RSYMB                    ,если СМ≠0 → RSYMB
        ПБ     L0024                    ,переход на L0024
        ПБ     L0025                    ,переход на L0025
V22     МОДА   SYTINT                   ,мод.адрес +1: SYTINT
V23     ПБ     L0030                    ,переход на L0030
        МОДА   SYTINT                   ,мод.адрес +1: SYTINT
        СЧ     3(М7)                    ,СМ := 3(М7)
L0053   РЖА    '3'                      ,РЖ := '3'
L0054   СЛ     SYTINT(М7)               ,СМ += SYTINT(М7)
L01172  ЗП     3(М7)                    ,3 := СМ
        РЖА    '22'                     ,РЖ := '22'
        ПБ     L0120                    ,переход на L0120
        СЧ     3(М7)                    ,СМ := 3(М7)
        ЗП     4(М7)                    ,4 := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     4(М7)                    ,СМ := 4(М7)
        РЖА    '3'                      ,РЖ := '3'
        СЛ     SYTINT(М7)               ,СМ += SYTINT(М7)
        ЗП     4(М7)                    ,4 := СМ
        МОД    V25                      ,мод.адрес по коду: V25
        УИА    SYTINT(М16)              ,М16 := SYTINT
L0072   СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0114(М16)               ,М16 := L0114
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0112(М16)               ,М16 := L0112
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0111(М16)               ,М16 := L0111
RSYMB2  СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ     RSYMB(М15)               ,вызов через М15
        МОДА   SYTINT                   ,мод.адрес +1: SYTINT
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     2(М7)                    ,СМ := 2(М7)
        РЖА    '3'                      ,РЖ := '3'
L0110   ВЧОБ   SYTINT                   ,СМ := (адрес) - СМ
L0111   СЛ     *4004B(М7)               ,СМ += *4004B(М7)
L0112   РЖА    '22'                     ,РЖ := '22'
L0113   ПЕ     V22                      ,если СМ≠0 → V22
L0114   ПБ     V23                      ,переход на V23
V24     МОДА   SYTINT                   ,мод.адрес +1: SYTINT
L0116   ПБ     L01172                   ,переход на L01172
V25     МОДА   SYTINT                   ,мод.адрес +1: SYTINT
L01202  СЧ     2(М7)                    ,СМ := 2(М7)
AAИ     РЖА    '3'                      ,РЖ := '3'
        ВЧ     '4005'(М7)               ,СМ -= '4005'(М7)
        РЖА    '22'                     ,РЖ := '22'
        ПЕ     L0053                    ,если СМ≠0 → L0053
        ПБ     L0054                    ,переход на L0054
        ПБ     L01172                   ,переход на L01172
        МОДА   SYTINT                   ,мод.адрес +1: SYTINT
        ПБ     V2                       ,переход на V2
        МОДА   SYTINT                   ,мод.адрес +1: SYTINT
        СЧ     4(М7)                    ,СМ := 4(М7)
        РЖА    '3'                      ,РЖ := '3'
        ВЧ     3(М7)                    ,СМ -= 3(М7)
        ЗП     5(М7)                    ,5 := СМ
        МОД    V25                      ,мод.адрес по коду: V25
        УИА    SYTINT(М16)              ,М16 := SYTINT
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0113(М16)               ,М16 := L0113
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    V24(М16)                 ,М16 := V24
        СЧИМ   М16                      ,стек := М16, СМ := М16
        МОД    AAИ                      ,мод.адрес по коду: AAИ
        УИА    SYTINT(М16)              ,М16 := SYTINT
        СЧИМ   М16                      ,стек := М16, СМ := М16
        УИА    L0116(М16)               ,М16 := L0116
        СЧИМ   М16                      ,стек := М16, СМ := М16
        РЖА    '22'                     ,РЖ := '22'
        ПВ      A   A И(М15)            ,вызов через М15
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        СЧ     4(М7)                    ,СМ := 4(М7)
        МОД    L01202                   ,мод.адрес по коду: L01202
        ЗП     SYTINT                   ,SYTINT := СМ
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '22'                     ,РЖ := '22'
        ПБ     RSYMB2                   ,переход на RSYMB2
        УИИ    М10(М7)                  ,М10 := М7
        УИИ    М12(М16)                 ,М12 := М16
        УИА    L0110(М7)                ,М7 := L0110
        ЗПМ    9(М7)                    ,ЗП + магазин: 9(М7)
        ЗПМ    8(М7)                    ,ЗП + магазин: 8(М7)
        ЗПМ    7(М7)                    ,ЗП + магазин: 7(М7)
        СЧИМ   М15                      ,стек := М15, СМ := М15
        СЧИМ   М10                      ,стек := М10, СМ := М10
        СЧИМ                            ,СЧИ + магазин
        РЖА    '3'                      ,РЖ := '3'
        РЖА    '2'                      ,РЖ := '2'
        ПБ     SYTINT(М12)              ,переход через М12
        УИМ                             ,УИ + магазин
        УИМ    М7                       ,М7 := СМ + стек
        УИМ    М10                      ,М10 := СМ + стек
        ПБ     SYTINT(М10)              ,переход через М10

