***************************************************
* SYTINT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 15168 образа SIPROD.BIN
*   Длина при загрузке: 82 слов, 132 команд
*   Вход: SYTINT
*   Внешние: AAИ, RSYMB
*   Регистры: М7, М10, М12, М15, М16
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 AAИ
*   002 RSYMB
*
SYTINT   СТАРТ  0
         УИА    L0001(М16)              ,М16 := L0001
L0001    ПБ     L0072                   ,переход на L0072
         СЧ     '4003'(М7)              ,СМ := '4003'(М7)
         ЗП     2(М7)                   ,2 := СМ
         РЖА    '3'                     ,РЖ := '3'
L0120    МОД    L0120A                  ,мод.адрес по коду: L0120A
         СЧ     0                       ,СМ := 0
         ЗП     3(М7)                   ,3 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОД    V2D                     ,мод.адрес по коду: V2D
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0113(М16)              ,М16 := L0113
         СЧИМ   М16                     ,стек := М16, СМ := М16
L0017    УИА    L0112(М16)              ,М16 := L0112
L0020    СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0111(М16)              ,М16 := L0111
         СЧИМ   М16                     ,стек := М16, СМ := М16
RSYMBA   ПВ     RSYMB(М15)              ,вызов через М15
L0024    РЖА    '3'                     ,РЖ := '3'
L0025    РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
L0030    ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     '4004'(М7)              ,СМ += '4004'(М7)
V2       РЖА    '22'                    ,РЖ := '22'
         ПЕ     L0017                   ,если СМ≠0 → L0017
         ПБ     L0020                   ,переход на L0020
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     L0025                   ,переход на L0025
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     '4005'(М7)              ,СМ -= '4005'(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     RSYMBA                  ,если СМ≠0 → RSYMBA
         ПБ     L0024                   ,переход на L0024
         ПБ     L0025                   ,переход на L0025
V2A      МОДА   0                       ,мод.адрес +1: 0
V2B      ПБ     L0030                   ,переход на L0030
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
L0053    РЖА    '3'                     ,РЖ := '3'
L0054    СЛ     0(М7)                   ,СМ += 0(М7)
L0117    ЗП     3(М7)                   ,3 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     L0120                   ,переход на L0120
         СЧ     3(М7)                   ,СМ := 3(М7)
         ЗП     4(М7)                   ,4 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     4(М7)                   ,СМ := 4(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     4(М7)                   ,4 := СМ
         МОД    V2D                     ,мод.адрес по коду: V2D
         УИА    0(М16)                  ,М16 := 0
L0072    СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0114(М16)              ,М16 := L0114
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0112(М16)              ,М16 := L0112
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0111(М16)              ,М16 := L0111
RSYMBB   СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
L0110    ВЧОБ   0                       ,СМ := (адрес) - СМ
L0111    СЛ     '4004'(М7)              ,СМ += '4004'(М7)
L0112    РЖА    '22'                    ,РЖ := '22'
L0113    ПЕ     V2A                     ,если СМ≠0 → V2A
L0114    ПБ     V2B                     ,переход на V2B
V2C      МОДА   0                       ,мод.адрес +1: 0
L0116    ПБ     L0117                   ,переход на L0117
V2D      МОДА   0                       ,мод.адрес +1: 0
L0120A   СЧ     2(М7)                   ,СМ := 2(М7)
AAИA     РЖА    '3'                     ,РЖ := '3'
         ВЧ     '4005'(М7)              ,СМ -= '4005'(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     L0053                   ,если СМ≠0 → L0053
         ПБ     L0054                   ,переход на L0054
         ПБ     L0117                   ,переход на L0117
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V2                      ,переход на V2
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     3(М7)                   ,СМ -= 3(М7)
         ЗП     5(М7)                   ,5 := СМ
         МОД    V2D                     ,мод.адрес по коду: V2D
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0113(М16)              ,М16 := L0113
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2C(М16)                ,М16 := V2C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    AAИA                    ,мод.адрес по коду: AAИA
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    L0116(М16)              ,М16 := L0116
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     AAИ(М15)                ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     4(М7)                   ,СМ := 4(М7)
         МОД    L0120A                  ,мод.адрес по коду: L0120A
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     RSYMBB                  ,переход на RSYMBB
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    L0110(М7)               ,М7 := L0110
         ЗПМ    9(М7)                   ,ЗП + магазин: 9(М7)
         ЗПМ    8(М7)                   ,ЗП + магазин: 8(М7)
         ЗПМ    7(М7)                   ,ЗП + магазин: 7(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10

