***************************************************
* SYTINT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 15168 образа SIPROD.BIN
*   Длина при загрузке: 82 слов, 132 команд
*   Вход: SYTINT
*   Выход: смещение 177, через М12, смещение 203, через М10
*   СИНХРОНИЗАЦИЯ ВЫВОДА С ТЕКСТОВЫМ ПОТОКОМ.
*   Внешние: AAИ, RSYMB
*   Регистры: М7, М10, М12, М15, М16
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 AAИ
*   002 RSYMB
*
SYTINT   СТАРТ  0
         УИА    V2(М16)                 ,М16 := V2
V2       ПБ     V3C                     ,переход на V3C
         СЧ     '4003'(М7)              ,СМ := '4003'(М7)
         ЗП     2(М7)                   ,2 := СМ
         РЖА    '3'                     ,РЖ := '3'
V2A      МОД    V2R                     ,мод.адрес по коду: V2R
         СЧ     0                       ,СМ := 0
         ЗП     3(М7)                   ,3 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОД    V2Q                     ,мод.адрес по коду: V2Q
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2M(М16)                ,М16 := V2M
         СЧИМ   М16                     ,стек := М16, СМ := М16
V2B      УИА    V2L(М16)                ,М16 := V2L
V2C      СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2K(М16)                ,М16 := V2K
         СЧИМ   М16                     ,стек := М16, СМ := М16
RSYMBA   ПВ     RSYMB(М15)              ,вызов через М15
V2D      РЖА    '3'                     ,РЖ := '3'
V2E      РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
V2F      ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     '4004'(М7)              ,СМ += '4004'(М7)
V2G      РЖА    '22'                    ,РЖ := '22'
         ПЕ     V2B                     ,если СМ≠0 → V2B
         ПБ     V2C                     ,переход на V2C
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V2E                     ,переход на V2E
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     '4005'(М7)              ,СМ -= '4005'(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     RSYMBA                  ,если СМ≠0 → RSYMBA
         ПБ     V2D                     ,переход на V2D
         ПБ     V2E                     ,переход на V2E
V2H      МОДА   0                       ,мод.адрес +1: 0
V2I      ПБ     V2F                     ,переход на V2F
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
V3       РЖА    '3'                     ,РЖ := '3'
V3A      СЛ     0(М7)                   ,СМ += 0(М7)
V3B      ЗП     3(М7)                   ,3 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V2A                     ,переход на V2A
         СЧ     3(М7)                   ,СМ := 3(М7)
         ЗП     4(М7)                   ,4 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     4(М7)                   ,СМ := 4(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     4(М7)                   ,4 := СМ
         МОД    V2Q                     ,мод.адрес по коду: V2Q
         УИА    0(М16)                  ,М16 := 0
V3C      СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2N(М16)                ,М16 := V2N
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2L(М16)                ,М16 := V2L
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2K(М16)                ,М16 := V2K
V3D      СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         РЖА    '3'                     ,РЖ := '3'
V2J      ВЧОБ   0                       ,СМ := (адрес) - СМ
V2K      СЛ     '4004'(М7)              ,СМ += '4004'(М7)
V2L      РЖА    '22'                    ,РЖ := '22'
V2M      ПЕ     V2H                     ,если СМ≠0 → V2H
V2N      ПБ     V2I                     ,переход на V2I
V2O      МОДА   0                       ,мод.адрес +1: 0
V2P      ПБ     V3B                     ,переход на V3B
V2Q      МОДА   0                       ,мод.адрес +1: 0
V2R      СЧ     2(М7)                   ,СМ := 2(М7)
V2S      РЖА    '3'                     ,РЖ := '3'
         ВЧ     '4005'(М7)              ,СМ -= '4005'(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     V3                      ,если СМ≠0 → V3
         ПБ     V3A                     ,переход на V3A
         ПБ     V3B                     ,переход на V3B
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V2G                     ,переход на V2G
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     4(М7)                   ,СМ := 4(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     3(М7)                   ,СМ -= 3(М7)
         ЗП     5(М7)                   ,5 := СМ
         МОД    V2Q                     ,мод.адрес по коду: V2Q
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2M(М16)                ,М16 := V2M
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2O(М16)                ,М16 := V2O
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    V2S                     ,мод.адрес по коду: V2S
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V2P(М16)                ,М16 := V2P
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     AAИ(М15)                ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     4(М7)                   ,СМ := 4(М7)
         МОД    V2R                     ,мод.адрес по коду: V2R
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V3D                     ,переход на V3D
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    V2J(М7)                 ,М7 := V2J
         ЗПМ    9(М7)                   ,ЗП + магазин: 9(М7)
         ЗПМ    8(М7)                   ,ЗП + магазин: 8(М7)
         ЗПМ    7(М7)                   ,ЗП + магазин: 7(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10

