***************************************************
* TAMTXT - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 19200 образа SIPROD.BIN
*   Длина при загрузке: 234 слов, 368 команд
*   Вход: TAMTXT
*   Выход: TAMPYK:V3+1, BEN2V (возврат через М12), 
*   BEN2V (возврат через М10)
*   РАЗБОР ТАБЛИЧНОГО ТЕКСТОВОГО РАЗДЕЛА.
*   Внешние: BEN, STR, DAR, RAI, RNSYMB, RSYMB, IDII, IMUI
*   Смещения в BEN: 1, 2, 3, 13
*   Смещения в DAR: 24
*   Смещения в RAI: 1
*   Смещения в STR: 24, 25, 26
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 BEN
*   002 BEN1
*   003 BEN2
*   004 BEN3
*   005 BEN13
*   006 STR
*   007 STR24
*   008 STR25
*   009 STR26
*   010 DAR
*   011 DAR24
*   012 RAI
*   013 RAI1
*   014 RNSYMB
*   015 RSYMB
*   017 IDII
*   018 IMUI
*   019 STR32767
*
*** КОД МОДУЛЯ
*
TAMTXT   СТАРТ  0
         УИА    BEN13A(М16)             ,М16 := BEN13A
BEN13A   ПБ     BEN2C                   ,переход на BEN2C
*
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   BEN13                   ,мод.адрес +1: BEN13
BEN13B   СЧ     0                       ,СМ := 0
BEN13C   НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     BEN13B                  ,если СМ=0 → BEN13B
         ПБ     BEN13C                  ,переход на BEN13C
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V11                     ,переход на V11
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     6(М7)                   ,6 := СМ
         РЖА    '3'                     ,РЖ := '3'
         УИА    BEN3(М16)               ,М16 := BEN3
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2(М16)               ,М16 := BEN2
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2I(М16)              ,М16 := BEN2I
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2G(М16)              ,М16 := BEN2G
V0       СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
STR26A   ВЧ     6(М7)                   ,СМ -= 6(М7)
STR26B   ЗП     7(М7)                   ,7 := СМ
         СЧ     6(М7)                   ,СМ := 6(М7)
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     8(М7)                   ,8 := СМ
         СЧ     7(М7)                   ,СМ := 7(М7)
STR26C   ЗП     9(М7)                   ,9 := СМ
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         ЗП     10(М7)                  ,10 := СМ
         СЧ     '4020'(М7)              ,СМ := '4020'(М7)
         ЗП     11(М7)                  ,11 := СМ
         РЖА    '22'                    ,РЖ := '22'
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
STR26D   УИА    BEN2J(М16)              ,М16 := BEN2J
STR26E   СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2M(М16)              ,М16 := BEN2M
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2G(М16)              ,М16 := BEN2G
         СЧИМ   М16                     ,стек := М16, СМ := М16
RSYMBA   ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     '4020'(М7)              ,СМ := '4020'(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     11(М7)                  ,СМ := 11(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR26A                  ,если СМ≠0 → STR26A
         ПБ     STR26B                  ,переход на STR26B
*
V11      ПБ     STR26C                  ,переход на STR26C
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     8(М7)                   ,СМ := 8(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     8(М7)                   ,8 := СМ
V9       СЧ     9(М7)                   ,СМ := 9(М7)
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     9(М7)                   ,9 := СМ
V9A      РЖА    '22'                    ,РЖ := '22'
         ПБ     V0                      ,переход на V0
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2L(М16)              ,М16 := BEN2L
V9B      СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2M(М16)              ,М16 := BEN2M
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2G(М16)              ,М16 := BEN2G
         СЧИМ   М16                     ,стек := М16, СМ := М16
RSYMBB   ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     '4020'(М7)              ,СМ := '4020'(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     11(М7)                  ,СМ := 11(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR26D                  ,если СМ≠0 → STR26D
         ПБ     STR26E                  ,переход на STR26E
*
         ПБ     RSYMBA                  ,переход на RSYMBA
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     9(М7)                   ,СМ := 9(М7)
         РЖА    '3'                     ,РЖ := '3'
V9C      ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     9(М7)                   ,9 := СМ
         СЧ     10(М7)                  ,СМ := 10(М7)
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     10(М7)                  ,10 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     STR26C                  ,переход на STR26C
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2J(М16)              ,М16 := BEN2J
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    DAR(М16)                ,М16 := DAR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2F(М16)              ,М16 := BEN2F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2K(М16)              ,М16 := BEN2K
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RNSYMB(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
DAR24A   РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     9(М7)                   ,СМ := 9(М7)
         МОДА   DAR24                   ,мод.адрес +1: DAR24
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   BEN1                    ,мод.адрес +1: BEN1
         СЧ     0                       ,СМ := 0
         ЗП     12(М7)                  ,12 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
DAR24B   СЧИМ                           ,СЧИ + магазин
         МОДА   BEN13                   ,мод.адрес +1: BEN13
         СЧ     0                       ,СМ := 0
DAR24C   РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     V9                      ,если СМ≠0 → V9
         ПБ     V9A                     ,переход на V9A
*
         СЧ     7(М7)                   ,СМ := 7(М7)
         РЖА    '3'                     ,РЖ := '3'
         МОДА   BEN                     ,мод.адрес +1: BEN
         СЛ     0                       ,СМ += 0
         ЗП     12(М7)                  ,12 := СМ
         РЖА    '22'                    ,РЖ := '22'
BENA     СЧ     12(М7)                  ,СМ := 12(М7)
         ЗП     13(М7)                  ,13 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     1(М7)                   ,СМ := 1(М7)
BENB     СЧИМ                           ,СЧИ + магазин
         МОДА   BEN2                    ,мод.адрес +1: BEN2
         СЧ     0                       ,СМ := 0
BENC     РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
BEND     ПЕ     V9B                     ,если СМ≠0 → V9B
         ПБ     RSYMBB                  ,переход на RSYMBB
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   BEN2                    ,мод.адрес +1: BEN2
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     5(М7)                   ,5 := СМ
         СЧ     13(М7)                  ,СМ := 13(М7)
         УИА    BEN2H(М16)              ,М16 := BEN2H
         ПВ     IDII(М15)               ,вызов через М15
         ЗП     13(М7)                  ,13 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   BEN2                    ,мод.адрес +1: BEN2
BEN2A    СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     5(М7)                   ,5 := СМ
BEN2B    СЧ     13(М7)                  ,СМ := 13(М7)
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         УИА    BEN2H(М16)              ,М16 := BEN2H
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЛ     12(М7)                  ,СМ += 12(М7)
         ЗП     14(М7)                  ,14 := СМ
BEN2C    МОДА   BEN2                    ,мод.адрес +1: BEN2
         СЧ     0                       ,СМ := 0
         ВЧ     14(М7)                  ,СМ -= 14(М7)
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     15(М7)                  ,15 := СМ
BEN2D    СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     16(М7)                  ,16 := СМ
         МОДА   RAI                     ,мод.адрес +1: RAI
         СЧ     0                       ,СМ := 0
BEN2E    ЗП     17(М7)                  ,17 := СМ
BEN2F    СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     18(М7)                  ,18 := СМ
BEN2G    СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     19(М7)                  ,19 := СМ
BEN2H    РЖА    '22'                    ,РЖ := '22'
BEN2I    МОДА   0                       ,мод.адрес +1: 0
         СЧ     '4020'(М7)              ,СМ := '4020'(М7)
BEN2J    МОД    BEN2P                   ,мод.адрес по коду: BEN2P
BEN2K    УИА    0(М1)                   ,М1 := 0
BEN2L    МОДА   BEN2U(М1)               ,мод.адрес +1: BEN2U(М1)
BEN2M    ЗП     0                       ,0 := СМ
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     19(М7)                  ,СМ := 19(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     19(М7)                  ,19 := СМ
BEN2N    ВЧОБ   4(М7)                   ,СМ := (адрес) - СМ
BEN2O    РЖА    '22'                    ,РЖ := '22'
BEN2P    ПО     V9C                     ,если СМ=0 → V9C
BEN2Q    МОДА   RAI                     ,мод.адрес +1: RAI
BEN2R    СЧ     0                       ,СМ := 0
BEN2S    РЖА    '3'                     ,РЖ := '3'
BEN2T    МОДА   STR25                   ,мод.адрес +1: STR25
BEN2U    ВЧ     0                       ,СМ -= 0
BEN2V    ЗП     20(М7)                  ,20 := СМ
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25(М16)              ,М16 := STR25
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2V(М16)              ,М16 := BEN2V
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25(М16)              ,М16 := STR25
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2Q(М16)              ,М16 := BEN2Q
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RNSYMB(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     21(М7)                  ,21 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     BEN2A                   ,переход на BEN2A
*
         МОДА   0                       ,мод.адрес +1: 0
         УИА    BEN3(М16)               ,М16 := BEN3
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2R(М16)              ,М16 := BEN2R
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2O(М16)              ,М16 := BEN2O
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2G(М16)              ,М16 := BEN2G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         МОДА   BEN                     ,мод.адрес +1: BEN
         ВЧ     0                       ,СМ -= 0
         ЗП     18(М7)                  ,18 := СМ
         ВЧ     17(М7)                  ,СМ -= 17(М7)
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     22(М7)                  ,22 := СМ
         СЧ     21(М7)                  ,СМ := 21(М7)
         ВЧ     15(М7)                  ,СМ -= 15(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПО     DAR24B                  ,если СМ=0 → DAR24B
         ПБ     DAR24C                  ,переход на DAR24C
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     16(М7)                  ,СМ := 16(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     16(М7)                  ,16 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     21(М7)                  ,СМ := 21(М7)
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     5(М7)                   ,5 := СМ
         СЧ     13(М7)                  ,СМ := 13(М7)
         УИА    BEN2H(М16)              ,М16 := BEN2H
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЛ     17(М7)                  ,СМ += 17(М7)
         СЛ     16(М7)                  ,СМ += 16(М7)
         ЗП     23(М7)                  ,23 := СМ
         МОДА   BEN2                    ,мод.адрес +1: BEN2
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         СЧ     21(М7)                  ,СМ := 21(М7)
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     BENA                    ,если СМ=0 → BENA
         ПБ     BENB                    ,переход на BENB
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     22(М7)                  ,СМ -= 22(М7)
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     23(М7)                  ,23 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     21(М7)                  ,СМ := 21(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     BENC                    ,если СМ=0 → BENC
         ПБ     BEND                    ,переход на BEND
*
         СЧ     17(М7)                  ,СМ := 17(М7)
         ЗП     23(М7)                  ,23 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2N(М16)              ,М16 := BEN2N
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2V(М16)              ,М16 := BEN2V
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2T(М16)              ,М16 := BEN2T
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    BEN2S(М16)              ,М16 := BEN2S
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RNSYMB(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     2(М7)                   ,СМ := 2(М7)
         УИА    BEN(М16)                ,М16 := BEN
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     18(М7)                  ,СМ += 18(М7)
         ЗП     17(М7)                  ,17 := СМ
         РЖА    '22'                    ,РЖ := '22'
         СЧ     21(М7)                  ,СМ := 21(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     21(М7)                  ,21 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   BEN2                    ,мод.адрес +1: BEN2
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ПО     DAR24A                  ,если СМ=0 → DAR24A
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     24(М7)                  ,24 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОД    BEN2U                   ,мод.адрес по коду: BEN2U
         УИА    0(М1)                   ,М1 := 0
         МОДА   BEN2U(М1)               ,мод.адрес +1: BEN2U(М1)
         СЧ     0                       ,СМ := 0
         МОДА   STR32767(М1)            ,мод.адрес +1: STR32767(М1)
         ЗП     0                       ,0 := СМ
         СЧ     24(М7)                  ,СМ := 24(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     24(М7)                  ,24 := СМ
         ВЧОБ   4(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     BEN2B                   ,если СМ=0 → BEN2B
         ПБ     BEN2D                   ,переход на BEN2D
*
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    BEN2E(М7)               ,М7 := BEN2E
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*
         МОДА   0                       ,мод.адрес +1: 0

