***************************************************
* TOKREZ - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 18464 образа SIPROD.BIN
*   Длина при загрузке: 87 слов, 142 команд
*   Вход: TOKREZ
*   Выход: смещение 207, через М12, смещение 214, через М10
*   Внешние: SCANER, INS, KLAIDA, RSYMB, SYTINT, L8
*   Смещения в INS: 24, 25, 26
*   Смещения в SCANER: 1, 2
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*
* СИМВОЛЫ МОДУЛЯ (номер - имя):
*   001 SCANER
*   002 SCANER1
*   003 SCANER2
*   004 INS
*   005 INS24
*   006 INS25
*   007 INS26
*   008 KLAIDA
*   009 RSYMB
*   010 SYTINT
*   011 L8
*
TOKREZ   СТАРТ  0
         УИА    V1(М16)                 ,М16 := V1
V1       ПБ     SCANEH                  ,переход на SCANEH
         СЧ     1(М7)                   ,СМ := 1(М7)
V1A      ЗП     8(М7)                   ,8 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     '4014'(М7)              ,СМ := '4014'(М7)
         МОД    SCANEK                  ,мод.адрес по коду: SCANEK
         УИА    0(М1)                   ,М1 := 0
         МОД    SCANEO                  ,мод.адрес по коду: SCANEO
         ЗП     '4014'(М1)              ,'4014' := СМ
         МОДА   0                       ,мод.адрес +1: 0
V1B      СЧ     8(М7)                   ,СМ := 8(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     8(М7)                   ,8 := СМ
         ВЧОБ   4(М7)                   ,СМ := (адрес) - СМ
         РЖА    '22'                    ,РЖ := '22'
         ПО     V1A                     ,если СМ=0 → V1A
         СЧ     0(М7)                   ,СМ := 0(М7)
V1C      МОД    SCANEP                  ,мод.адрес по коду: SCANEP
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
L8A      ПВ     L8(М15)                 ,вызов через М15
SCANEA   МОДА   0                       ,мод.адрес +1: 0
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
SCANEB   ВЧ     1(М7)                   ,СМ -= 1(М7)
SCANEC   ЗП     9(М7)                   ,9 := СМ
         СЧ     3(М7)                   ,СМ := 3(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SCANER1                 ,мод.адрес +1: SCANER1
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V1C                     ,если СМ=0 → V1C
         ПБ     SCANEA                  ,переход на SCANEA
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   INS26                   ,мод.адрес +1: INS26
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     L8A                     ,если СМ≠0 → L8A
         ПБ     SCANEA                  ,переход на SCANEA
         ПБ     V1B                     ,переход на V1B
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     5(М7)                   ,СМ := 5(М7)
         СЧИМ                           ,СЧИ + магазин
         МОДА   SCANER1                 ,мод.адрес +1: SCANER1
         СЧ     0                       ,СМ := 0
SCANED   НТЖ    0(М17)                  ,СМ ^= 0(М17)
SCANEE   ПЕ     SCANEB                  ,если СМ≠0 → SCANEB
SCANEF   ПБ     SCANEC                  ,переход на SCANEC
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SCANEF                  ,переход на SCANEF
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   SCANER                  ,мод.адрес +1: SCANER
SCANEG   СЧ     0                       ,СМ := 0
SCANEH   РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     10(М7)                  ,10 := СМ
         УИА    INS(М16)                ,М16 := INS
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    SCANEL(М16)             ,М16 := SCANEL
SCANEI   СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    SCANEM(М16)             ,М16 := SCANEM
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
SYTINA   ПВ     SYTINT(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
SCANEJ   РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     10(М7)                  ,СМ := 10(М7)
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         ЗП     0                       ,0 := СМ
         РЖА    '3'                     ,РЖ := '3'
SCANEK   МОД    SCANEP                  ,мод.адрес по коду: SCANEP
         СЧ     0                       ,СМ := 0
SCANEL   СЛ     1(М7)                   ,СМ += 1(М7)
SCANEM   МОД    SCANEP                  ,мод.адрес по коду: SCANEP
SCANEN   ЗП     0                       ,0 := СМ
SCANEO   УИА    SCANEM(М16)             ,М16 := SCANEM
SCANEP   СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    SCANEJ(М16)             ,М16 := SCANEJ
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    SCANEO                  ,мод.адрес по коду: SCANEO
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    SCANEP                  ,мод.адрес по коду: SCANEP
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   SCANER                  ,мод.адрес +1: SCANER
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   INS26                   ,мод.адрес +1: INS26
         ВЧ     0                       ,СМ -= 0
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     SCANED                  ,если СМ≠0 → SCANED
         ПБ     SCANEE                  ,переход на SCANEE
         ПБ     V1B                     ,переход на V1B
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SCANEG                  ,переход на SCANEG
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     6(М7)                   ,СМ := 6(М7)
         ЗП     12(М7)                  ,12 := СМ
         РЖА    '3'                     ,РЖ := '3'
         УИА    SCANEN(М16)             ,М16 := SCANEN
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     KLAIDA(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     SCANEI                  ,переход на SCANEI
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    SYTINA(М7)              ,М7 := SYTINA
         ЗПМ    14(М7)                  ,ЗП + магазин: 14(М7)
         ЗПМ    13(М7)                  ,ЗП + магазин: 13(М7)
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
         МОДА   0                       ,мод.адрес +1: 0

