***************************************************
* TOPAGE - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 14304 образа SIPROD.BIN
*   Длина при загрузке: 94 слов, 170 команд
*   Вход: TOPAGE
*   Выход: ENDPG:STANDG, ENDSTR:FRAMEA+1, SCHEMA:TXT3A, SPAUD:SCAN90+1, 
*   VIAPUZ:STANDA, VIAPUZ:STANDE+1, EGO32C (возврат через М12), 
*   EGO32C (возврат через М10)
*   НАЧАЛО НОВОЙ СТРАНИЦЫ.
*   Внешние: REGIM, SEK, TXT, EGO, NUST, STR, NDAB, RSYMB, RNSYMB, IMUI
*   Смещения в EGO: 2400, 4800, 7200
*   Смещения в NDAB: 1, 2, 3
*   Смещения в REGIM: 1
*   Смещения в SEK: 3
*   Смещения в STR: 24, 25, 26
*   Смещения в TXT: 3
*   Регистры: М1, М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 REGIM
*   002 SEK
*   003 TXT
*   004 TXT3
*   005 EGO
*   006 EGO2400
*   007 EGO4800
*   008 EGO7200
*   009 NUST
*   010 STR
*   011 STR24
*   012 STR25
*   013 STR26
*   014 NDAB
*   015 NDAB1
*   016 NDAB2
*   017 NDAB3
*   018 RSYMB
*   019 RNSYMB
*   020 IMUI
*   021 SEK3
*   022 EGO35167
*   023 EGO37567
*   024 EGO32767
*   025 REGIM1
*
*** КОД МОДУЛЯ
*
TOPAGE   СТАРТ  0
         УИА    NDABA(М16)              ,М16 := NDABA
NDABA    ПБ     EGO37B                  ,переход на EGO37B
*
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     0(М7)                   ,СМ -= 0(М7)
         УИА    EGO327(М16)             ,М16 := EGO327
         ПВ     IMUI(М15)               ,вызов через М15
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     5(М7)                   ,5 := СМ
         МОДА   STR26                   ,мод.адрес +1: STR26
         СЧ     0                       ,СМ := 0
STR26A   МОДА   STR25                   ,мод.адрес +1: STR25
STR26B   ВЧ     0                       ,СМ -= 0
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     6(М7)                   ,6 := СМ
         СЧ     2(М7)                   ,СМ := 2(М7)
STR26C   СЧИМ                           ,СЧИ + магазин
         МОДА   TXT3                    ,мод.адрес +1: TXT3
         СЧ     0                       ,СМ := 0
         РЖА    '22'                    ,РЖ := '22'
STR26D   НТЖ    0(М17)                  ,СМ ^= 0(М17)
STR26E   ПО     STR26A                  ,если СМ=0 → STR26A
         ПБ     STR26B                  ,переход на STR26B
*
         ПБ     SEK3D                   ,переход на SEK3D
*
         МОДА   0                       ,мод.адрес +1: 0
SEK3A    СЧ     0(М7)                   ,СМ := 0(М7)
SEK3B    СЧИМ                           ,СЧИ + магазин
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR26C                  ,если СМ≠0 → STR26C
         ПБ     STR26E                  ,переход на STR26E
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
SEK3C    МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     STR26D                  ,если СМ≠0 → STR26D
         ПБ     STR26E                  ,переход на STR26E
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SEK3D                   ,переход на SEK3D
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
SEK3D    СЧИМ                           ,СЧИ + магазин
         МОДА   SEK3                    ,мод.адрес +1: SEK3
         СЧ     0                       ,СМ := 0
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     SEK3A                   ,если СМ≠0 → SEK3A
         ПБ     SEK3B                   ,переход на SEK3B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     SEK3C                   ,переход на SEK3C
*
EGO351   МОДА   0                       ,мод.адрес +1: 0
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
EGO35A   УИА    STR25(М16)              ,М16 := STR25
         СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    EGO32A                  ,мод.адрес по коду: EGO32A
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO35167(М1)            ,мод.адрес +1: EGO35167(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25(М16)              ,М16 := STR25
         СЧИМ   М16                     ,стек := М16, СМ := М16
EGO35B   УИА    EGO32B(М16)             ,М16 := EGO32B
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RNSYMB(М15)             ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     EGO351                  ,переход на EGO351
*
EGO375   МОДА   0                       ,мод.адрес +1: 0
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25(М16)              ,М16 := STR25
         СЧИМ   М16                     ,стек := М16, СМ := М16
EGO37A   МОД    EGO32A                  ,мод.адрес по коду: EGO32A
EGO37B   УИА    0(М1)                   ,М1 := 0
         МОДА   EGO37567(М1)            ,мод.адрес +1: EGO37567(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25(М16)              ,М16 := STR25
EGO37C   СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    EGO32B(М16)             ,М16 := EGO32B
         СЧИМ   М16                     ,стек := М16, СМ := М16
RNSYMA   ПВ     RNSYMB(М15)             ,вызов через М15
WAIT     РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     EGO351                  ,переход на EGO351
*
EGO327   МОДА   0                       ,мод.адрес +1: 0
         УИА    STR(М16)                ,М16 := STR
EGO32A   СЧИМ   М16                     ,стек := М16, СМ := М16
EGO32B   УИА    STR25(М16)              ,М16 := STR25
EGO32C   СЧИМ   М16                     ,стек := М16, СМ := М16
         МОД    EGO32A                  ,мод.адрес по коду: EGO32A
         УИА    0(М1)                   ,М1 := 0
         МОДА   EGO32767(М1)            ,мод.адрес +1: EGO32767(М1)
         УИА    0(М16)                  ,М16 := 0
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR25(М16)              ,М16 := STR25
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    EGO32B(М16)             ,М16 := EGO32B
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RNSYMB(М15)             ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   STR25                   ,мод.адрес +1: STR25
         СЧ     0                       ,СМ := 0
         ЗП     7(М7)                   ,7 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     EGO35B                  ,переход на EGO35B
*
         УИА    RNSYMA(М16)             ,М16 := RNSYMA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    WAIT(М16)               ,М16 := WAIT
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    STR(М16)                ,М16 := STR
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    EGO32C(М16)             ,М16 := EGO32C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     RSYMB(М15)              ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     7(М7)                   ,СМ := 7(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     0(М7)                   ,СМ += 0(М7)
         ЗП     7(М7)                   ,7 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   STR26                   ,мод.адрес +1: STR26
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ПО     EGO35A                  ,если СМ=0 → EGO35A
         МОДА   REGIM1                  ,мод.адрес +1: REGIM1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         СЛ     0(М7)                   ,СМ += 0(М7)
         РЖА    '22'                    ,РЖ := '22'
         ПЕ     EGO375                  ,если СМ≠0 → EGO375
         ПБ     EGO37A                  ,переход на EGO37A
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   REGIM1                  ,мод.адрес +1: REGIM1
         СЛ     0                       ,СМ += 0
         ВЧ     0(М7)                   ,СМ -= 0(М7)
         МОДА   NDAB                    ,мод.адрес +1: NDAB
         ЗП     0                       ,0 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     EGO37C                  ,переход на EGO37C
*
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    WAIT(М7)                ,М7 := WAIT
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М1                      ,стек := М1, СМ := М1
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М1                      ,М1 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*
         МОДА   0                       ,мод.адрес +1: 0

