***************************************************
* TWOPLA - МОДУЛЬ СИПРОДА
*   Источник: личная библиотека (PERSO, зона 2702,
*   том 2248), слово 7264 образа SIPROD.BIN
*   Длина при загрузке: 204 слов, 334 команд
*   Вход: TWOPLA
*   Выход: WRITEH:WRIHOA+1, INS26B (возврат через М12), 
*   INS26B (возврат через М10)
*   Внешние: VER, PAGE, ONE, KORT, NUM, KOMA, INS, WRINUM, GETSTR, RASPS, 
*   RNSYMB, WRIKOR, ENDKOR, IDII, IMUI
*   Смещения в INS: 24, 25, 26
*   Смещения в KOMA: 2, 7
*   Смещения в KORT: 14
*   Смещения в NUM: 2, 3
*   Смещения в ONE: 1, 2
*   Смещения в PAGE: 1
*   Смещения в VER: 4
*   Регистры: М7, М10, М12, М15, М16, М17
***************************************************
*** СИМВОЛЫ МОДУЛЯ
*   001 VER
*   002 VER4
*   003 PAGE
*   004 ONE
*   005 ONE1
*   006 ONE2
*   007 KORT
*   008 KORT14
*   009 NUM
*   010 NUM2
*   011 NUM3
*   012 KOMA
*   013 KOMA2
*   014 KOMA7
*   015 INS
*   016 INS24
*   017 INS25
*   018 INS26
*   019 WRINUM
*   020 GETSTR
*   021 RASPS
*   022 RNSYMB
*   023 WRIKOR
*   024 ENDKOR
*   025 PAGE1
*   026 IDII
*   027 IMUI
*
*** КОД МОДУЛЯ
*
TWOPLA   СТАРТ  0
         УИА    PAGE1A(М16)             ,М16 := PAGE1A
PAGE1A   ПБ     V3                      ,переход на V3
*
         МОДА   PAGE1                   ,мод.адрес +1: PAGE1
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         УИА    V3F(М16)                ,М16 := V3F
         ПВ     IDII(М15)               ,вызов через М15
         МОДА   PAGE1                   ,мод.адрес +1: PAGE1
         СЛ     0                       ,СМ += 0
         ЗП     9(М7)                   ,9 := СМ
         УИА    NUM3(М16)               ,М16 := NUM3
         ПВ     IDII(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ЗП     10(М7)                  ,10 := СМ
         МОДА   ONE1                    ,мод.адрес +1: ONE1
         ЗП     0                       ,0 := СМ
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     11(М7)                  ,11 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
V0       УИА    KOMA7(М16)              ,М16 := KOMA7
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         УИА    KOMA2(М16)              ,М16 := KOMA2
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3G(М16)                ,М16 := V3G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
V1       СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     12(М7)                  ,12 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПБ     V10A                    ,переход на V10A
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     13(М7)                  ,13 := СМ
         РЖА    '3'                     ,РЖ := '3'
         СЧ     3(М7)                   ,СМ := 3(М7)
         УИА    V13D(М16)               ,М16 := V13D
         ПВ     IMUI(М15)               ,вызов через М15
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     14(М7)                  ,14 := СМ
         УИА    VER(М16)                ,М16 := VER
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V13E(М16)               ,М16 := V13E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V13C(М16)               ,М16 := V13C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3H(М16)                ,М16 := V3H
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3G(М16)                ,М16 := V3G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
RNSYMA   ПВ     RNSYMB(М15)             ,вызов через М15
V10      РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     10(М7)                  ,СМ := 10(М7)
V10A     РЖА    '3'                     ,РЖ := '3'
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         УИА    V3G(М16)                ,М16 := V3G
         ПВ     IDII(М15)               ,вызов через М15
V10B     МОДА   0                       ,мод.адрес +1: 0
         СЛ     11(М7)                  ,СМ += 11(М7)
         ЗП     15(М7)                  ,15 := СМ
         РЖА    '22'                    ,РЖ := '22'
V10C     МОДА   0                       ,мод.адрес +1: 0
         СЧ     13(М7)                  ,СМ := 13(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     13(М7)                  ,13 := СМ
         УИА    V13F(М16)               ,М16 := V13F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3K(М16)                ,М16 := V3K
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3K(М16)                ,М16 := V3K
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V13G(М16)               ,М16 := V13G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3H(М16)                ,М16 := V3H
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3G(М16)                ,М16 := V3G
         СЧИМ   М16                     ,стек := М16, СМ := М16
V13      РЖА    '22'                    ,РЖ := '22'
RASPSA   ПВ     RASPS(М15)              ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         УИА    V13G(М16)               ,М16 := V13G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3H(М16)                ,М16 := V3H
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3G(М16)                ,М16 := V3G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         УИА    KOMA(М16)               ,М16 := KOMA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    WRIKOA(М16)             ,М16 := WRIKOA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
V15      СЧ     15(М7)                  ,СМ := 15(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     10(М7)                  ,СМ += 10(М7)
V15A     ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     15(М7)                  ,15 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
V1A      СЧИМ                           ,СЧИ + магазин
         СЧ     13(М7)                  ,СМ := 13(М7)
         РЖА    '22'                    ,РЖ := '22'
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
V13A     ПО     RNSYMA                  ,если СМ=0 → RNSYMA
V13B     ПБ     V10                     ,переход на V10
*
         ПБ     V1                      ,переход на V1
*
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     12(М7)                  ,СМ := 12(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     12(М7)                  ,12 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUM3                    ,мод.адрес +1: NUM3
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ПО     V0                      ,если СМ=0 → V0
         СЧ     0(М7)                   ,СМ := 0(М7)
         ЗП     13(М7)                  ,13 := СМ
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
NUM3A    СЧ     13(М7)                  ,СМ := 13(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
NUM3B    ЗП     13(М7)                  ,13 := СМ
         СЧ     1(М7)                   ,СМ := 1(М7)
         ЗП     17(М7)                  ,17 := СМ
         РЖА    '22'                    ,РЖ := '22'
         ПБ     NUM3B                   ,переход на NUM3B
*
ENDKOA   ПВ     ENDKOR(М15)             ,вызов через М15
V1B      МОДА   0                       ,мод.адрес +1: 0
         СЧ     3(М7)                   ,СМ := 3(М7)
         УИА    V13H(М16)               ,М16 := V13H
         ПВ     IMUI(М15)               ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         ВЧ     1(М7)                   ,СМ -= 1(М7)
         ЗП     18(М7)                  ,18 := СМ
         УИА    KOMA(М16)               ,М16 := KOMA
V3       СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V13I(М16)               ,М16 := V13I
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
V3A      РЖА    '22'                    ,РЖ := '22'
         ПВ     WRIKOR(М15)             ,вызов через М15
V3B      МОДА   0                       ,мод.адрес +1: 0
V3C      РЖА    '3'                     ,РЖ := '3'
V3D      РЖА    '22'                    ,РЖ := '22'
V3E      УИА    KOMA7(М16)              ,М16 := KOMA7
V3F      СЧИМ   М16                     ,стек := М16, СМ := М16
V3G      УИА    V3G(М16)                ,М16 := V3G
V3H      СЧИМ   М16                     ,стек := М16, СМ := М16
V3I      УИА    V3E(М16)                ,М16 := V3E
V3J      СЧИМ   М16                     ,стек := М16, СМ := М16
WRIKOA   ПВ     WRIKOR(М15)             ,вызов через М15
V3K      МОДА   0                       ,мод.адрес +1: 0
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
V13C     СЧ     13(М7)                  ,СМ := 13(М7)
V13D     НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПЕ     V13                     ,если СМ≠0 → V13
V13E     ПБ     RASPSA                  ,переход на RASPSA
*
V13F     ПБ     V15                     ,переход на V15
*
V13G     МОДА   0                       ,мод.адрес +1: 0
V13H     УИА    INS26B(М16)             ,М16 := INS26B
V13I     СЧИМ   М16                     ,стек := М16, СМ := М16
GETSTA   ПВ     GETSTR(М15)             ,вызов через М15
INS26A   МОДА   0                       ,мод.адрес +1: 0
INS26B   МОДА   INS26                   ,мод.адрес +1: INS26
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         МОДА   INS25                   ,мод.адрес +1: INS25
         ВЧ     0                       ,СМ -= 0
         ЗП     19(М7)                  ,19 := СМ
         УИА    V3C(М16)                ,М16 := V3C
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3F(М16)                ,М16 := V3F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     WRIKOR(М15)             ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         УИА    INS(М16)                ,М16 := INS
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    INS25(М16)              ,М16 := INS25
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    GETSTA(М16)             ,М16 := GETSTA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         ПВ     ENDKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         УИА    V3B(М16)                ,М16 := V3B
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3I(М16)                ,М16 := V3I
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3F(М16)                ,М16 := V3F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     3(М7)                   ,СМ := 3(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     13(М7)                  ,СМ := 13(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V15A                    ,если СМ=0 → V15A
         ПБ     V1A                     ,переход на V1A
*
         УИА    V13H(М16)               ,М16 := V13H
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRINUM(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         МОДА   NUM3                    ,мод.адрес +1: NUM3
         СЧ     0                       ,СМ := 0
         СЧИМ                           ,СЧИ + магазин
         СЧ     17(М7)                  ,СМ := 17(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     V13A                    ,если СМ=0 → V13A
         ПБ     V13B                    ,переход на V13B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     NUM3A                   ,переход на NUM3A
*
         МОДА   0                       ,мод.адрес +1: 0
         ПВ     ENDKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         СЧ     18(М7)                  ,СМ := 18(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     20(М7)                  ,20 := СМ
         УИА    KOMA(М16)               ,М16 := KOMA
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    INS26A(М16)             ,М16 := INS26A
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     WRIKOR(М15)             ,вызов через М15
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         УИА    KOMA7(М16)              ,М16 := KOMA7
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3G(М16)                ,М16 := V3G
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         УИА    V3B(М16)                ,М16 := V3B
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3J(М16)                ,М16 := V3J
         СЧИМ   М16                     ,стек := М16, СМ := М16
         ПВ     WRIKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '22'                    ,РЖ := '22'
         СЧ     17(М7)                  ,СМ := 17(М7)
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         ЗП     17(М7)                  ,17 := СМ
         РЖА    '22'                    ,РЖ := '22'
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   NUM3                    ,мод.адрес +1: NUM3
         ВЧОБ   0                       ,СМ := (адрес) - СМ
         ПО     V10C                    ,если СМ=0 → V10C
         СЧ     1(М7)                   ,СМ := 1(М7)
         СЧИМ                           ,СЧИ + магазин
         СЧ     13(М7)                  ,СМ := 13(М7)
         НТЖ    0(М17)                  ,СМ ^= 0(М17)
         ПО     ENDKOA                  ,если СМ=0 → ENDKOA
         ПБ     V1B                     ,переход на V1B
*
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V10B                    ,переход на V10B
*
         МОДА   0                       ,мод.адрес +1: 0
         МОДА   KORT14                  ,мод.адрес +1: KORT14
         СЧ     0                       ,СМ := 0
         РЖА    '3'                     ,РЖ := '3'
         СЛ     1(М7)                   ,СМ += 1(М7)
         МОДА   KORT14                  ,мод.адрес +1: KORT14
         ЗП     0                       ,0 := СМ
         УИА    KOMA7(М16)              ,М16 := KOMA7
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3F(М16)                ,М16 := V3F
         СЧИМ   М16                     ,стек := М16, СМ := М16
         УИА    V3E(М16)                ,М16 := V3E
         СЧИМ   М16                     ,стек := М16, СМ := М16
         РЖА    '22'                    ,РЖ := '22'
         ПВ     WRIKOR(М15)             ,вызов через М15
         ПВ     ENDKOR(М15)             ,вызов через М15
         МОДА   0                       ,мод.адрес +1: 0
         ПБ     V3A                     ,переход на V3A
*
         МОДА   0                       ,мод.адрес +1: 0
         УИИ    М10(М7)                 ,М10 := М7
         УИИ    М12(М16)                ,М12 := М16
         УИА    V3D(М7)                 ,М7 := V3D
         СЧИМ   М15                     ,стек := М15, СМ := М15
         СЧИМ   М10                     ,стек := М10, СМ := М10
         СЧИМ                           ,СЧИ + магазин
         РЖА    '3'                     ,РЖ := '3'
         РЖА    '2'                     ,РЖ := '2'
         ПБ     0(М12)                  ,переход через М12
*
         МОДА   0                       ,мод.адрес +1: 0
         УИМ                            ,УИ + магазин
         УИМ    М7                      ,М7 := СМ + стек
         УИМ    М10                     ,М10 := СМ + стек
         ПБ     0(М10)                  ,переход через М10
*

